{"title":"The Century of Sex (gnv64)","uid":7941277,"size":17094733,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:005aab1a9dfcf08ed65c45fa07dc22505fef32b3&amp;dn=The+Century+of+Sex+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1355990175,"description":"The Century of Sex: Playboy's History of the Sexual Revolution, 1900-1999 \nby James R. Petersen and Hugh M. Hefner\nGrove Press | October 1999 | ISBN-10: 0802116523 | DJVU | 548 pages | 16.3 mb &lt;a href=&quot;\nhttp://www.amazon.com/The-Century-Sex-Revolution-1900-1999/dp/B000OV16OE&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/The-Century-Sex-Revolution-1900-1999/dp/B000OV16OE&lt;/a&gt;\n\nThe Century of Sex is a comprehensive  chronicle of sexual mores, relations,  and politics in the twentieth century. \nJames R. Petersen argues that the &quot;Sexual  Revolution&quot; began generations before the  advent of penicillin, Playboy, and the Pill-and  ultimately produced seismic cultural shifts that  have changed forever the way Americans live. \nBeginning at the turn of the century with  the pioneering efforts of Free Love radicals, The  Century of Sex chronicles the ensuing struggles of activists for sexual liberation against the agents of repression. Petersen weaves a decade-by-decade narrative packed with colorful characters, a panoply of causes, and unforgettable events. He profiles the activities of censors like Anthony Comstock-head of the New York Society for the Suppression of Vice-and agencies such as the Legion of Decency and the Moral Majority, and culminates with the prosecutorial inquisitions of Kenneth Starr. He introduces heroines such as Ida Craddock, who wrote one of the nation's first marriage manuals (and paid for the act with her life), Margaret Sanger, who fought with Comstock over birth control-and won-and heroes like Alfred Charles Kinsey, whose groundbreaking research changed the way we look at sex. Throughout the narrative, The Century of Sex explores the ways in which historical tumults of the 1900s affected sex-and vice versa-through the Jazz Age, the depression, two world wars, the cold war, the sixties, the disco era, and the age of AIDS. The book covers America's periodic moral panics, from the  white-slave hysteria of 1910, to the homosexual panc of the 1950s, to the child-porn scare of the 1980s, and also traces the changes ,wrought by medical science, social science, and technology, from the vibrator to home video to Viagra. The Century of Sex is a trenchant chronicle of a turbulent era that proves the truth behind the song lyric from the 1944 movie Pin-Up Girl, &quot;Battles are won in the day time/But history is made at night.&quot; \n\nJAMES R. PETERSEN ,wrote and edited the &quot;Playboy Advisor,&quot; America\u001fs longest-running sex-advice column, for over twenty years. He is the author of 365 ways to Improve YOur Sex Life and has also written for Outside\u001f Diversion, Sports Illustrated, American Way, Ski, and Parenting. \nHUGH M. HEFNER is the editor-in-chief of Playboy magazine, which he founded in in 1953","torrent":{"xt":"urn:btih:005aab1a9dfcf08ed65c45fa07dc22505fef32b3","amp;dn":"The+Century+of+Sex+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"005aab1a9dfcf08ed65c45fa07dc22505fef32b3","infoHashBuffer":{"type":"Buffer","data":[0,90,171,26,157,252,240,142,214,92,69,250,7,220,34,80,95,239,50,179]},"announce":[],"urlList":[]}}