{"title":"The Communist Manifesto by Karl Marx and Friedrich Engels","uid":6835616,"size":93678858,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:00ce55c1e2607d45bd7d64148ff8aea9f00100eb&amp;dn=The+Communist+Manifesto+by+Karl+Marx+and+Friedrich+Engels++&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"michaelrizzo","files":-1,"time":1322015031,"description":"There are contained within this folder two works offered in a reading\nin the first place of the Communist manifesto of Karl Marx and Friedrich\nEngels and in the second an explanatory work with excerpts from the said\nwork provided through the Giants of Political thought series of offerings.\n\nThe reading of the text in the former mentioned work is performed for you\nby Chris Gaffney - a nice Australian gentleman  I gather by the accent \nand its certainly nice although he skips a beat for an instant now and then\nperhaps - nothing anyone should notice as its a greatly refreshing approach\nto have such a great human spirit to read to us all and that is my view of\nthat part of the world generally I might add.\n\nThen of course there is the other work that is here included and this \nis for us scripted by Mr Ralph Raico and narrated mainly by Mr. Craig\nDeitchman amongst others. It is published by Knowledge Products who only\nsee fit to offer audiotape versions at their own website for some godforsaken\nreason.\n\nCommunism is a cruel and oppressive system in respect of the unfairness\nto those of merit and therefore fundamentally unjust as it goes far beyond the\nconcept of a more humane welfare state into the realm of the inane in this\nregard. As such the system of government that seeks to maintain it is by\nnecessity, similarly flawed in respect of validity to good human conscience\nboth in respect of tactics and ends that are sought to be brought about to\nthose that labour under it.\n\nMarx seems to be on a strange tangent of sorts in thinking that while workers\nprovide value, the capitalist does not do anything but oppress him in this.\nIn particular his concept of surplus value seems to endeavour to treat as \n&quot;on the table and available to workers&quot; perhaps all of whatever part it is that\nrightly belongs to those that instead employ them in the first place. Using such\ntactics as they are able to orchestrate I suspect - without regard to fairness\nto those who have other skills and assets to offer than simply of the actual\ndoing of labour of some oher forms that no doubt would be needed too in the\noverall enterprise if it is to succeed.\n\nSuch minds are not fair that see only their own side of things that goes for\nlabour extremists too as I submit.\n\nMichael Rizzo Chessman\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:00ce55c1e2607d45bd7d64148ff8aea9f00100eb","amp;dn":"The+Communist+Manifesto+by+Karl+Marx+and+Friedrich+Engels++","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00ce55c1e2607d45bd7d64148ff8aea9f00100eb","infoHashBuffer":{"type":"Buffer","data":[0,206,85,193,226,96,125,69,189,125,100,20,143,248,174,169,240,1,0,235]},"announce":[],"urlList":[]}}