{"title":"Douwe Draaisma - Waarom het leven sneller ga... (FLAC, 2007)","uid":10495648,"size":1301174243,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:01e70c9417967f3e9d349525027c0638e54bd976&amp;dn=Douwe+Draaisma+-+Waarom+het+leven+sneller+ga...+%28FLAC%2C+2007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":43,"time":1404615857,"description":"Voorgelezen door Jan Meng\n\nIn het autobiografische geheugen tekenen we onze persoonlijke lotgevallen op. Het is het register dat we raadplegen als iemand ons vraagt wat onze vroegste herinnering is, hoe het huis eruit zag waar we als kind hebben gewoond of wat het laatste boek is dat we hebben gelezen.\nHet autobiografische geheugen groeit samen met ons op. Het is onze intiemste metgezel, maar stelt ons ook voor vragen.\nWaarom trekt het zich zo weinig van onze opdrachten aan, maakt het zoek wat we hadden willen bewaren, of komt het kwispelstaartend aandragen wat we juist hadden weggegooid om het kwijt te raken? Waarom zijn we vrijwel alles vergeten wat voor ons derde of vierde gebeurde? Hoe komt het dat geuren zulke vroege herinneringen losmaken? Waarom hebben we zo'n feilloos geheugen voor krenkingen? Waarom lijkt het leven sneller te gaan als je ouder wordt?\n\n'Een briljant boek over vragen die we ons allemaal wel eens hebben gesteld, geschreven met de elegantie van een wetenschapper die zich voor iedereen begrijpelijk kan maken omdat hij zijn vak tot in de toppen van zijn vingers beheerst.' Ger Groot - De Groene Amsterdammer\n\n'Voor zowel vakbroeder als leek een buitengewoon mooi boek.' Ranne Hovius - Volkskrant\n\n'Jan Meng is een doorgewinterde voorlezer. Met zijn warme stemgeluid en treffende intonatie weet hij de aandacht voortdurend vast te houden.' Bas Maliepaard - Trouw\n","torrent":{"xt":"urn:btih:01e70c9417967f3e9d349525027c0638e54bd976","amp;dn":"Douwe+Draaisma+-+Waarom+het+leven+sneller+ga...+%28FLAC%2C+2007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01e70c9417967f3e9d349525027c0638e54bd976","infoHashBuffer":{"type":"Buffer","data":[1,231,12,148,23,150,127,62,157,52,149,37,2,124,6,56,229,75,217,118]},"announce":[],"urlList":[]}}