{"title":"Bandit Queen - Hormone Hotel [1995]","uid":9772960,"size":295307683,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0246beaac78474b6771e46f8032d503431616561&amp;dn=Bandit+Queen+-+Hormone+Hotel+%5B1995%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"GenXRock","files":-1,"time":1394984327,"description":"Review by Ned Raggett  [-]\nThe biting, aggressive swing of Hormone Hotel unfortunately never got the attention it should have upon the album's release in 1995, given the critical/commercial cachet of such acts as P J Harvey, Hole, and Elastica at nearly the same point in time. Bandit Queen's failure to make a mark was either surprising or, alternately, typical of an industry and media-base willing to go only so far but little more in accepting female-led bands. Regardless, all it takes is an initial spin of the opening track, &quot;Scorch,&quot; -- a great rocker that lives up to its name with a fierce yet controlled lead vocal from Goddings -- to realize that Bandit Queen deserved a wider audience somewhere. Pat Collier and John Robb, each separately doing another fine job of producing, bring out Galley's drum punch with both clarity and impact, while Goddings' guitar and Wolstenholme's bass kick and snarl just so. The trio whips up a series of tight numbers that draw on everything from reggae to the glorious Pixies/Nirvana loud/soft/loud combination. Goddings' proud, in-your-face and often openly lesbian lyrics exude a smart sass, while her lower-voiced singing could draw comparisons from Chrissie Hynde to Lynn Canfield, yet still has its own timbre and feel. Among the many highlights is the menacing &quot;Give It to the Dog,&quot; which switches between a slowly building verse interspersed with sudden guitar bursts and the more conventionally slamming chorus. The slightly queasy &quot;Overture for Beginners,&quot; with its heavily reverbed guitar and Goddings' sweetly wistful vocal (singing some distinctly unsweet lyrics) anchored to a charging, lovely chorus, is simply a treasure; it is perhaps the biggest should-have-been hit from the album. When the chorus of &quot;Big Sugar Emotional Thing&quot; completes the couplet with &quot;My heart goes zing, zing, zing,&quot; another perfect blow for rock's heartfelt simplicity at its best is struck. (3/5)","torrent":{"xt":"urn:btih:0246beaac78474b6771e46f8032d503431616561","amp;dn":"Bandit+Queen+-+Hormone+Hotel+%5B1995%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0246beaac78474b6771e46f8032d503431616561","infoHashBuffer":{"type":"Buffer","data":[2,70,190,170,199,132,116,182,119,30,70,248,3,45,80,52,49,97,101,97]},"announce":[],"urlList":[]}}