{"title":"Prime Time - Lichter, Rothman","uid":11718550,"size":12308847,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:02fa63fde862045dfbebdb6825d215d2be6ae497&amp;dn=Prime+Time+-+Lichter%2C+Rothman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1424705431,"description":"\nThe Lichter's and Rothman have laid bare TV's social agenda. This book is insightful, fair-minded, and always interesting.\nThe authors of this in-depth study analyze the royal road to America's fantasy life: television, which viewers watch for some four hours daily. Concentrating on prime-time series, their characterization and plotlines (news and documentaries are ignored), each area of programming is evaluated: the proliferation of violence (the authors find more violence on one cable outlet than on all the networks combined); sex (foreplay has surpassed gunplay as prime time's favorite pastime); female characterizations from Lucy Ricardo to Murphy Brown; the American family as portrayed from Father Knows Best to Roseanne; homosexuality; race (from Amos 'n' Andy to Archie Bunker); and abortion, one of the few sex-related issues that TV treats gingerly. The authors have written an insightful study aimed at a serious audience. \n\nAbout the author:\nThe Lichters are on the staff of the Center for Media and Public Affairs in Washington, D.C.; Rothman directs the Center for the Study of Social and Political Change at Smith College","torrent":{"xt":"urn:btih:02fa63fde862045dfbebdb6825d215d2be6ae497","amp;dn":"Prime+Time+-+Lichter%2C+Rothman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02fa63fde862045dfbebdb6825d215d2be6ae497","infoHashBuffer":{"type":"Buffer","data":[2,250,99,253,232,98,4,93,251,235,219,104,37,210,21,210,190,106,228,151]},"announce":[],"urlList":[]}}