{"title":"[JKS} Spartacus S03E10 XviD","uid":8370074,"size":670065815,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:04740168c99408993189d6e33b926d2bd8607d5a&amp;dn=%5BJKS%7D+Spartacus+S03E10+XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jksADIDAS","files":13,"time":1365884896,"description":"Spartacus S03E10\n\nXvid (.avi)\nEncode Information\nResolution....: 720x404\nVideo : XVID\nAudio : MP3 2ch 128khz\nFrame Rate : 29.97 fps\n\nIMDb: http://www.imdb.com/title/tt1442449/\nWiki: http://en.wikipedia.org/wiki/Spartacus_(TV_series)\nOfficial site: http://www.starz.com/originals/spartacus\n\nSpartacus is a New Zealand made historical epic series created by Steven S. DeKnight, who served as an executive producer alongside Sam Raimi and Rob Tapert. The series tells the story of a Thracian warrior who leads a rebellion against the Roman Republic. Initially the warrior, whose name is not given, agrees to fight alongside the Roman army to help defeat barbarians from a rival tribe, but he returns home to defend his village when a Roman general decides to abandon the warrior's village and ignore the barbarians to pursue glory elsewhere. Captured by the Romans as a deserter, his wife forced into slavery, the warrior is taken to Capua to be put to death by gladiators before the public. Here the warrior proves his worth as a fighter and is sent to the House of Batiatus to be trained as a gladiator, earning the name Spartacus (Batiatus names him after a 'legendary Thracian king').  The series premiered on the Starz Network on January 22, 2010 and aired its final episode on April 12. 2013.\n\nTITLE: Victory  DIRECTED BY:  Rick Jacobson  WRITTEN BY: Steven S. DeKnight ORIGINAL AIR DATE: April 12, 2013\n\nWith discipline and morale among his followers breaking down, Spartacus turns his forces to face Crassus in a final last stand against the combined legions of Rome climaxing the slave revolt at the Battle of the Siler River, where Spartacus and his followers will finally meet their fates (and destiny) and Crassus will have the final victory to show to Rome.\n","torrent":{"xt":"urn:btih:04740168c99408993189d6e33b926d2bd8607d5a","amp;dn":"%5BJKS%7D+Spartacus+S03E10+XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04740168c99408993189d6e33b926d2bd8607d5a","infoHashBuffer":{"type":"Buffer","data":[4,116,1,104,201,148,8,153,49,137,214,227,59,146,109,43,216,96,125,90]},"announce":[],"urlList":[]}}