{"title":"The Story of Joanna (1975 Classic XXX)","uid":7683484,"size":734740480,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:04f9709c00df1fc6588ba1b6727eee643df977db&amp;dn=The+Story+of+Joanna+%281975+Classic+XXX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":1,"time":1348886964,"description":"Description:\nGillis plays Jason, a dying rich eccentric whose tastes run far beyond the pale. Terri is Joanna, a high society daughter who has caught the eye of Jason. He wines and dines her into his darkly sexual world of male dominance. Although Gillis' actual sexual performance in this flick is brief, he drives the picture, providing ultimate control and some of his special brand of verbal abuse.\nJason takes Joanna over a table in the parlor after a delicious meal, literally showing her who's boss. Although she struggles at first, her sweet protestations melt quickly into pleasure moans. It seems there may be a brief bit missing, as we come abruptly to a discipline session. It doesn't matter so much, as this flick is very episodic, detailing the training and conditioning of Jason's final female prize. This session is magnificent. Terri is strapped to a chair in the middle of a chamber of mirrors. Gillis hits her again and again with a switch before turning her over to his maid (this time in an elaborate fetish costume), Juliet Graham. Juliet cleans Joanna's wounds and sits on her face, serving her delicious crotch to both Joanna and the camera.\nSome sweet cocksucking ensues, Terri ever the cooperative slave. She further shows her devotion to three male guests in Jason's parlor. Gillis surveys the action coolly from his chair. Terri is used by these three men, satisfying the anal desires of one, the pussy lust of another and orally stimulates the third; all at once. This scene is absolutely amazing. A fantastic song accompanies the DP'ing of Terri, to the satisfaction of all.\nZebedy Colt plays Griffin, the butler. Mr. Colt seems the normal one at first as he comforts Joanna after a nightmare of fisting. He is her sensuous lover in another of this flick's highlights. In almost all extreme close-ups, Zebedy and Terri make some most delicious love. Much focus is on Zebedy's engorged member enjoying Terri's lips and mouth.\nAn erotic ballet number shows off the lithe body of Miss Hall before Jamie verbally disciplines her. He makes clear to her that she serves no purpose but to pleasure all men. &quot;You are a cunt and a cocksuker. You bend over and open your asshole for any man to fuck you.&quot; Hot stuff! Zebedy lets his freak flag fly by demonstrating some serious devotion to Jason. With his mouth. Whoa.\nThe Story of Joanna ranks right up there with Radley Metzger's The Image and Just Jaeckin's The Story of O as a classic of sadomasochistic and sexual discipline films. Collector's take note: the print quality leaves something to be desired. It seems that while Alpha Blue has treated up to this marvelous movie in fine widescreen format with the trailer, not a great deal has been done to remaster it. There are a number of jumps where tiny fragments are missing, and maybe even a short scene is missing. Nevertheless, this film is fabulous and deserves the attention of any connoisseur of dirty smut.\n\nScene Breakdowns:\nScene 1. Terri Hall, Jamie Gillis\nScene 2. Terri Hall, Steve Lark\nScene 3. Terri Hall, John Bush, John Koven, Roy Carlton\nScene 4. Terri Hall\nScene 5. Terri Hall, Zebedy Colt\nScene 6. Juliet Graham, Terri Hall\nScene 7. Terri Hall, Jamie Gillis\nScene 8. Terri Hall, 3 guys\nScene 9. Jamie Gillis, Zebedy Colt\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=95qbhtizggh8k5fmyeux.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=95qbhtizggh8k5fmyeux.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=yvte8la3lxdmsenkzrmq.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=yvte8la3lxdmsenkzrmq.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:04f9709c00df1fc6588ba1b6727eee643df977db","amp;dn":"The+Story+of+Joanna+%281975+Classic+XXX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04f9709c00df1fc6588ba1b6727eee643df977db","infoHashBuffer":{"type":"Buffer","data":[4,249,112,156,0,223,31,198,88,139,161,182,114,126,238,100,61,249,119,219]},"announce":[],"urlList":[]}}