{"title":"The Munsters - Season 1 (AVI.'s)","uid":5671323,"size":7994959649,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:05174a0888e68bc8034230e415308cfb60983d0a&amp;dn=The+Munsters+-+Season+1+%28AVI.%5C%27s%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rubusdemonoid","files":-1,"time":1278364341,"description":"Please help to seed this torrent when you are completed as my ISP has a monthly limit that I always max out on since I have over 50 torrents that I seed for you all. My ISP is going to terminate my service if I max out my monthly limit, so I just can't continue to seed all by myself so often. PLEASE help to seed. Thank you.  :)\n\n\n\nPLEASE, PLEASE, PLEASE help to continue to seed this. I'm offering this upload by request, and this is a MUCH larger upload than I usually will offer. Just this upload by itself will max out my monthly ISP limit very quickly. If you want more uploads like I offer, then PLEASE help by continuing to seed. Thank you.\n\n\n\nThis is NOT my rip. Credit goes to the original uploader. Unfortunately I do not recall whom that is or where I found it.\n\n\nThose creepy-but-lovable residents of 1313 Mockingbird Lane are on deck for 38 hilarious half-hours during season one of The Munsters. Seen throughout the season are Fred Gwynne as Herman Munster, a softhearted replica of the Frankenstein monster; Yvonne de Carlo as Herman's voluptuously vampirish wife, Lily; Al Lewis as Grandpa Munster, a 350-year-old Dracula clone who spends most of his time cooking up mischief in his laboratory; and Butch Patrick as Herman and Lily's young son, Eddie, a budding werewolf. During the season's first 13 episodes, Beverly Owen appears as the Munsters' beautiful niece Marilyn, the only normal-looking member of the family (though she thinks she's a homely freak). Thereafter, and throughout the rest of the series' run, Pat Priest is seen as Marilyn. Some of the season's funniest entries include &quot;Pink's Pique,&quot; in which the gas company is in for quite a shock when they accidentally build a pipeline in the Munsters' dungeon -- er, basement; &quot;Low-Cal Munster,&quot; featuring Paul Lynde as a nearsighted doctor who puts Herman on a diet (and who, fortunately for his own sanity, can't see what Herman really looks like!); &quot;Autumn Croakus,&quot; wherein Grandpa's nearly four-century lifespan may come to an end at the hands of a murderous widow; &quot;Herman the Great,&quot; with Herman becoming a pro wrestler to pay for Eddie's education; &quot;Eddie's Nickname,&quot; featuring a magical milk shake which, thanks to Grandpa's bungling, grows a thick beard; &quot;Far Out Munsters,&quot; a spoof of &quot;bizarre&quot; '60s rock &amp; roll groups featuring future softcore film producer Zalman King and The Standells; and &quot;Herman the Rookie,&quot; the one in which Herman gets a tryout with the Los Angeles Dodgers as manager Leo Durocher and former football star Elroy &quot;Crazylegs&quot; Hirsch look on with mouths agape.\n\nTwo of the more fascinating first-season Munsters episodes are &quot;Love Comes to Mockingbird Heights,&quot; featuring a cameo appearance by another of Universal's copyrighted monsters, the Creature from the Black Lagoon (aka the Munsters' &quot;Cousin Gilbert&quot;); and &quot;Come Back Little Googie,&quot; guest starring child actor Bill Mumy, who had been the series producers' first choice for the role of Eddie Munster -- but whose mother did not like the idea of subjecting her boy to a daily two-hour makeup session.\n\n\n\n\n\nMore of my music &amp; movie downloads that you may find of interest are located here: &lt;a href=&quot; http://thepiratebay.se/user/rubusdemonoid/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/rubusdemonoid/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:05174a0888e68bc8034230e415308cfb60983d0a","amp;dn":"The+Munsters+-+Season+1+%28AVI.%5C%27s%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05174a0888e68bc8034230e415308cfb60983d0a","infoHashBuffer":{"type":"Buffer","data":[5,23,74,8,136,230,139,200,3,66,48,228,21,48,140,251,96,152,61,10]},"announce":[],"urlList":[]}}