{"title":"Crysis 2","uid":7701663,"size":8297294390,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0614101acdcaf494414468495ef6ce4dd2666388&amp;dn=Crysis+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shephard1","files":-1,"time":1349543757,"description":"Crysis 2 is a first-person shooter video game developed by Crytek, published by Electronic Arts and released in North America, Australia and Europe in March 2011 for Microsoft Windows, PlayStation 3, and Xbox 360. Officially announced on June 1, 2009, the game is the second main installment of the Crysis series, and is the sequel to the 2007 video game Crysis, and its expansion Crysis Warhead. The story was written by author Richard Morgan. Another science fiction author, Peter Watts, was also consulted and wrote a novel adaptation of the game. It was the first game to showcase the CryEngine 3 game engine.\n\nCrysis 2 is a first-person shooter. The player assumes the role of a Force Recon Marine called Alcatraz. Similar to its predecessor, it provides freedom to customize weaponry and abilities. Crytek wanted to avoid making another game set in a true jungle environment (as were Far Cry and Crysis); New York City has been dubbed an &quot;urban jungle&quot;. The urban atmosphere offers new options with relation to progressing and planning attacks. Players are able to navigate between floors and buildings, as well as a destroyed cityscape.\n\n \nInstallation Information:\n  =========================\n  \n  * Burn or mount.\n  * Install game.\n  * Copy crack from Crack folder on DVD to gamedir.\n  * Play.\n  * Buy the game if you enjoy it.\n","torrent":{"xt":"urn:btih:0614101acdcaf494414468495ef6ce4dd2666388","amp;dn":"Crysis+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0614101acdcaf494414468495ef6ce4dd2666388","infoHashBuffer":{"type":"Buffer","data":[6,20,16,26,205,202,244,148,65,68,104,73,94,246,206,77,210,102,99,136]},"announce":[],"urlList":[]}}