{"title":"Lost Plantations of the South (Architecture History Art) .pdf","uid":8336535,"size":46646015,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:064c46fa6ddd96b5fe9efafdc74ead6781a2cf51&amp;dn=Lost+Plantations+of+the+South+%28Architecture+History+Art%29+.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1364998652,"description":"Lost Plantations of the South By Marc R. Matrana\n2009 | 336 Pages | ISBN: 1578069424 | PDF | 44 MB\n\n\n\nThe great majority of the South's plantation homes have been destroyed over time, and many have long been forgotten. In Lost Plantations of the South, Marc R. Matrana weaves together photographs, diaries and letters, architectural renderings, and other rare documents to tell the story of sixty of these vanquished estates and the people who once called them home.\nFrom plantations that were destroyed by natural disaster such as Alabama's Forks of Cypress, to those that were intentionally demolished such as Seven Oaks in Louisiana and Mount Brilliant in Kentucky, Matrana resurrects these lost mansions. Including plantations throughout the South as well as border states, Matrana carefully tracks the histories of each from the earliest days of construction to the often contentious struggles to preserve these irreplaceable historic treasures. Lost Plantations of the South explores the root causes of demise and provides understanding and insight on how lessons learned in these sad losses can help prevent future preservation crises. Capturing the voices of masters and mistresses alongside those of slaves, and featuring more than one hundred elegant archival illustrations, this book explores the powerful and complex histories of these cardinal homes across the South.","torrent":{"xt":"urn:btih:064c46fa6ddd96b5fe9efafdc74ead6781a2cf51","amp;dn":"Lost+Plantations+of+the+South+%28Architecture+History+Art%29+.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"064c46fa6ddd96b5fe9efafdc74ead6781a2cf51","infoHashBuffer":{"type":"Buffer","data":[6,76,70,250,109,221,150,181,254,158,250,253,199,78,173,103,129,162,207,81]},"announce":[],"urlList":[]}}