{"title":"Objektkonstitution und Sprachhandlungsbegriffe 2.pdf","uid":6054806,"size":295769,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:070669572cb1674d72c50dc10a852acf6ee706bc&amp;dn=Objektkonstitution+und+Sprachhandlungsbegriffe+2.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brunnen1685","files":1,"time":1292864956,"description":"Arno Ros: Objektkonstitution und elementare Sprachhandlungsbegriffe, 1979\n\nRos kritisiert die Auffassung der modernen Sprachtheorie, wonach sich die Faehigkeit, unterscheidbare Objekte zu bezeichnen, erst durch den Spracherwerb herausbildet. Der Autor zeigt, dass die Theorie der Sprachhandlung vielmehr von verschiedenen Begriffen sensomotorischen Handelns ausgehen und elementare sprachliche Handlungen einbeziehen sollte. Er fuehrt aus, dass Kognitions- und Intentionsbegriffe schon auf dieser Stufe gewonnen werden. \n\nPart II:\n\n3. \tBegriffe sensomotorischer Handlungen als Zwischenstufe zwischen Begriffen fuer Naturgeschehen und Begriffen sprachlichen Handelns\n3.1 \tBegriffe sensomotorischen Handelns: Allgemeine Merkmale; Klassifikationsvorschlag\n3.2\tSensomotorische psychologische Praedikatoren: Uebersicht. Kognitions- und Intentionsbegriffe\n3.3\t&quot;Subjekt&quot;identitaet bei Begriffen sensomotorischen Handelns. Sensomotorische Handlungen und &quot;Objekt&quot;konstitution\n4.\tSensomotorische und zeichensprachliche Handlungsbegriffe (part.)\n4.1\tAllgemeine Merkmale des Begriffs sprachlichen Handelns: Erklaerungsmoeglichkeiten\n4.2\tKonstitutionstheorie und Etikettentheorie der Sprache\n\n\n\nWikipedia: Arno Ros gilt (auch in Folge seiner Taetigkeit als Mitarbeiter von Kuno Lorenz) als besonderer Kenner der Argumentationstheorie und untersucht im Zuge dessen die Begriffe Begriff, Begruendung und Erklaerung sowie die Typologie von Erklaerungen (Erklaerungen durch Angabe von verschiedenen causae). Einen besonderen Beitrag zur Argumentationstheorie lieferte Ros durch seine dreibaendige Monographie Begruendung und Begriff (1989/1990), in der er Wandlungen des Verstaendnisses begrifflicher Argumentationen im grossen Rahmen sowohl aus historischer (von der Antike bis in die Moderne) als auch aus systematischer Sicht herausarbeitete.\n\n","torrent":{"xt":"urn:btih:070669572cb1674d72c50dc10a852acf6ee706bc","amp;dn":"Objektkonstitution+und+Sprachhandlungsbegriffe+2.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"070669572cb1674d72c50dc10a852acf6ee706bc","infoHashBuffer":{"type":"Buffer","data":[7,6,105,87,44,177,103,77,114,197,13,193,10,133,42,207,110,231,6,188]},"announce":[],"urlList":[]}}