{"title":"John Lloyd &amp; John Mitchinson - 1,227 QI Facts To Blow Your S","uid":8215194,"size":691733,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:07312cebc90458d2be7a6e50d052d65e489c0745&amp;dn=John+Lloyd+%26amp%3B+John+Mitchinson+-+1%2C227+QI+Facts+To+Blow+Your+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kevinkray","files":-1,"time":1362328602,"description":"QI is the smartest comedy show on British television, but few people know that we're also a major legal hit in Australia, New Zealand, Israel and Africa and an illegal one on BitTorrent. We also write books and newspaper columns; run a thriving website, apage, a Twitter feed; and produce an iPhone App and a sister Radio 4 programme. At the core of what we do is the astonishing fact - painstakingly researched and distilled to a brilliant and shocking clarity. In Einstein's words: 'Everything should be as simple as possible, but not simpler.' Did you know that: cows moo in regional accents; the entire internet weighs less than a grain of sand; the dialling code from Britain to Russia is 007; potatoes have more chromosomes than human beings; the London Underground has made more money from its famous map than it has from running trains; Tintin is called Tantan in Japanese because TinTin is pronounced 'Chin chin' and means penis; the water in the mouth of a blue whale weighs more than its body; Scotland has twice as many pandas as Conservative MPs; Saddam's bunker was designed by the grandson of the woman who built Hitler's bunker; Under the Wildlife and Countryside Act of 1981, it is explicitly illegal in Britain to use a machinegun to kill a hedgehog. 1,227 QI Facts To Blow Your Socks Off will make you look at the universe (and your socks) in an alarming new way.","torrent":{"xt":"urn:btih:07312cebc90458d2be7a6e50d052d65e489c0745","amp;dn":"John+Lloyd+%26amp%3B+John+Mitchinson+-+1%2C227+QI+Facts+To+Blow+Your+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07312cebc90458d2be7a6e50d052d65e489c0745","infoHashBuffer":{"type":"Buffer","data":[7,49,44,235,201,4,88,210,190,122,110,80,208,82,214,94,72,156,7,69]},"announce":[],"urlList":[]}}