{"title":"Thelonious Monk Thelonious Monk Trio(jazz)(flac)[rogercc]","uid":6321303,"size":198210114,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:07cee908b19dfe47423ea8589b8174b6e1b09781&amp;dn=Thelonious+Monk+Thelonious+Monk+Trio%28jazz%29%28flac%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rogercc1","files":11,"time":1302946710,"description":"THELONIOUS MONK THELONIOUS MONK TRIO\nLabel: Prestige\nReleased: 1957\nFormat:Flac\n\nMonk was a craftsman of rhythmic contrast, a canny minimalist and musical architect who sustained the power of traditional jazz by expanding upon its primary virtues. Monk was also a master of texture and space who could make one chord suggest an orchestra and a few oddly stressed notes swing like crazy. His melodies were rhythmically conceived and accented, while his harmonies conferred extraordinary colors on his syncopated lines. Like Jelly Roll Morton and Duke Ellington, he conceived of the piano as a scaled down big band, which is what makes this music  so enduring.\n\n&quot;Blue Monk&quot; is one of his most timeless, straight-forward themes, as the pianist engages Percy Heath and Art Blakey in an extended dialogue, making poetic use of space and rhythmic displacements to badger Blakey into one amen after another. &quot;Little Rootie Tootie&quot; is just as exciting; Monk's crashing tonal clusters evoke distant locomotives and train whistles, as his epic blues phrases and rhythmic intricacies inspire Blakey to antiphonal effects worthy of African talking drummers. And on &quot;Bemsha Swing&quot; and &quot;Trinkle Tinkle&quot; Monk takes this notion a step farther. He treats the drums as a thematic instrument, creating new harmonies and rhythms to match, as Max Roach responds with bristling melodic ideas.\n\nAs miraculous as his own tunes are, Monk's ability to distill the sucrose sentimentality of popular tunes into heady jazz moonshine is a wonder to behold. The rhythmic variations on &quot;Sweet And Lovely,&quot; the stride asides and impressionist coda to &quot;Just A Gigolo&quot; the acerbic cubist chords introducing &quot;These Foolish Things&quot;--all betray Monk's obstreperous delight in these old songs, even as his witty transmutations illuminate the modern jazz attitude.\n\nTracklist\n1 Blue Monk 7:38 \n2 Just a Gigolo 3:03 \n3 Bemsha Swing 3:11 \n4 Reflections 2:48 \n5 Little Rootie Tootie 3:08 \n6 Sweet and Lovely  3:37\n7 Bye-Ya 2:47 \n8 Monk's Dream 3:00\n9 Trinkle Tinkle  2:49\n10 These Foolish Things 2:45\n\nRecorded at Beltone Studios, New York, New York on October 15 and December 18, 1952 and the Van Gelder Studio, Hackensack, New Jersey on September 22, 1954. Originally released on Prestige (7027).\n\nPersonnel:Thelonious Monk (piano); Max Roach, Art Blakey (drums).\n\n\n","torrent":{"xt":"urn:btih:07cee908b19dfe47423ea8589b8174b6e1b09781","amp;dn":"Thelonious+Monk+Thelonious+Monk+Trio%28jazz%29%28flac%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07cee908b19dfe47423ea8589b8174b6e1b09781","infoHashBuffer":{"type":"Buffer","data":[7,206,233,8,177,157,254,71,66,62,168,88,155,129,116,182,225,176,151,129]},"announce":[],"urlList":[]}}