{"title":"Elvis Costello - Spike 1989","uid":6746526,"size":376957300,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:080da7651ae1aacac596ae4ed973f9ece77417b7&amp;dn=Elvis+Costello+-+Spike+1989&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1318711954,"description":"Spike is the 12th studio album by the British rock singer and songwriter Elvis Costello, released on compact disc as Warner Brothers 25848. It was his first album for the label. It peaked at no.5 on the UK album chart, and at no.32 on the Billboard 200.\n\n- - -\n\nIn 1987, Costello began writing with Paul McCartney for the latter's Flowers in the Dirt album. They composed a dozen songs together, which showed up on multiple albums by McCartney and Costello. Two of those songs appear on this album, Pads, Paws and Claws and the hit single Veronica.\n\nAs his first album for a new label, in his own words Costello had the budget of a small independent movie, and having in mind the blueprint for five different albums, decided to make all of them. He brought back his foil from King of America, T-Bone Burnett, to facilitate the sessions and produce the album. Studio time was booked in four different locations: Ocean Way in Hollywood, Southland Studios in New Orleans, Windmill Lane Studios in Dublin, and AIR Studios in London. Four different groups of musicians were assembled in each location. Writing credits on the album are given to both Declan MacManus and Elvis Costello.\n\nThe single Veronica peaked at no.31 on the UK singles chart and at no.19 in America, his best showing ever on the Billboard Hot 100. This Town was also released as a single but missed both of the main singles chart in both nations. An extended play single was also released for Baby Plays Around, peaking at no.65 in the UK. (wikipedia)\n\n- - -\n\nElvis Costello - Spike 1989\n(Warner)\n\n 1. This town\n 2. Let him dangle  \n 3. Deep dark truthful mirror \n 4. Veronica \n 5. God's comic  \n 6. Chewing gum  \n 7. Tramp the dirt down  \n 8. Stalin Malone \n 9. Satellite \n10. Pads, paws and claws  \n11. Baby plays around  \n12. Miss Macbeth  \n13. Any king's shilling \n14. Coal-train robberies  \n15. Last boat leaving\n\n\nElvis Costello - vocals, acoustic guitar, bass guitar, electric guitar, mandolin, piano, bells, acoustic bass guitar, organ, melodica\nT-Bone Burnett - acoustic guitar, bass, national steel guitar\nCait O'Riordan - maracas, bells\n\nWindmill Lane Studios in Dublin:\nDerek Bell - Irish harp, hammered dulcimer\nFrankie Gavin - fiddle\nDonal Lunny - acoustic guitar, bouzouki, electric bouzouki\nDavy Spillane - pipe, uilleann pipes, Low whistle\nSteve Wickham - fiddle\nChristy Moore - bodhran\nPete Thomas - drums\n\nSouthland Studios in New Orleans:\nLionel Batiste - bass drum\nGregory Davis - trumpet\nWillie Green - drums\nKevin Harris - tenor saxophone\nCharles Joseph - trombone\nKirk Joseph - sousaphone\nRoger Lewis - baritone saxophone, soprano saxophone\nJenell Marshall - snare drum\nAllen Toussaint - grand piano\nEfrem Towns - trumpet\n\nOcean Way in Hollywood:\nMichael Blair - glockenspiel, marimba, tambourine, xylophone, bells, timpani, vibraphone, Chinese drums, Oldsmobile hubcap, Parade drum, anvil, whiplash, crash-box, temple bells, snare drum, magic table, metal pipe, Martian dog bark\nRalph Forbes - electric drums, drum programming\nMitchell Froom - organ, harmonium, electric piano, chamberlin, Indian harmonium\nRoger McGuinn - twelve-string guitar, Rickenbacker bass guitar\nJim Keltner - tom-toms, snare drum, Chinese cymbal\nJerry Marotta - drums\nBuell Neidlinger - cello, double bass\nMarc Ribot - banjo, electric guitar, Spanish guitar, sounds\nJerry Scheff - electric bass, double bass, fuzz bass\nBenmont Tench - piano, clavinet, spinet, Vox Continental\nTom T-Bone Wolk - accordion, bass\n","torrent":{"xt":"urn:btih:080da7651ae1aacac596ae4ed973f9ece77417b7","amp;dn":"Elvis+Costello+-+Spike+1989","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"080da7651ae1aacac596ae4ed973f9ece77417b7","infoHashBuffer":{"type":"Buffer","data":[8,13,167,101,26,225,170,202,197,150,174,78,217,115,249,236,231,116,23,183]},"announce":[],"urlList":[]}}