{"title":"Timewatch: Baiting the Bear 1996 (BBC/ A&amp;E) divx","uid":4077209,"size":440665040,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:087155b52951bb1ad104e5fb9d68bbe5eb7673e5&amp;dn=Timewatch%3A+Baiting+the+Bear+1996+%28BBC%2F+A%26E%29+divx&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shunster07","files":1,"time":1205371977,"description":"Timewatch: Baiting the Bear 1996 (BBC/ A&amp;E) divx\n\nThis is the story of Operation &quot;Project Control&quot; a secret plot by the head of Strategic Air Command, Curtis LeMay and others to bypass the president of the USA and to provoke the Soviet Union into a nuclear war they believed they could win. \n\n(No program notes available)\n\n\n\nCurtis Lemay was appointed head the Strategic Air Command, replacing Gen. George Kenney. When he took over SAC, it consisted of little more than a few understaffed B-29 groups left over from World War II. Less than half of the available aircraft were operational, and the crews were undertrained. When he ordered a mock bombing exercise on Dayton, Ohio, most bombers missed their targets by one mile or more.\n\nLeMay headed SAC until 1957, overseeing its transformation into a modern, efficient, all-jet force. He was instrumental in the U.S. Air Force&amp;#039;s acquisition of a large fleet of new strategic bombers, ?..the formation of many new units and bases, development of a strategic ballistic missile force, and establishment of a strict command and control system with an unprecedented readiness capability (in military hands)???\n\nLeMay was appointed Vice Chief of Staff of the United States Air Force in July 1957, serving until 1961 when he was made the fifth Chief of Staff of the United States Air Force on the retirement of Thomas White.\n\nHis belief in the efficacy of strategic, nuclear air campaigns over tactical strikes and ground support operations became Air Force policy during his tenure as Chief of Staff.. He repeatedly questioned the civilian control of a military decision to go to nuclear war and pressed strategies that we trigger a war response from the Soviet Union\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Curtis_LeMay#Cold_War&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Curtis_LeMay#Cold_War&lt;/a&gt;\n\nRetrack: shunster\nThebox.bz\n","torrent":{"xt":"urn:btih:087155b52951bb1ad104e5fb9d68bbe5eb7673e5","amp;dn":"Timewatch%3A+Baiting+the+Bear+1996+%28BBC%2F+A%26E%29+divx","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"087155b52951bb1ad104e5fb9d68bbe5eb7673e5","infoHashBuffer":{"type":"Buffer","data":[8,113,85,181,41,81,187,26,209,4,229,251,157,104,187,229,235,118,115,229]},"announce":[],"urlList":[]}}