{"title":"Wild and Wicked 5 (US) (1995)","uid":13977245,"size":316050666,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:088894f9ec8ae482f60bb1c12fef1a12e0dda619&amp;dn=Wild+and+Wicked+5+%28US%29+%281995%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"distinc","files":1,"time":1458658145,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=8281610789\r\n \nhttp://imagedisco.net/?g=3670508699\r\n\r\n\r\n\r\nDescription:\r\n\r\nWILD AND WICKED V  (Video Team)- A bit incoherent, this one features\r\na somewhat nutty plot. Tera Heart is a nymphomaniac. We trip through\r\nher dreams (sound original?). The heat in the opener with Heart and\r\nTT Boy is minor. The &quot;Alice In Wonderland&quot; scenery is employed for\r\nnewcummer Nikki Arizona and Stacy Nichols (a bit hotter). The flick\r\nfeatures two juicy Peter North facials (separate scenes) on Tera\r\nHeart (after some tasty head) and Kirsty Way (poor lead in). It has\r\nmoments\r\n\r\n\r\nSexy cover girl Tera Heart makes her memorable premiere performance in Video Team's hard-hitting, raunchy feature series, Wild &amp; Wicked. Watch as Tera and other horny beauties prove just how Wild &amp; Wicked they really are in this no holes barred, hardcore 90's flick! Tons of hole stuffing followed with tons of heavy cream!\r\n\r\n\r\n\r\nThis one has a strange premise.  Tera Heart spends a lot of time walking around aimlessly in a surrealistic setting in search of her sexuality.  She finds it by seducing her doctor (Nikki Arizona) who has been disguised as a man.   Tera indulges in a glistening baby oil rub down administered by T.T. Boy (nice close-ups) before returning the favor with a determined blow job, some standing doggie-style, and... no Tera Heart anal?  That alone is a surprise! T.T. also enjoys the combined attention of Stacey Nichols and a redhead as Tera Heart masturbates to their movements.  Still worked up, Tera finds Peter north and assumes a few positions as he screws her with exaggerated looks of amazement on his face.  Peter later redeems himself with an awesome north-erly blast all over Kristy Waay's flushed face.  A solid installment in the successful Wild and Wicked series","torrent":{"xt":"urn:btih:088894f9ec8ae482f60bb1c12fef1a12e0dda619","amp;dn":"Wild+and+Wicked+5+%28US%29+%281995%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"088894f9ec8ae482f60bb1c12fef1a12e0dda619","infoHashBuffer":{"type":"Buffer","data":[8,136,148,249,236,138,228,130,246,11,177,193,47,239,26,18,224,221,166,25]},"announce":[],"urlList":[]}}