{"title":"Flashback - The Quest For Identity (Sega CD and Genesis) Setup","uid":4593562,"size":113499847,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:08b9cb042a9a6c0cd9b67835d1fad13565aac06f&amp;dn=Flashback+-+The+Quest+For+Identity+%28Sega+CD+and+Genesis%29+Setup&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ILKnight","files":-1,"time":1229923190,"description":"Setup installer for Flashback - The Quest for Identity in Windows XP\n\nAn easy way to install and play Flashback in Windows XP; the Sega CD and Genesis versions in one pack. Just run the setup installer.\n\nTheres two important versions for this game: Sega CD and Sega Genesis. They are better to the DOS version, but the problem its the complexity of the procedures to start playing the best version of the game (the Sega CD version):\n1st. You need to download the game in the original CD format (ISO + MP3).\n2nd. Next, download a Sega CD emulator (Gens or Fusion).\n3rd. Then, you need to download the Sega CD BIOS for the respective country (Europe, Japan and USA).\n4th. Then, you need to indicated the directory of the BIOS in the configuration menu of the emulator.\n5th. And finally, load the image of Flashback.ISO in the emulator.\n\nFortunately, I made a setup installer for Flashback that include Fusion 3.51 emulator, new Flashback icons made by myself, passwords and the CD covers. You just need to install the game and all the configurations and troubles to make it work are made automatically. After the installation will be ready to play the two versions, only requires Windows XP (at least its the only operating systems that I try, but maybe others OS will also work).\n\nThis setup will be not add any file in the systems folder or other folder different from the specified. Only will be create a folder in Program Files (or another folder if you change it). In this folder will be added all the files required to run the game. Also will create the shortcuts but you can disable this option before the installation if you want. It also dont have any adware, virus, worms, spyware or any file that can be harm your computer.\n\n\nYou can also download this game directly (without torrent) from my website: http://interlinkknight.googlepages.com/downloads\n\nI made the Setup, so if you have some problems or suggestions, comment about it here.\n\nIf you like it, please comment and seed.","torrent":{"xt":"urn:btih:08b9cb042a9a6c0cd9b67835d1fad13565aac06f","amp;dn":"Flashback+-+The+Quest+For+Identity+%28Sega+CD+and+Genesis%29+Setup","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08b9cb042a9a6c0cd9b67835d1fad13565aac06f","infoHashBuffer":{"type":"Buffer","data":[8,185,203,4,42,154,108,12,217,182,120,53,209,250,209,53,101,170,192,111]},"announce":[],"urlList":[]}}