{"title":"The Default Line (2013) Faisal Islam (multi)","uid":9421979,"size":2768236,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:08c504c2e5d1a50a7dacb660a18f95b95c76696f&amp;dn=The+Default+Line+%282013%29+Faisal+Islam+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"7","files":-1,"time":1388606326,"description":"The Default Line: The Inside Story of People, Banks and Entire Nations on the Edge (2013) Faisal Islam (multi)\n\n\nThe Default Line: The Inside Story of People, Banks and Entire Nations on the Edge by Faisal Islam\n\n\nFormat: mobi/epub/azw3\nLength: 368 pages\nGenre: Non-Fiction/Economics/Finance\nDate: 29 August 2013\n\n&quot;The Default Line puts the crash, its causes and its consequences into necessary perspective. It's an excellent, clear and colourful introduction and explanation of what has happened to us all.&quot; -- Financial Times\n\nHow can a banking system become so unregulated that it offers a gold credit card to a dog? For Channel 4's Economics Editor Faisal Islam, these are examples of nations, institutions, and individuals crossing the 'default line', the point at which the optimism of economic boom flips into fiscal madness.\n\nHaving exposed the Icelandic banking crisis, watched Lehman Bros crash, investigated emerging economies in India and China and interviewed a host of key international players from the Governor of the Bank of England to the head of the the Chinese sovereign wealth fund, Faisal Islam is the perfect guide to the global economic crisis.\n\nJuxtaposing vivid anecdotes with high-level exclusive interviews and trenchant economic analysis, THE DEFAULT LINE is a really accessible way of understanding the economic shape of the contemporary world.\n\nAuthor:\n\nFaisal Islam is Channel 4 News' Economics Editor. He won the WorkWorld Foundation's 'Broadcast News Reporter of the Year' in 2010, and collected numerous awards for his coverage of the Icelandic banking crisis in 2009.","torrent":{"xt":"urn:btih:08c504c2e5d1a50a7dacb660a18f95b95c76696f","amp;dn":"The+Default+Line+%282013%29+Faisal+Islam+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08c504c2e5d1a50a7dacb660a18f95b95c76696f","infoHashBuffer":{"type":"Buffer","data":[8,197,4,194,229,209,165,10,125,172,182,96,161,143,149,185,92,118,105,111]},"announce":[],"urlList":[]}}