{"title":"Hal Clement - Noise","uid":11005848,"size":202314957,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0a069ad0b931361549b2007f577c9132c69377a1&amp;dn=Hal+Clement+-+Noise&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"twocows","files":2,"time":1410232151,"description":"Hal Clement, the dean of hard science fiction, has written a new planetary adventure in the tradition of his classic Mission of Gravity. It is the kind of story that made his reputation as a meticulous designer of otherworldly settings that are utterly convincing because they are constructed from the ground up using established principles of orbital mechanics, geology, chemistry, biology, and other sciences.\n\nKainui is one of a pair of double planets circling a pair of binary stars. Mike Hoani has come there to study the language of the colonists, to analyze its evolution in the years since settlement. But Kainui is an ocean planet. Although settled by Polynesians, it is anything but a tropical paradise. The ocean is 1,700 miles deep, with no solid ground anywhere. The population is scattered in cities on floating artificial islands with no fixed locations. The atmosphere isn't breathable, and lightning, waterspouts, and tsunamis are constant. Out on the great planetary ocean, self-sufficiency is crucial, and far from any floating city, on a small working-family ship, anything can happen. There are, for instance, pirates. Mike's academic research turns into an exotic nautical adventure unlike anything he could have imagined.","torrent":{"xt":"urn:btih:0a069ad0b931361549b2007f577c9132c69377a1","amp;dn":"Hal+Clement+-+Noise","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a069ad0b931361549b2007f577c9132c69377a1","infoHashBuffer":{"type":"Buffer","data":[10,6,154,208,185,49,54,21,73,178,0,127,87,124,145,50,198,147,119,161]},"announce":[],"urlList":[]}}