{"title":"[2002] Stripped - Christina Aguilera - 191mb @ 320kbs [only1joe]","uid":5232281,"size":200920764,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0a674fbdcc9223ab7f8a1a1fb28a80973f6393d1&amp;dn=%5B2002%5D+Stripped+-+Christina+Aguilera+-+191mb+%40+320kbs+%5Bonly1joe%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"only1joe","files":-1,"time":1261388390,"description":"Stripped - Christina Aguilera [2002]\n &lt;a href=&quot;\nhttp://img684.imageshack.us/img684/5851/strippedchristinaaguile.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img684.imageshack.us/img684/5851/strippedchristinaaguile.jpg&lt;/a&gt; \nkaJKAAACc\n\nWikipedia - Stripped is the second English studio album by American Pop singer Christina Aguilera, released in 2002. It reached the top two of the album charts in both the United States and United Kingdom and features two UK number-one hits in &quot;Dirrty&quot; and &quot;Beautiful&quot;. Aguilera supported the album with the Justified/Stripped Tour and Stripped World Tour in North America, Europe, Asia and Australia. With this album, Aguilera took creative control over a project for the first time, being influenced by many different subjects and music styles, including rhythm and blues, gospel, soul, pop rock, and hip hop. She co-wrote fourteen songs was involved in the production of the record, which was mainly produced by Scott Storch and Linda Perry. During the promotion of the album, Aguilera's public appearance had been criticized heavily in the US, due to her sexual videos and revealing outfits. Aguilera had four nominations for the Grammy Awards in the categories Best Pop Collaboration with Vocals for &quot;Dirrty&quot; and &quot;Can't Hold Us Down&quot;, Best Pop Vocal Album, Song of the Year (&quot;Beautiful&quot;) and won the category of Best Female Pop Vocal Performance (&quot;Beautiful&quot;).\n\nStephen Thomas Erlewine, All Music Guide - According to Christina Aguilera, the title of her second album, Stripped, refers to her emotions and not her body, but the topless photograph of her on the cover suggests otherwise. Most things about Stripped suggest sex, actually, since Xtina -- as she calls herself in a handful of interviews accompanying the release of the album -- never hesitates to put her body, her piercings, and recently liberated sexual beliefs on display throughout her hyper-sexual, convoluted sophomore effort. Like any diva, Christina believes her trials and tribulations are inherently more fascinating than anybody else's and, like any diva, she has an inflated sense of self-importance, defiantly strutting on the &quot;Stripped Intro&quot; that she's &quot;sorry you can't define me/sorry I break the mold.&quot; What she's referring to is anybody's guess, since she hasn't exactly defied expectations since her last album -- releasing a Christmas album and a Spanish-language record of your debut ain't exactly breaking the mold: it is the mold. Plus, Stripped clearly has its origins in the sound of two of Christina's teen pop contemporaries -- the teasing sexiness of Britney Spears and the wonderful, gonzo dance-rock confessionals of Pink, who truly did break the mold with M!ssundaztood. Since Aguilera spent so much time working on the album, tearing through a seemingly countless number of producers, she seems desperate to not just catch-up with these two, but surpass them in the sex and confessions, breaking it down so they become the same thing, while adding a strong hip-hop undercurrent throughout all the songs. And the end result is utterly bizarre, surpassing Mariah Carey's Glitter as the modern-day standard for musical immolation while rivaling The Teaches of Peaches in its sheer carnality. Where Peaches always is in control of her sexuality, using it as a weapon and a joke in equal measures, Christina is overwhelmed by the reaction of others to her sexuality, putting it on equal ground with her voice, which remains a remarkably powerful instrument, especially since she's toned down the scale-running histrionics from her debut. If she's mastered her vocals, she's still desperately searching for her artistic voice, placing too much emphasis on club and street-level R&amp;B, which fit her poorly (why was &quot;Dirrty,&quot; a non-song that requires less range than the slinky sexiness of &quot;I'm a Slave 4 U,&quot; the first single?), when she needs full-blown songs. There are some here, though, most notably the Linda Perry collaboration &quot;Beautiful,&quot; which was rush-released as a second single, but the ceaseless 70-minute running time and seemingly endless 20 songs mean that individual moments are lost and the big picture remains. And that big picture is that of an artist who has grown up too fast, while the sound is that of an artist who's given too much freedom too early and hasn't yet figured out what to do with it. \n\nTrack Listings\n\n[01] Stripped Intro\n[02] Can't Hold Us Down \t&gt;Featuring Lil Kim\n[03] Walk Away \n[04] Fighter \n[05] Primer Amor\n[06] Infatuation\n[07] Loves Embrace\n[08] Loving Me 4 Me\n[09] Impossible\n[10] Underappreciated\n[11] Beautiful\n[12] Make Over\n[13] Cruz\n[14] Soar\n[15] Get Mine, Get Yours\n[16] Dirrty \t&gt;Featuring Redman\n[17] Stripped (Part 2)\n[18] The Voice Within\n[19] I'm OK\n[20] Keep On Singin'My Song\n\n\nTotal Play Time\t&gt; 01h:17m:37s\nTotal File Size\t&gt; 191mb (Including MP3s, Art Covers &amp; File)\nTotal Bit Size\t&gt; 320kbps\nMusic File Type\t&gt; I-Tunes v7.3.2.6 MP3 Format\nMusic Video Format\t&gt; N / A\nScanned Artwork\t&gt; Yes @ 300dpi\nOriginal CD Rip\t&gt; Yes - only1joe\nOriginal Uploader\t&gt; Yes - only1joe \nUpload Speed\t&gt; 33-35KB/s\nMusic Genre\t&gt; Pop\nRelease Date\t&gt; 22 October 2002\nRecord Company\t&gt; RCA Records BMG\nArtists WebSite\t&gt; \n &lt;a href=&quot;\nhttp://www.christinaaguilera.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.christinaaguilera.com&lt;/a&gt; &lt;a href=&quot;\nhttp://www.azlyrics.com/a/aguilera.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.azlyrics.com/a/aguilera.html&lt;/a&gt;  &lt;a href=&quot;\nhttp://www.bebo.com/christinaaguilera&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bebo.com/christinaaguilera&lt;/a&gt;  &lt;a href=&quot;\nhttp://www.muzu.tv/christinaaguilera&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.muzu.tv/christinaaguilera&lt;/a&gt; \n \n\n\n\n* * * Please Seed To A Ratio Of 1:1 Or Greater * * *\n* * * I Will Only Re-Seed If There Is More Than 10 Peers Waiting * * *\n* * * Any Problems - Leave Comments On My Most Recent Torrents * * *\n* * * This Is A Multi-Tracker Torrent Check Your Bit Torrent Client For A True Number Of Seeds * * *\n","torrent":{"xt":"urn:btih:0a674fbdcc9223ab7f8a1a1fb28a80973f6393d1","amp;dn":"%5B2002%5D+Stripped+-+Christina+Aguilera+-+191mb+%40+320kbs+%5Bonly1joe%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a674fbdcc9223ab7f8a1a1fb28a80973f6393d1","infoHashBuffer":{"type":"Buffer","data":[10,103,79,189,204,146,35,171,127,138,26,31,178,138,128,151,63,99,147,209]},"announce":[],"urlList":[]}}