{"title":"SST GENs V2 - Togeo Studios - Ableton Live Pack","uid":4463773,"size":113198333,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0aa7bdb830a50e06536f7e81adefcb2748649abb&amp;dn=SST+GENs+V2+-+Togeo+Studios+-+Ableton+Live+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GPete32352","files":1,"time":1224819287,"description":"This is the complete SST GENS V2 package for Live 7, containing all 1085 simpler instrument presets and the samples. This replaces the previous F1 and B1 packs, which are now obsolete, with the SST Gens V2 (585 presets). It also contains the first installment of the Simple Synths Library collection (00-Scapes) which has an additional 500 Simpler instrument device presets.\n\nWe decided to repackage these all together, complete, to help avoid any confusion. Again if you already have the SST Gens B1 pack installed you can simply use the V2 upgrade and your set. If not then you will need to install the SST Gens V2 full install below which contains all the presets and samples (including the older versions B1 and F1).\n\nThe SST Gens V2 Ableton Live pack is completely free for you to use in your music productions as you see fit. It is just one part of the Simple Synths Library collection that we will continue to develop and release over the coming months. The next installment will be a big pack of Electronic Bass instruments (currently over 300) that should be out soon. There will also be packs for Leads, Pads, Keys, Synths, Effects and of course Drums, whiich will utilise both Impulse kits and Ableton Lives new drum racks.\n\nCheck out TogeoStudios.com for more free Ableton Live Packs.","torrent":{"xt":"urn:btih:0aa7bdb830a50e06536f7e81adefcb2748649abb","amp;dn":"SST+GENs+V2+-+Togeo+Studios+-+Ableton+Live+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0aa7bdb830a50e06536f7e81adefcb2748649abb","infoHashBuffer":{"type":"Buffer","data":[10,167,189,184,48,165,14,6,83,111,126,129,173,239,203,39,72,100,154,187]},"announce":[],"urlList":[]}}