{"title":"WinNC v6.2.1.0 ML Incl Keygen-BRD [TorDigger]","uid":10307485,"size":14911554,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0af00cdc9f65e266d63e6938b8b6d63c672760a1&amp;dn=WinNC+v6.2.1.0+ML+Incl+Keygen-BRD+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":12,"time":1402150785,"description":"winNC\n\nWinNc, a tabbed file manager like Norton Commander\n\nWinNc is a tabbed file manager especially developed for Windows 8 (works on 7).\n\nIt also works on the older versions of Windows. This NC clone file manager is inspired on the dual panel idea of the old file manager Norton Commander. It has shortcuts to all the Windows 7 and 8 special folders and the tabbed interface allows you to organize your data by project. Projects can include virtual links to files and folders from all over the disk that are related to that project tab. With a new Windows 8 interface WinNc can do all the basic tasks you expect from a file manager like copy, move, delete, compress, uncompress and create links. But WinNc also converts audio, burns files on dvd and cd, creates iso files and you are able to synchronize your files. From zip files it allows the creation of self extraction .exe files.\n\nFile actions in WinNc:\n\nWinNc uses logical colors for the file actions so you can see if a file is being copied (Green), being moved (Orange) or being packed (Yellow). WinNc allows you to perform multiple tasks by setting the maximum parallel tasks to more than one task. Otherwise WinNc will wait to start the new action until the previous action has finished. There is a built in file viewer supporting all the popular formats. It has a built in slideshow viewer, an audio player and a video player for quickly browsing through your media.\n\nWinNc is a file manager developed for Windows 8 and 7. This NC clone file manager is inspired on the dual panel concept of the old file manager Norton Commander. Download is free and uninstallable\n\nSupported OS:\n\nWindows 8/7\n\nHomepage: http://www.winnc.com/\n\nInstallation Instructions: \n\n- Install program.\n- Use Keygen to get Valid serial for registering application.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:0af00cdc9f65e266d63e6938b8b6d63c672760a1","amp;dn":"WinNC+v6.2.1.0+ML+Incl+Keygen-BRD+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0af00cdc9f65e266d63e6938b8b6d63c672760a1","infoHashBuffer":{"type":"Buffer","data":[10,240,12,220,159,101,226,102,214,62,105,56,184,182,214,60,103,39,96,161]},"announce":[],"urlList":[]}}