{"title":"Jeff Pearlman - Sweetness, Epub,Mobi, KK","uid":6926751,"size":1652791,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0cb46492134442a3a63537e02c77c3a6503a439c&amp;dn=Jeff+Pearlman+-+Sweetness%2C+Epub%2CMobi%2C+KK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"karaokeking123","files":-1,"time":1325534095,"description":"Sweetness: The Enigmatic Life of Walter Payton by Jeff Pearlman\n\nRequirements: ePUB reader, 635 kB, MOBI reader, 900 kB\n\nOverview: The first definitive biography of Chicago Bears superstar Walter Payton.At five feet ten inches tall, running back Walter Peyton was not the largest player in the NFL, but he developed a larger-than-life reputation for his strength, speed, and grit. Nicknamed Sweetness&quot; during his college football days, he became the NFL's all-time leader in rushing and all-purpose yards, capturing the hearts of fans in his adopted Chicago.Crafted from interviews with more than 700 sources, acclaimed sportswriter Jeff Pearlman has produced the first definitive biography of Payton. Sweetness at last brings fans a detailed, scrupulously researched, all-encompassing account of the legend's rise to greatness. From Payton's childhood in segregated Mississippi, where he ended a racial war by becoming the star of his integrated high school's football team, to his college years and his twelve-year NFL career, Sweetness brims with stories of all-American heroism, and covers Payton's life off the field as well. Set against the backdrop of the tragic illness that cut his life short at just forty- six years of age, this is a stirring tribute to a singular icon and the lasting legacy he made.\n\n\nEnjoy!","torrent":{"xt":"urn:btih:0cb46492134442a3a63537e02c77c3a6503a439c","amp;dn":"Jeff+Pearlman+-+Sweetness%2C+Epub%2CMobi%2C+KK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cb46492134442a3a63537e02c77c3a6503a439c","infoHashBuffer":{"type":"Buffer","data":[12,180,100,146,19,68,66,163,166,53,55,224,44,119,195,166,80,58,67,156]},"announce":[],"urlList":[]}}