{"title":"The Anthony Cumia Show 2014-09-16 (MP4)","uid":11049631,"size":364639881,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0d4bba6865883633fd766e676fe1c5ec42c537b2&amp;dn=The+Anthony+Cumia+Show+2014-09-16+%28MP4%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1411002133,"description":"Tuesday, September 16, 2014\n\nToday's show kicks off by recapping Monday's guest Gavin McInnes and the after show hijinks that went down. Ant tells us that he will be appearing on Red Eye 9/26, we hear about the launch of a TV channel called &quot;W.E.T.,&quot; talk about a new beheading done by ISIS, Obama's plan for handling ISIS, and get Ant's thoughts on his plan. He then gets into another (alleged) Adrian Peterson child beating, discusses what the fuck Barbie is saying, and goes through a few more dubious toys. Ant reminisces about his own childhood toys, we hear about a new promotion called &quot;Anthony Cumia Unblocks Someone Who Pissed Him Off On Twitter Because Someone Is Paying Him To Do It,&quot; Keith updates us on Paltalk, and we go around the world in the news by seeing the Columbian cycling team's pussy suits, people in Ukraine handling a parliament member, and checking in with Australian identical twins. Ant wraps up the show by reading some entertaining viewer mail and shows us a video of a man with a ginormous ball bag. **To get a fucking sticker, send a self-addressed stamped envelope to: The Anthony Cumia Show PO Box 179 Albertson, NY 11507\n","torrent":{"xt":"urn:btih:0d4bba6865883633fd766e676fe1c5ec42c537b2","amp;dn":"The+Anthony+Cumia+Show+2014-09-16+%28MP4%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d4bba6865883633fd766e676fe1c5ec42c537b2","infoHashBuffer":{"type":"Buffer","data":[13,75,186,104,101,136,54,51,253,118,110,103,111,225,197,236,66,197,55,178]},"announce":[],"urlList":[]}}