{"title":"Sergio Mendes - Timeless  2006 TQMP","uid":4563610,"size":429687407,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0d7d3800257dc9ebf1e167bb2c70b880e6469bd2&amp;dn=Sergio+Mendes+-+Timeless++2006+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Breezin","files":22,"time":1228776827,"description":"Quotes from amazon.com (avg 4 star rating)\n\n&quot;I doubt that you&amp;#039;ll hear this CD pumping from cars and boom boxes in the hood, but if you do, there will be hope for civilization after all! A lot of heavyweight talent is showcased on &quot;Timeless&quot; but the real star is the music of Sergio Mendes, a master piano man with a most illustrious calatogue. Hearing some age-old favorite songs recast in this contemporary mode is fun and underscores the broad appeal of the bossa/samba sound! Stevie Wonder&amp;#039;s remarkable harmonica, the voices of India.Arie, Jill Scott and others are all wonderful. Q-Tip&amp;#039;s appearance is a typical rap ego session (announcing himself over and over...we get it already, you call yourself &quot;Q-Tip [heavens knows why]), but aside from that minor irritation, this is a CD bound to have play life well into the spring and summer. Sergio Mendes gettin&amp;#039; his props! It&amp;#039;s about time!&quot; \n\n&quot;From the OBJECTIVE reviewer...you cannot mash the old (Sergio) with the new (Will.i.am &amp; company) and be successful if you can&amp;#039;t keep the spirit of the original and yet give it a fresh sound. They missed the bossa nova boat. Help other customers find the most helpful \nGrowing up, I discovered brazilian music at the age of 13 or 14 and immediately found it intoxicating and mesmerizing.I&amp;#039;d listen to Astrud Gilbert amazing voice and picture perfect white beaches full of dancing people, my imagination looking a lot like the famous movie Black Orpheus. Fortunately, Brazil has come a long way from that stereotypical portrayl of every day life and bossa nova is no longer the swinging sound of 60&amp;#039;s cocktail parties. \n\nThose of us who love brazilian music or are open to new sounds are likely to recognize some of these names of the new brazilian school: Tribalistas, Marisa Montes, Bebel Gilberto, Carlihnos Brown or Araketu so a CD by someone from the old school like Sergio Mendes is something you&amp;#039;d buy to &quot;add to the collection&quot;. Mistake !!! TIMELESS is a CD any savvy, cosmopolitan and ÃƒÂ¼ber cool music lover and/or DJ should include in their next party, this being in a 45th floor over looking Manhattan, a beach bar in Ibiza or just in your normal hanging out sunday brunch. This CD sets the mood for some serious dancing, that is, sexy dancing. \n\nWill.I.Am, of the Black Eyed Peas, project of using timeless tunes with contemporary singers is brilliant. Starting with Mas que Nada, the TBEP sound blends perfectly, making you get of your seat a must, then soundly you have rap and Erykah Badu vocals make you feel like you&amp;#039;re in the getto brazilian style. Stevie Wonder&amp;#039;s harmonica never sounded so relaxed and Jill Scott&amp;#039;s voice takes us to a land where the sunset is the best time of the day, as does India Arie. Justin Timberlake gives us another reason for thanking him for leaving a boy band and going solo, and John Legend the why of his recent Grammy Nomination. \n\nSo do yourself a favor, dim the lights, mix a caipirinhna and let Brazil make your day ! Sergio Mendes legacy lives on...&quot; \n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project me and my fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:  &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980&amp;#039;s cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nYou can find all TQMP uploads at: www.thepiratebay.se (Simply use the TQMP searchtag :)\n\nContact: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;95f7e7f0f0effcfbd5f9fce3f0bbfbf9&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nGreetings to ya&amp;#039;all from the Breezin Dutchman! d:)","torrent":{"xt":"urn:btih:0d7d3800257dc9ebf1e167bb2c70b880e6469bd2","amp;dn":"Sergio+Mendes+-+Timeless++2006+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d7d3800257dc9ebf1e167bb2c70b880e6469bd2","infoHashBuffer":{"type":"Buffer","data":[13,125,56,0,37,125,201,235,241,225,103,187,44,112,184,128,230,70,155,210]},"announce":[],"urlList":[]}}