{"title":"Frank Marino &amp; Mahogany Rush - Real LIVE! (Disc 1) FLAC","uid":4761502,"size":566113897,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0dc1ddb2f432701d0996428d7193755038327588&amp;dn=Frank+Marino+%26+Mahogany+Rush+-+Real+LIVE%21+%28Disc+1%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sowingmyseed","files":12,"time":1236715463,"description":"1. Voodoo Child\n2. ...Something's Comin' Our Way (Excerpt)\n3. He's Calling\n4. Red House\n5. Guitar Prelude to a Hero\n6. ...Stories of a Hero\n7. Poppy\n8. ...She's Not There\n9. ...Crossroads\n10. ...She's Not There (Return)\n11. ...Poppy (Return) \n\n\n\n\nThis Canadian rock group started around 1970, simply known as Mahogany Rush. Frank Marino was added to the title later. Marino served as the lead singer, guitarist, and percussionist. Other members were bass guitarist Paul Harwood and drummer Jimmy Ayoub. In the early '80s, rhythm guitarist Vince Marino, Frank's brother, was added to the lineup. A couple of years after that, Ayoub walked, and drummer Tim Biery stepped in to replace him. Mahogany Rush released its debut album in 1973. It was the first of more than a dozen full-length recordings the group completed over the next two-plus decades.\n\nThe leader of Mahogany Rush, Frank Marino, was born in Montreal, Quebec in the winter of 1954. He had a troubled childhood. As a young teen, deep into drugs like LSD, Marino indulged too much, and found himself hospitalized. He had always loved psychedelic and hard rock music, like that of Jimi Hendrix, and time in the hospital, with a clear head, gave him a chance to really listen and hear the music. As part of his recovery, he was offered the chance to use a musical instrument. He was a drummer, but since none were available, he picked up a guitar. Over the next couple of months, Marino taught himself to play, and to do so amazingly well.\n\nFresh out of hospital, and trying to keep his thoughts off drugs, Marino pulled together some friends and formed a band that hopped around doing small gigs where and when they could. Many members came and went before Marino found the right fit with Ayoub and Harwood. That was when the true Mahogany Rush was born.\n\nAfter a couple of years of seeming to get nowhere fast -- or at all -- the band finally recorded a debut album, Maxoom, released under the Kot'Ai Records label in 1973, when Marino was only 17. Between then and 1976, the group finished three more albums, Child of the Novelty, Strange Universe, and a self-titled offering. That latter appeared under a new label, the major Columbia Records. The next year the band lengthened its name to Frank Marino and Mahogany Rush. It stayed under contract with Columbia into the '80s, recording a number of albums, including World Anthem, Tales of the Unexpected, What's Next, The Power of Rock 'N Roll, and Juggernaut.\n\nAround the middle of the '80s, the group landed a deal with Maze Records. The result was the album Double Live. Marino also recorded a solo album, Full Circle, under the label. Around that same time, Frank Marino and Mahogany Rush seemed to have called it quits, at least for that decade.","torrent":{"xt":"urn:btih:0dc1ddb2f432701d0996428d7193755038327588","amp;dn":"Frank+Marino+%26+Mahogany+Rush+-+Real+LIVE%21+%28Disc+1%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0dc1ddb2f432701d0996428d7193755038327588","infoHashBuffer":{"type":"Buffer","data":[13,193,221,178,244,50,112,29,9,150,66,141,113,147,117,80,56,50,117,136]},"announce":[],"urlList":[]}}