{"title":"Rainlendar Lite 2.5 (Intel)","uid":4736927,"size":5579330,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:0e538d33cd8cead63acc6b0bc8c0c80190c788ba&amp;dn=Rainlendar+Lite+2.5+%28Intel%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"olofolleola4","files":-1,"time":1235369044,"description":"Copied from Rainlendar Homepage:\n\n\nRainlendar - A customizable desktop calendar\n\nRainlendar is a feature rich calendar application that is easy to use and doesn't take much space on your desktop. \n \nThe appearance can be customized with skins and you can even mix different skins together. \n \nIt is possible to use Rainlendar with other calendar applications too. Rainlendar uses the standard iCalendar format to store its events and tasks so you can easily transfer them between applications.\n \nRainlendar is an unicode application and support localization so you can use it on your own language. \n    \nAll the future events are shown in a separate list where you can see the week's events at one glance. You can decide how many days in advance you want to see in the list. Different events can have a different appearance in the list so you can easily spot the important events from the others.\nThe icons in the calendar are also available in the event list and other windows to make it easier to separate the events. \n \nYou can also have a separate list for your long term tasks.\nThe task list can be arranged several ways so that you can keep it better organized. You can also set a due date for the tasks to make sure you'll remember to do them on time.\n \nYou'll also get an alarm when an event or task is due so that you don't miss it. The alarm can be defined to be set off any duration before the actual event so you have time to prepare for it. \n\n\n\nRainlendar Features\n\n\nPlatform independent\n\nRainlendar can be run on Windows, Mac OS X and Linux.\nAll platforms use the same file formats so all skins and scripts created for different versions will work also on all.\n\n\nLocalized\n\nRainlendar supports localization so you can have the user interface in your own language. Rainlendar is an Unicode application so different character sets can be used at the same time.\n\n\nStandards Compatible\n\nRainlendar uses standard iCalendar format for it events and tasks to maximize the compatibility with other calendar applications.\nYou can easily transfer the events from the calendar you are currently using to Rainlendar.\n\n\nLook'n'feel \n\nThe appearance of the calendar can be changed with skins.\nThe skins can be of any shape and size and they can also use scripts for additional functionality. It's also possible to combine different skins by using e.g. the calendar from one skin and event and to do list from another.\nThe events and tasks can have different appearance depending on their category.\n\n\nHighly Customizable\n\nIt is possible to have multiple months visible at the same time.\nThe months can be laid out the way you want and they can even have different sizes.\n\n\nMultiple Calendars\n\nYou can have any number of calendars show at the same time.\nDifferent calendars can show e.g. holidays, tv programs, your personal events or what ever you like.\n\n\nImport &amp; Export\n\nEvents and tasks can be transferred to and from other calendar applications.\nYou can also import the data from the old version of Rainlendar.\n\n\nTo do list\n\nIn addition to normal events Rainlendar includes a separate to do list where you can store your ongoing tasks.\n\n\nAlarms\n\nGet notified in advance before the event is due so that you don't forget any important events.\nThe alarm works with tasks too.\n\n\nRecurrence\n\nThe events and tasks can be made to repeat automatically so you don't have to enter them multiple times. It's also possible to have exceptions in case the event doesn't happen on one particular day.\n\n\nScripting\n\nLua scripting language makes it possible to extend the functionality of Rainlendar.\n\n\nBackups\n\nIntegrated backup and restore functionality makes it easy to make sure your events safe if something bad happens.\n\n\nPrinting\n\nPrint your events and tasks as a separate list or as a month view.\n\n\nSearch\n\nIf you have a lot of events and tasks you can find the one you are looking for easily with the substring search in the Manager dialog.","torrent":{"xt":"urn:btih:0e538d33cd8cead63acc6b0bc8c0c80190c788ba","amp;dn":"Rainlendar+Lite+2.5+%28Intel%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e538d33cd8cead63acc6b0bc8c0c80190c788ba","infoHashBuffer":{"type":"Buffer","data":[14,83,141,51,205,140,234,214,58,204,107,11,200,192,200,1,144,199,136,186]},"announce":[],"urlList":[]}}