{"title":"David Sereda with Lockheed Martin Aeronautics Co. Engineer, Boyd","uid":3727519,"size":194000074,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:0e540c64dfb7cb7efe682a36f37a037152f3284a&amp;dn=David+Sereda+with+Lockheed+Martin+Aeronautics+Co.+Engineer%2C+Boyd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"geogaddi00","files":14,"time":1183113432,"description":"\nDavid Sereda with Boyd Bushman - Anti-Gravity Disclosure from the new documentary &quot;From Here to Andromeda&quot; \n\n5 scenes from Program 2 of Disc One of David Sereda&amp;#039;s historic interview with Boyd Bushman!  Much more on Disc Two! \n\nDuration: 00:19:00\nBit rate: 96kbps\nDimensions: 640 x 480 XviD\nSize: 161mb\n\n\n( http://www.fromheretoandromeda.com/ DVD just released and now shipping! Stream the trailer: http://video.google.ca/videoplay?docid=-7834360033651007134 )\n\nNOTE: You can also stream this selection of some of the Boyd Bushman scenes here: http://video.google.ca/videoplay?docid=-3874568473252816241\n\n-----------------------------------------------------------------------------------------------\n\nThe National Law Journal July 2, 2001 \n\nROCKET SCIENCE\n\nMICHAEL RAVNITZKY\n \nBoyd Bushman, an engineer and inventor at Lockheed Martin Aeronautics Co., the nation&amp;#039;s largest aerospace company, has sued his employer, claiming that the company, directed by the government, suppressed an invention that he believes has implications as a portable and inexpensive way of generating energy. Lockheed has had the suit removed to federal court. The complaint asserts that the value of Mr. Bushman&amp;#039;s 20% revenue profit share has been substantially reduced by the failure to promote the concept. The patent at issue, U.S. Patent No. 5,384,802, describes a way of turning a jet engine into a powerful laser weapon. According to military technology expert John Pike of GlobalSecurity.org, the U.S. Air Force recently studied the utility of lightweight laser-weapon-equipped aircraft. Lockheed declined to comment. Mr. Bushman&amp;#039;s attorney is B. Buzz Deitchman of Dallas&amp;#039; Law Office of B. Buzz Deitchman. Counsel for Lockheed is Herbert J. Hammond of Dallas&amp;#039; Thompson &amp; Knight. A spokeswoman for the aeronautics company said that the engineer&amp;#039;s claim is groundless. Bushman v. Lockheed Martin Aeronautics Co., No. 4:01cv498 (N.D. Texas June 15, 2001). \n\n\nCopyright 2001 The New York Law Publishing Company\n\n-----------------------------------------------------------------------------------------------\n\nFrom Here to Andromeda tops all of David Sereda&amp;#039;s past films. The 2-DVD set includes four 1-hour segments and features analysis of mind-blowing UFO footage. The areas of Space Propulsion Theory, Sustainability, and Spirituality are also explored. \n\n? Ben Rich, former head of Lockheed Skunkworks, said at a UCLA Alumni Speech in 1993, &quot;We already have the means to travel among the stars, but these technologies are locked up in black projects and it would take an Act of God to ever get them out to benefit humanity...Anything you can imagine, we already know how to do.&quot; \n\n? Boyd Bushman, a Lockheed Martin Senior Research Scientist, testifies about Anti Gravity, UFOs, Roswell, Wright Patterson AFB, UFOs and more, and demonstrates anti-gravity in the film. \n\n? Professor David Phillips (Santa Monica College) gives us an emergency plan to save us from global warming, and talks about his UFO experiences. \n\n? Professor Roger Weir shows us the ancient connection to Pythagoras and interstellar beings that may be here, in our skies, and among us today. \n\n? Professor Robert Thurman tells us the ancient Buddhist secrets of UFOs and invisible dimensions, cities and the legendary Shambhala! \n\n? The UFO Briefing Scene includes a round table debate with experts over the issue of extraterrestrials fighting over who gets earth next if we destroy it. Is our planet so valuable that a war may begin over its future? \n\n? The Space Shuttle Columbia disaster: what was really behind it? Did ETs shoot down the Columbia? \n\n? How can we engineer our own spacecraft and conquer the universe? \n\nWill we be able to do it before our destruction? \n\n? What happens to 6.5 billion souls if we lose planet earth? \n\nFrom Here to Andromeda opens with the possibility that humanity may not survive due to Global Warming, an ensuing Ice Age or Mass Extinction. Al Gore&amp;#039;s movie, An Inconvenient Truth, has swept the world with the realization that Global Warming may destroy our civilization. The question is why doesn&amp;#039;t humanity have the will to live with Sustainable technologies like Solar, Wind, and Helium-3 Fusion to beat Global Warming? Why are the oil companies holding us hostage? Why hasn&amp;#039;t all of humanity awakened and taken measures to ensure our survival? \n\nDavid Sereda, his Fianc.., Crystal, and their dog Nuala embark on a journey to find a way to travel to the Andromeda Galaxy 2.2 million light years away to find a new home for humanity. They explore the areas of Sustainability, UFOs, Space Propulsion Theory, Spirituality, and Human Ethics on their journey to solve the greatest riddle in the universe: How can you travel faster than the speed of light and go anywhere in the universe in minutes? Is it possible that Einstein was wrong? Find out why so many UFO&amp;#039;s are suddenly appearing all over the world. Are they here to teach us? Are they here to help humanity make a quantum leap? What do World Governments know about UFO?s? Will humanity find a new home in the universe? \n\nFind out how to solve the greatest challenge facing humanity, and what the experts are saying. \n\nFrom Here to Andromeda features UFOlogist, ecologist and space scientist David Sereda, Crystal Elina Frost, Professors Roger Weir, Dr. David Phillips (Santa Monica College), Robert Thurman (author/translator, Tibetan Book of the Dead and many others), Boyd Bushman (Senior Research Scientist),Michael Luckman (author, Alien Rock), Rex Webb, Dr. Lynne D. Kitei (auithor and writer/director, Phoenix Lights), UFOlogists Jesse Marcel Jr. (Roswell), Rob Simone, Steven Bassett, Dr. Roger Lier, Preston Dennett, Jason Martell, Jordan Maxwell, skywatchers Michael Lee Hill, Jeff Willes, anti-gravity scientist John Hutchison, entertainers Joe Satriani (Grammy Award-winning musician), Dean Haglund (actor, X-Files &amp; Lone Gunmen), and Tony Tarantino. \n\n-----------------------------------------------------------------------------------------------\n\n\nBoyd Bushman, a Lockheed Martin Senior Research Scientist, demonstrates working Anti-Gravity on Film for David Sereda\n\n\nJust released on DVD, &quot;From Here to Andromeda,&quot; by David Sereda reveals Boyd Bushman&amp;#039;s theories and devices which prove anti gravity is not only possible, but has been in US possession since the 1950&amp;#039;s, obtained from a UFO shot down by our government in 1947.\n\nOne of the first interesting tidbits that David Sereda first revealed on Coast to Coast AM is that Boyd Bushman explains that there are actually nine forces governing the universe rather than the conventional five that we know of, that being gravity, the magnetic force, strong nuclear force, the weak nuclear force, and the electromagnetic force.\n\nSeventy three old Boyd Bushman has many accolades, including being a program manager for Lockheed Martin, and also worked for Hughes Aircraft, among many other high tech industries. He had a top secret clearance, and was the engineer that reverse engineered anti gravity for Lockheed Martin.\n\nElement 115, formerly revealed by the famous Bob Lazar has now been verified by Boyd Bushman as a second source, that element 115 is the key to developing anti gravity drive systems.\n\nBoyd Bushman is coming forward now because he believes that survival on Earth is precarious at best, and believes that interstellar travel to other worlds is the only hope for preserving mankind.\n\nElement 115 is just one of the new elements that Boyd Bushman reveals has been developed, that we have gone beyond 115 to other elements, which are more stable.\n\nThe expansion force, which is stronger than gravity is one of the new forces discovered. This force is the key to anti gravity. It is also the force that is pushing the universe apart. Apparently this newly discovered force is easy to manipulate, and gives the ability to make objects travel faster than the speed of light.\n\nBoyd Bushman also confirms that the Roswell UFO was shot down by a US plane equipped with a Tesla Death Ray type weapon.\n\nBoeing ConAir actually built the first US built flying saucer using anti gravity powered by a nuclear reactor. See the link below for a drawing of the craft and its specifications.\n &lt;a href=&quot;\nhttp://www.coasttocoastam.com/gen/page1986.html?theme=light&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.coasttocoastam.com/gen/page1986.html?theme=light&lt;/a&gt;\n\nPart of early anti gravity research was done with opposing two magnets against each other, third illustration.\n\nThe experiment involves taking two five thousand dollar magnets, bolting the north to north, and then enclosing them in a rock like case. A rock of equal mass was then used in a drop experiment (without magnets). The two &quot;rocks&quot; are then dropped at the same time from a high distance. The &quot;rock&quot; with the opposed magnets hits the ground after the normal rock. The experiment proved that anti gravity fields could be amplified with electromagnets and nuclear power.\n\nDavid Sereda also mentioned that the Columbia shuttle was apparently brought down by a strange sort of ray from above. The five photos taken by an anonymous astronomer given to the San Fransisco Chronicle leaves questions as to who, when and why the shuttle was shot down. \n\n----------------------------------------------------------------------------------------------\n\nRecap of David Sereda on Art Bell C2C, April 15th, 2007 UFO &amp; Antigravity Disclosure \n\n &lt;a href=&quot;\nhttp://www.coasttocoastam.com/shows/2007/04/15.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.coasttocoastam.com/shows/2007/04/15.html&lt;/a&gt; (download the show here: http://www.gmms.ca/coast/page_C2007.html scroll down to April 15 )\n\n\nUFO &amp; Antigravity Disclosure\nUFO Researcher David Sereda discussed his recent work, videotaping the disclosure of 73-year old Boyd Bushman, a Lockheed Martin Senior Research Scientist of 20 years, who held Top Secret clearance. He holds a number of patents and designed the Red Eye Missile (now the Stinger Missile), and infrared FLIR systems. Bushman also reverse engineered antigravity and UFO technology, Sereda reported. \n\nThere is a force related to the expansion of the universe that is actually stronger than gravity, and this could be connected to antigravity propulsion, Bushman told him. He demonstrated phases that lead up to antigravity, including experiments in which magnets reduced the gravity of a rock. Bushman verified that Area 51 in Nevada was indeed the place where alien craft were tested-- but such testing moved to a facility in Utah after Area 51 became well known, he noted. \n\nBushman also revealed that he was friends with a Navy doctor that treated a pilot who shot down the Roswell craft in 1947. Though he didn&amp;#039;t state the specific type of weapon used, Sereda speculated that it might have been Tesla&amp;#039;s &quot;death ray,&quot; confiscated by the government after Tesla&amp;#039;s death in 1943. Bushman also showed Sereda a diagram for a nuclear-powered flying saucer (click on photo above), which he said was first flown out of Wright Patterson AFB in 1959.\n\n----------------------------------------------------------------------------------------------\n\nRelated links:\n\nBoyd Bushman on American AntiGravity: http://www.americanantigravity.com/bushman.shtml\n\nBoyd Bushman interviewed by Nick Cook: http://www.youtube.com/watch?v=3OEMbZEacaw\n\nNick Cook&amp;#039;s 1999 TLC documentary, Billion Dollar Secret: \n- http://en.wikipedia.org/wiki/Billion_Dollar_Secret (info) \n- http://video.google.ca/videoplay?docid=-3975546396136405829 (video)\n\nThe Case For Anti-Gravity - checktheevidence.com - http://video.google.ca/videoplay?docid=-286184459501486399 \n\nA letter of reference to Lockheed Martin on John Hutchison&amp;#039;s behalf by Boyd Bushman: - http://www.hutchisoneffect.ca/PhotoGallery/John%20References/New%20Resume%20032.jpg\n\nApparatus and method for amplifying a magnetic beam\n- US Patent Issued on July 27, 1999 http://www.patentstorm.us/patents/5929732-description.html\n\nWestlund Tech Claims Second Law of Thermodynamics is Invalid: http://www.pureenergysystems.com/news/2004/07/02/6900030WestlundtechThermodynamics/index.html\n\nInventors:Bushman, Boyd B. (Lewisville, TX, US) Object Detector: United States Patent 5404225 http://www.freepatentsonline.com/5404225.html\n\nUFO videos used in &quot;From Here to Andromeda&quot;:\n- Jeff Willes videos: http://video.google.ca/videosearch?q=jeff+willes+ufo \n- Lake Erie UFOs: http://video.google.ca/videoplay?docid=6031648113357349549 \n\nDavid Sereda&amp;#039;s websites:\n\n- http://www.davidsereda.blogspot.com/\n- http://fromheretoandromeda.com/\n\n----------------------------------------------------------------------------------------------\n\nBROUGHT TO YOU BY EXOPOLITICS UK: http://exopolitics.org.uk/ - MESSENGERS OF CONCEPTION - (A Utopiated Data Management System)\n\n\n","torrent":{"xt":"urn:btih:0e540c64dfb7cb7efe682a36f37a037152f3284a","amp;dn":"David+Sereda+with+Lockheed+Martin+Aeronautics+Co.+Engineer%2C+Boyd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e540c64dfb7cb7efe682a36f37a037152f3284a","infoHashBuffer":{"type":"Buffer","data":[14,84,12,100,223,183,203,126,254,104,42,54,243,122,3,113,82,243,40,74]},"announce":[],"urlList":[]}}