{"title":"coast to Coast AM July 04, 2013 - disinformation","uid":8672919,"size":54654389,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0fc5cbd8382d9bc761cea69c35c18776df05a26d&amp;dn=coast+to+Coast+AM+July+04%2C+2013+-+disinformation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pyramid91","files":5,"time":1373531497,"description":"MP3 version wins!\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\n\nDate:\n07-04-13\nHost:\nGeorge Noory\nGuests:\nDavid  Kupelian,             Ronald  Rychlak,                   Howard  Bloom\nManaging editor of World Net Daily, David Kupelian, and historian and law professor, Ronald Rychlak, discussed some of the most consequential yet largely unknown disinformation campaigns of our times, many begun during the Cold War by the Soviet bloc. Rychlak co-wrote his new book Disinformation with a former high-ranking Soviet bloc intelligence officer, Gen. Pacepa, who is still living undercover decades after he defected to the US. Before his defection, Pacepa's used disinformation to persuade the West that communist Romania's President Nicolae Ceausescu was a great and benevolent leader. Disinformation can be employed in various ways-- in the case of Ceausescu to build him up, but it was also frequently used to discredit people. \nKupelian compared the disinformation process to that of money laundering. First, you have misinformation-- often intentionally wrong information that is put out by a government, and then introduced to a respected news organization. The public receives the information, camouflaged from its original source, in the form of &quot;clean&quot; and credible news, &quot;and that is what we call disinformation-- it's not just the lie, it's the fact that it's been implanted in this clever way,&quot; he explained.  \nSoviet leaders often used a similar tactic when they came into power, spreading disinformation about the previous leader, such as how Khrushchev discredited Stalin, Rychlak detailed. Andropov, a former head of the KGB, who became the leader of the Soviet Union, took the tactic further, launching disinformation about foreign leaders, Rychlak continued. One fascinating case of disinformation was how the KGB built up the perception of Arafat as a peaceful leader, as part of their agenda to damage Israel, Kupelian remarked. \nEgypt, Freedom, &amp; America\nFirst hour guest, author Howard Bloom talked about Egypt's fight for freedom, as well as increasing encroachments on freedom and privacy in the United States. It isn't just that the Egyptian people became unhappy with the now ousted Pres. Morsi for minor policy things-- he hijacked their constitutional process, and began to take over the state on behalf of a theocracy, Bloom stated. &quot;This was very much a demonstration for what you and I would regard as freedom,&quot; he continued, adding that the BBC referred to the ouster as the biggest political event in world history. Bloom lamented that Obama is not keeping his promise to keep government transparent, and how the secret NSA spying on American citizens is anti-democratic. \nNews segment guests: Sarah Nash, Mish Shedlock\nWebsite(s):\n wnd.com\n HowardBloom.net\n bigbangtango.net\nook(s):\n Disinformation\n How Evil Works\n The Genius of the Beast: A Radical Re-Vision of Capitalism\n The God Problem\n","torrent":{"xt":"urn:btih:0fc5cbd8382d9bc761cea69c35c18776df05a26d","amp;dn":"coast+to+Coast+AM+July+04%2C+2013+-+disinformation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fc5cbd8382d9bc761cea69c35c18776df05a26d","infoHashBuffer":{"type":"Buffer","data":[15,197,203,216,56,45,155,199,97,206,166,156,53,193,135,118,223,5,162,109]},"announce":[],"urlList":[]}}