{"title":"George R.R. McLean -Het lied van IJs en Vuur - Een Storm van Zwa","uid":6794647,"size":1309670,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1061a94af99279286fe3a37706927e59b2c157ec&amp;dn=George+R.R.+McLean+-Het+lied+van+IJs+en+Vuur+-+Een+Storm+van+Zwa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"linday1","files":-1,"time":1320404039,"description":"Deel 1:\n\nOmschrijving:\nHet tweedelige derde deel\nEen storm van Zwaarden is (tot nog toe) het dikste boek uit de serie. Het boek werd zo uitgebreid dat Martin beslist heeft om het op te splitsen in twee delen, namelijk dit deel, Een Storm van Zwaarden: Staal en Sneeuw, en Een Storm van Zwaarden: Bloed en Goud. \n\nHet eerste deel werd voor het eerst uitgegeven in 2000, en werd vertaald in het Nederlands in 2001.\n\nIn Staal en Sneeuw zijn de Zeven Koninkrijken nog steeds verdeeld door de burgeroorlog, ieder zijn eigen loyaliteit tegenover ÃƒÂ©ÃƒÂ©n van de vijf verschillende koningen. Er zijn er echter die geen tijd of ambitie hebben om zich te mengen in de strijd om de troon,maar een ander doel nastreven: Het veilig houden van de Zeven koninkrijken, en het beschermen tegen dat wat zich achter De Muur bevindt.\n\nDeel 2:\n\n\nOmschrijving:\nOnverminderd geselen kleine en grote veldslagen het continent Westeros. Verbonden worden even snel verbroken als ze worden gesloten, verraad woekert als een besmettelijke ziekte. Huis Lannister heeft zijn greep op de IJzeren Troon verstevigd, maar het zwarte schaap van de familie, Tyrion Lannister, verzet zich in stilte tegen de machinaties van zijn in intriges bedreven zuster, die zowel zijn vader als zijn verwende neef manipuleert.\nRobb Stark heeft andere problemen. Hij is gedwongen zijn jonge koninkrijk te verdedigen tegen de plunderingen van de Grauwvreugdclan, die het Noorden wil opeisen. En ook Jon Sneeuw staat voor een moeilijke keuze: vertrekken van de Muur of het hoofd bieden, aan de strijdmacht die aan de andere kant optrekt?. Een continent verderop nemen de krachten van Daenerys Stormgeboren en haar draken met de dag toe.\nWie zal overwinnen? Wie zal verliezen?\n\n\n\nNLT-RELEASE IS TERUG KOM SNEL NAAR DE SITE:\n &lt;a href=&quot;\nhttp://www.nlt-release.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt-release.nl&lt;/a&gt;\n\n\nBy Linday","torrent":{"xt":"urn:btih:1061a94af99279286fe3a37706927e59b2c157ec","amp;dn":"George+R.R.+McLean+-Het+lied+van+IJs+en+Vuur+-+Een+Storm+van+Zwa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1061a94af99279286fe3a37706927e59b2c157ec","infoHashBuffer":{"type":"Buffer","data":[16,97,169,74,249,146,121,40,111,227,163,119,6,146,126,89,178,193,87,236]},"announce":[],"urlList":[]}}