{"title":"Xev Bellringer - Slutbot Sister [60fps - 1080p]","uid":13502871,"size":2435547599,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:11714b370e304b47db6042ea7c404ff21d969cf1&amp;dn=Xev+Bellringer+-+Slutbot+Sister+%5B60fps+-+1080p%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"xxxsunset","files":1,"time":1455223077,"description":"Screenshots: \nhttp://imgur.su/image/n030\r\n\r\nMy sister is so hot, I just had to fuck her. If it weren't for her stuck up attitude, she'd probably open her legs for me like a good slut. Luckily, I didn't need her permission - I built a slutbot conversion chamber out of the hot tub, stole one of her shoes and tossed it into the spa as bait. As soon as my sister reached into the water, the cycle initiated and sucked her whole body into the machine.\r\n\r\nMy sister was gone, replaced entirely by nanobots... and I am her new Master. Her only goal is to please me sexually whenever and however I want, just like a good slutbot should. To test the unit's effectiveness, I ordered her to grope her big tits through her skin tight dress. It was so hot to watch my perfect, obedient sex toy do as she's told. I finally get to use my sister like I'd always dreamed of.\r\n\r\nI sent her to the bed and told her to touch her pussy...to masturbate in front of me. My slutbot sister informed me that she could cum on command, but I wanted to witness the unit have a natural orgasm. Watching her body shudder in pleasure made me instantly hard. I moved to the bed and had my slutbot wrap her wet lips around my swollen, twitching dick. Finally seeing my sister's head bobbing up and down on my shaft was too much, so I blew my load all over her face","torrent":{"xt":"urn:btih:11714b370e304b47db6042ea7c404ff21d969cf1","amp;dn":"Xev+Bellringer+-+Slutbot+Sister+%5B60fps+-+1080p%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11714b370e304b47db6042ea7c404ff21d969cf1","infoHashBuffer":{"type":"Buffer","data":[17,113,75,55,14,48,75,71,219,96,66,234,124,64,79,242,29,150,156,241]},"announce":[],"urlList":[]}}