{"title":"With Every Heartbeat-Kyss mig.2011.DK.FI.NO.SV.Subtitles","uid":6906016,"size":1873796888,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:117ce15cd527c01c3fca3c19fc27cd6faacee537&amp;dn=With+Every+Heartbeat-Kyss+mig.2011.DK.FI.NO.SV.Subtitles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"svovl1234","files":3,"time":1324586645,"description":"MIA (Ruth Vega Fernandez) and FRIDA (Liv MjÃƒÂ¶nes), both in their thirties, meet each other for the first time at their parents' engagement party. Mia's father, Lasse (Krister Henriksson), is about to get married to Frida's mother, Elizabeth (Lena Endre), which will make Mia and Frida stepsisters. Lasse's daughter, Mia, has not visited her father in years and arrives with her boyfriend, Tim (Joakim NÃƒÂ¤tterqvist), with whom she is about to get married. As Mia and Frida get to know one another, strong emotions begin to stir between them. Their relationship will turn everything upside down for everyone close to them with dramatic consequences.\n\nMIA (Ruth Vega Fernandez) and FRIDA (Liv MjÃƒÂ¶nes), both i sin thirties, meet hinanden for the first time that deras parents' engagement party. Mia's father, Lasse (Krister Henriksson), is about to get married two Frida's mother, Elizabeth (Lena Endre), som vil make Mia and Frida step sisters. Lasse's daughter, Mia, ikke har father visited here in years and arrive here with boyfriend Tim (Scrooge NÃƒÂ¤tterqvist), with Whom She is about to get married. As Mia and Frida get to know one another, strong emotions begin two stare mellom dem. Their relationship ska turn everything upside down for everyone close to dem with Dramatic Consequences.\n","torrent":{"xt":"urn:btih:117ce15cd527c01c3fca3c19fc27cd6faacee537","amp;dn":"With+Every+Heartbeat-Kyss+mig.2011.DK.FI.NO.SV.Subtitles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"117ce15cd527c01c3fca3c19fc27cd6faacee537","infoHashBuffer":{"type":"Buffer","data":[17,124,225,92,213,39,192,28,63,202,60,25,252,39,205,111,170,206,229,55]},"announce":[],"urlList":[]}}