{"title":"The Cars - Candy-O [1979][320 KBPS]","uid":9315223,"size":103762816,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:12671c08efbb133bca5f386bc36377bd6c88a89c&amp;dn=The+Cars+-+Candy-O+%5B1979%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"LameDuck69","files":17,"time":1386458295,"description":"The Cars - Candy-O [1979][320 KBPS]\n\n\n\n\n01. Let's Go   \n02. Since I Held You    \n03. It's All I Can Do   \n04. Double Life   \n05. Shoo Be Doo    \n06. Candy-0   \n07. Night Spots   \n08. You Can't Hold On Too Long    \n09. Lust For Kicks   \n10. Got A Lot On My Head   \n11. Dangerous Type \n\n\n\n\n\n320 KBPS\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nThe Cars are an American rock band that emerged from the new wave scene in the late 1970s. The band originated in Boston, Massachusetts, with lead singer and rhythm guitarist Ric Ocasek, lead singer and bassist Benjamin Orr, lead guitarist Elliot Easton, keyboardist Greg Hawkes and drummer David Robinson. They were signed to Elektra Records by George Daly, then A&amp;R head, in 1977.\n\nThe Cars were at the forefront in merging 1970s guitar-oriented rock with the new synth-oriented pop that was then becoming popular and which would flower in the early 1980s. The Cars started fresh with their debut album The Cars which went on to go platinum in late 1978. The Cars' debut album was called a &quot;genuine rock masterpiece&quot; by Allmusic. The most successful and well known song from the album, &quot;Just What I Needed&quot;, started as a demo in 1977. The song was sent as a mix tape to a local DJ in the Boston area, who played the song in heavy rotation. This soon caught the attention of other DJs, which led to the signing of the band by Elektra Records in 1977.\n\nThe band broke up in 1988, and Ocasek had always discouraged talk of a reunion since then, telling one interviewer in 1997 &quot;I'm saying never and you can count on that.&quot; Bassist Benjamin Orr died in 2000 from pancreatic cancer. In 2005, Easton and Hawkes joined with Todd Rundgren to form a spin-off band, The New Cars, which performed classic Cars and Rundgren songs alongside new material. The surviving original members reunited in 2010 to record a new album, titled Move Like This, which was released May 10, 2011, and a tour to start on the same day.\n\n-----------------------------------------------------------------------------------\n\nCandy-O is the second studio album by the American rock band The Cars. It was released in 1979 on Elektra Records.\n\n-----------------------------------------------------------------------------------\n\nRic Ocasek: rhythm guitar, lead vocals on side one, tracks 2, 4 and 5; side two, tracks 1, 3, 4 and 5\n\nElliot Easton: lead guitar, backing vocals\n\nGreg Hawkes: percussion, keyboards, tenor saxophone, backing vocals\n\nBenjamin Orr: bass guitar, lead vocals on side one, tracks 1, 2, 3, and 6; side two, track 2\n\nDavid Robinson: drums, percussion\n","torrent":{"xt":"urn:btih:12671c08efbb133bca5f386bc36377bd6c88a89c","amp;dn":"The+Cars+-+Candy-O+%5B1979%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12671c08efbb133bca5f386bc36377bd6c88a89c","infoHashBuffer":{"type":"Buffer","data":[18,103,28,8,239,187,19,59,202,95,56,107,195,99,119,189,108,136,168,156]},"announce":[],"urlList":[]}}