{"title":"Duke.Nukem.Forever.Proper-SKIDROW","uid":6462106,"size":4474749399,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:13b2cf6f7878019ea3cc89be37b87226c14f0170&amp;dn=Duke.Nukem.Forever.Proper-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DibyaTPB","files":2,"time":1307807528,"description":"S  K  I  D  R  O  W\n.the leading force.\n\nproudly presents\nDuke Nukem Forever (c) 2K Games\n\n11-06-2011........Release Date - Protection.........Steam  CEG\nFPS..................Game Type - Disk(s)..................1 DVD\n\nPROPER NOTES\n\nRazor1911 did a fine job on getting their release out and reports are\npositive. Respect to the blade for some competition.\n\nStill their release has a problematic issue with the crack, as when you\nprogress in the game, you will notice that you can't go back and play\nprevious completed chapters, besides the first one.\n\nIf you're happy with what you got from the blade, then don't download\nthis proper. Alternative you can get the seperate sr-dnfcf.rar included\nwith this release, so you don't have to download whole game again.\n\nKeep in mind our release has all english, german, french, italian and\nspanish content in one whole package.\n\nRELEASE NOTES\n\nThe King is Back\n\nCocked, loaded and ready for action, Duke delivers epic ass-kicking,\nmassive weapons, giant explosions and pure unadulterated fun\n\nPut on your shades and step into the boots of Duke Nukem. The alien\nhordes are invading and only Duke can save the world. Pig cops, alien\nshrink rays and enormous alien bosses can't stop this epic hero from\naccomplishing his goal: to save the world, save the babes and to be a\nbad-ass while doing it.\n\nThe King arrives with an arsenal of over-the-top weapons, non-stop\naction, and unprecedented levels of interactivity. With hours and hours\nof action, and a range of bodacious multiplayer modes, rest assured\nknowing the fun goes on and on.\n\nDid the Alien bastards not learn their lesson the first time? Duke has\nbeen on hiatus for some time now, kicking back and franchising himself\non the fame he gained from saving Earth from the first invasion. The\nAliens have returned to Earth yet again, messing up Dukes sweet\nroutine of dirty leisure habits.\n\nThe Alien invaders are stealing Earth's women, especially the hot ones\nAnd they drank Duke's beer. This. Won't. Stand. As Duke battles his way\nthrough waves of aliens, the once beautiful gambling haven and Duke\nNukem franchise chains are crumbling before his eyes. Time to bring the\npain\n\nFeatures:\n\nBust a Gut: Duke pulls no punches. Duke's constant stream of hilarious\none-liners throughout the game make this an out loud good time.\n\nWorld Interactivity: Spend as much time as you want shooting hoops,\nlifting weights, playing pinball, pool, air hockey, and slots.\n\nScale &amp; Variety: Packed with explosive FPS action, outlandish settings,\ndriving, and puzzle solving - gamers will never tire of the endless\nFUN.\n\nMultiplayer Like No Other: Classic modes are re-made with a Duke twist.\nShrink, squash, freeze and shatter your opponents, or just frag them\nwith a rocket.\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy all files from the SKIDROW folder to the game installation\n5. Play the game\n6. Support the companies, which software you actually enjoy\n\nADDITIONAL NOTES\n\nIf you want to continue your current savegame, copy the following files\nfrom your Duke Nukem ForeverSystem folder to the folder in the buttom.\n\nlast.dcp\nlast.sav\nmeta.dnp\nprogress.ini\nsystem.ini\nuser.ini\n\nMove/Copy the files in AppdataLocalSKIDROW59700Storage folder\n\nUse the Launcher.exe to change languages\n\nGREETINGS\n\nUnleashed - TiNYiSO - MRN - RADIKAL - POSTMORTEM - GENESIS - SHOCK\nCRUDE - ReUnion - VACE - OUTLAWS - BACKLASH - Titan\n\nascii art by the\ngodlike &amp; terrific duo\nmalodix  irokos\ntitan artdivision","torrent":{"xt":"urn:btih:13b2cf6f7878019ea3cc89be37b87226c14f0170","amp;dn":"Duke.Nukem.Forever.Proper-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13b2cf6f7878019ea3cc89be37b87226c14f0170","infoHashBuffer":{"type":"Buffer","data":[19,178,207,111,120,120,1,158,163,204,137,190,55,184,114,38,193,79,1,112]},"announce":[],"urlList":[]}}