{"title":"Adguard for Windows (v6.0.226) [Multi] (2016)","uid":14375319,"size":171512,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:14be81ec989cddd398c79659b67d138e43e31459&amp;dn=Adguard+for+Windows+%28v6.0.226%29+%5BMulti%5D+%282016%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Woitler","files":1,"time":1461192320,"description":"Program name: Adguard\r\nProgram Type: Adblocker, Antiphishing, Web Filter, pop-ups and ads blocking program\r\nVersion: 6.0.226\r\nRelease date: April 18, 2016\r\nLanguage: English, German, French, Spanish, Russian, Chinese, Korean, and etc.\r\nOperating system: Any Windows version (32-bit &amp; 64-bit)\r\nFile size: 167 Kb\r\n----------------------------------------------------\r\nDescription\r\nAdguard - is an ad blocking program that is justifiably among three best ad blockers in the world together with Adblock and Adblock Plus extensions. However, Adguard is not limited to banal banners removing; it is a universal program that contains all the necessary functions for the most comfortable using of the Internet. For example, blocking or warning about the phishing and other online threats, filtering of obscene materials and protection of your personal data on the Internet. \r\n----------------------------------------------------\r\nFunctionality\r\nThe program includes 3 main modules: AdBlocker, Antiphishing and Parental Control.\r\n- AdBlocker removes all the advertising elements from web pages. Blocks video ads, popups, removes banners and other advertising. At the same time filtering takes place even before the load of the website into browser and this means:\r\na) No advertisements;\r\nb) Less traffic consumed/less money spent;\r\nc) Acceleration of the websites loading.\r\n- Antiphishing protects against malicious and fraudulent websites. The program really reduces the possibility of virus infection of your computer. Adguard uses the backlists, which contain millions of hazardous websites. The Antiphishing module processes the URLs in real time by comparing them with the domains in the database. And thanks to the optimization of this process – such verification takes a split second.\r\n- Parental Control allows you to protect children from obscene materials and adult websites, which altogether ensures the safety of children online. Parents can rest easy, because their child will not see any pornographic content on the Internet. By the way, this feature is unavailable in other popular ad blockers such as Adblock and Adblock Plus.\r\n- Antitracking – protection from outside observing of your internet-surfing history. With Adguard, advertising networks and counters won’t be able to track your searches and websites you visited and use the data for personal gain. Without you using Adguard, they have a fairly complete picture of your sex, age and area of interest.\r\n----------------------------------------------------\r\nAdvantages of the program:\r\n1. Works in all popular browsers;\r\n2. Developed for blocking of all kinds of ads;\r\n3. Easy-to-use, blocks ads and works unnoticed on the background;\r\n4. Warns about danger when clicking on suspicious websites;\r\n5. Has special module (Adguard Assistant) for managing the program right from the browser;\r\n6. Works «out of the box», no additional settings needed;\r\n7. Necessary when using a 3G modem, because accelerates loading of pages notably and saves traffic.\r\n----------------------------------------------------\r\nSystem requirements:\r\nOperating System: Windows XP, Vista, 7, 8, 8.1, 10 (32-bit &amp; 64-bit)\r\nRAM: 512 Mb\r\nBrowsers: Any (Microsoft Edge, IE, Google Chrome, Opera, Firefox, Tor Browser and etc.)\r\nDisk: 50 Mb free hard disk space\r\n----------------------------------------------------\r\nWhat's new in version 6.0.226?\r\n1. [Fixed] Indefinite loading of router page.\r\n2. [Fixed] Rare problem when Adguard crashes after clicking on tray menu icon.\r\n3. [Fixed] Adguard will not crash any more if you switch tabs while have active search on &quot;Settings&quot; screen.\r\n4. [Fixed] Adguard now detects HTML correctly for all websites if there is an xml declaration at the document start.\r\n5. [Changed] Adguard uses native-style tray menu now.\r\n6. [Changed] Adguard window is now opened with a single click on tray menu.\r\n7. [Fixed] &quot;About&quot; window content is not flickering anymore.\r\n8. [Fixed] Empty strings are now removed when importing user filter.\r\n9. [Fixed] Error previously encountered while installing a userstyle.\r\n10. [Improved] Proxy name validator now recognizes domain names and not only IP addresses.\r\n\r\nand etc","torrent":{"xt":"urn:btih:14be81ec989cddd398c79659b67d138e43e31459","amp;dn":"Adguard+for+Windows+%28v6.0.226%29+%5BMulti%5D+%282016%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14be81ec989cddd398c79659b67d138e43e31459","infoHashBuffer":{"type":"Buffer","data":[20,190,129,236,152,156,221,211,152,199,150,89,182,125,19,142,67,227,20,89]},"announce":[],"urlList":[]}}