{"title":"Oceans 11.XviD.AC3.HDRip[Torrentmas.com]","uid":4860831,"size":2725257216,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:158114a2ced133cee820130851c9c92650aa4287&amp;dn=Oceans+11.XviD.AC3.HDRip%5BTorrentmas.com%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nahla","files":1,"time":1240263273,"description":"TÃƒÂ­tulo en LatinoamÃƒÂ©rica: La gran estafa.\nDirecciÃƒÂ³n y fotografÃƒÂ­a: Steven Soderbergh.\nPaÃƒÂ­s: USA.\nAÃƒÂ±o: 2001.\nDuraciÃƒÂ³n: 112 min.\nInterpretaciÃƒÂ³n: George Clooney (Danny Ocean), Brad Pitt (Dusty Ryan), Julia Roberts (Tess Ocean), Casey Affleck (Virgil Malloy), Scott Caan (Turk Malloy), Don Cheadle (Roscoe Means), Matt Damon (Linus Caldwell), Andy Garcia (Harry Benedict), Elliot Gould (Ruben Tischkoff).\nGuiÃƒÂ³n: Ted Griffin; basado en el guiÃƒÂ³n de 1960 de Harry Brown y Charles Lederer; a su vez basado en una historia de George Clayton Johnson y Jack Golden Russell.\nProducciÃƒÂ³n: Jerry Weintraub.\nMÃƒÂºsica: David Holmes.\nMontaje: Stephen Mirrione.\nDiseÃƒÂ±o de producciÃƒÂ³n: Philip Messina.\nDirecciÃƒÂ³n artÃƒÂ­stica: Keith P. Cunningham.\nVestuario: Jeffrey Kurland.\nDecorados: Kristen Toscano Messina.\n\nSINOPSIS\n\nDanny Ocean (George Clooney) es un hombre de acciÃƒÂ³n. En menos de 24 horas fuera de una penitenciarÃƒÂ­a de Nueva Jersey en libertad condicional, el sardÃƒÂ³nico y carismÃƒÂ¡tico ladrÃƒÂ³n ya estÃƒÂ¡ urdiendo su prÃƒÂ³ximo plan. Siguiendo tres reglas -no herir a nadie, no robar a nadie que no se lo merezca y jugar como si no tuviera nada que perder- Danny organiza el golpe mÃƒÂ¡s sofisticado y elaborado de toda la historia a un casino. En una noche, los once especialistas a los que Danny eligiÃƒÂ³ cuidadosamente -entre los que se cuentan un astuto as de las cartas (Brad Pitt), un magistral carterista (Matt Damon) y un genio demoledor (Don Cheadle)- intentarÃƒÂ¡n robar unos 150 millones de dÃƒÂ³lares de los tres casinos de Las Vegas de los que es dueÃƒÂ±o Terry Benedict (Andy Garcia), un elegante y despiadado empresario que acaba de empezar a salir con Tess (Julia Roberts), la exmujer de Danny. Ã‚Â¿Coincidencia o motivo? SÃƒÂ³lo Danny lo sabe con seguridad. Para conseguir el dinero, tendrÃƒÂ¡ que arriesgar su vida y la posibilidad de reconciliarse con Tess. Pero si todo sale de acuerdo con el intrincado y casi imposible plan de Danny, no tendrÃƒÂ¡ que elegir entre el robo y su importantÃƒÂ­sima reuniÃƒÂ³n con Tess... o Ã‚Â¿sÃƒÂ­?","torrent":{"xt":"urn:btih:158114a2ced133cee820130851c9c92650aa4287","amp;dn":"Oceans+11.XviD.AC3.HDRip%5BTorrentmas.com%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"158114a2ced133cee820130851c9c92650aa4287","infoHashBuffer":{"type":"Buffer","data":[21,129,20,162,206,209,51,206,232,32,19,8,81,201,201,38,80,170,66,135]},"announce":[],"urlList":[]}}