{"title":"EnigmaT Set Rips { Cuts } - February 13th, 2014","uid":9609114,"size":750823478,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:15b330aa40d427c3225605214b15f7de65e34ca7&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+February+13th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":74,"time":1392279665,"description":"1Touch - Be Strong (Denis Sender Dub Remix) (Cut From Saint-Jules Set)-enTc.mp3\nAirborn - AirBURN (Instrumental Mix) (Cut From Suzy Set)-enTc.mp3\nAndrea Bertolini - Colorama (Original Mix) (Cut From Anderson Set)-enTc.mp3\nAndrew Roth - Temptaion (Max Freegrant Remix) (Cut From BT Set)-enTc.mp3\nAndy Bianchini - Eastern Mountain (Original Mix) (Cut From Romel Set)-enTc.mp3\nAnske - Antigravity (Original Mix) (Cut From Kandi Set)-enTc.mp3\nAntillas - Adagio In G Minor (Cut From Marlo Set)-enTc.mp3\nArksun - One Day part 01 (A-Mase Breaks Mix 2014) (Cut From Fonarev Set)-enTc.mp3\nAssaf - The Oracle (Original Mix) (Cut From Saint-Jules Set)-enTc.mp3\nAtaraxia - Another Reason (Original Mix) (Cut From Phalanx Set)-enTc.mp3\nBart Claessen - Amazonia (Set Rip)-enTc.mp3\nBazooka &amp; Tomahawk - Enemy Spotted (Jordan Suckley Edit) (Set Rip)-enTc.mp3\nBinary Finary &amp; Frank Dueffel - Trancelation (Original Mix) (Set Rip)-enTc.mp3\nBinary Finary &amp; Lele Troniq feat. Christina Novelli - Waiting For The Sun (Adam Ellis Remix) (Set Rip)-enTc.mp3\nBrian Flinn &amp; Osireion - Ionosphere (Allen Watts Remix) (Set Rip)-enTc.mp3\nBT, Fractal &amp; Jes - Letting Go (Antillas &amp; Dankann Remix) (Cut From Bobina Set)-enTc.mp3\nCold Rush &amp; Tiff Lacey - Cry Wold (Jeremy Vancaulart Remix) (Cut From Marlo Set)-enTc.mp3\nCraigo - Methods of Madness (Original Mix) (Cut From Tero A Set)-enTc.mp3\nDaniel Skyver - On My Mind (Set Rip)-enTc.mp3\nDaniel Skyver - Tangent (Set Rip)-enTc.mp3\nDankann - And god said (Klubb Mix) (Cut From Marlo Set)-enTc.mp3\nDanny  Timezone - House Nation (Original Mix) (Cut From Anderson Set)-enTc.mp3\nDinka feat. Julie Thompson - Radiate (Arston Remix) (Cut From Young Free Set)-enTc.mp3\nEddie Bitar - Metal Mouth (Set Rip)-enTc.mp3\nEmoTek &amp; DJ Leo D feat. Toby Penner - Orange Sky (Original Mix) (Cut From Anderson Set)-enTc.mp3\nEuphoric Feel - Nahadja (Original Mix) (Cut From Romel Set)-enTc.mp3\nFedde Le Grand &amp; DI-RECT - Where We Belong (Jochen Miller Remix) (Cut From Miller Set)-enTc.mp3\nFeel, Vadim Spark &amp; Chris Jones - So Lonely (Ira Remix) (Cut From Bobina Set)-enTc.mp3\nFeel, Vadim Spark &amp; Chris Jones - So Lonely (Kaimo K Remix) (Cut From Feel Set)-enTc.mp3\nHaugli &amp; Lizzie Curious - Your Touch (Lizzie Curious Dub) (Cut From Graham Set)-enTc.mp3\nHerbology - Paramont (Cut From Bobina Set)-enTc.mp3\niKo - Heart Of Stone (Solarstone Pure Mix) (ASOT 650 Rip)-enTc.mp3\nInge Bergann - Oblivion (Original Mix) (Cut From Saint-Jules Set)-enTc.mp3\nJason Ross - Run Away (EDU Dub Mix) (Cut From Graham Set)-enTc.mp3\nJason Ross feat. Kelly Jakle - Run Away (Original Mix) (Cut From Anderson Set)-enTc.mp3\nJasper Hebrink - Malpensa (Original Mix) (Cut From BlueEye Set)-enTc.mp3\nJordan Suckley &amp; Eddie Bitar - Centipede (James Dymond Remix) (Set Rip)-enTc.mp3\nKheiro &amp; Medi - Atma (Original Mix) (Cut From Akira Set)-enTc.mp3\nKorean &amp; Vini - Feel The Wife Vibe (Paul Oakenfold Remix) (Cut From Bobina Set)-enTc.mp3\nLedo - Eyes Wide Closed (Original Mix) (Set Rip)-enTc.mp3\nLondon Grammar - Wasting My Young Years (Solarstone Pure Mix) (ASOT 650 Rip)-enTc.mp3\nMatt Caseli &amp; OLIC feat. Amy Chase - Sunrise (Follow Me) (Jerome Isma-Ae &amp; Ilan Bluestone Remix) (Set Rip)-enTc.mp3\nMatt Lange feat. Tania Zyger - Dark Paradise (Brad &amp; Victor H Remix) (Cut From Young Free Set)-enTc.mp3\nMike Saint-Jules Feat. Sandel - Broken Turn (Original Mix) (Cut From Saint-Jules Set)-enTc.mp3\nMorttagua - Alkon (Original Mix) (Cut From Anderson Set)-enTc.mp3\nN&amp;R Project - Neda (Sound Fusion Remix) (Cut From Jerom Set)-enTc.mp3\nNAGO - Architectures (Myk Bee Remix) (Cut From Tero A Set)-enTc.mp3\nNoizy Boy - Right The Wrong (Cut From Lynam Set)-enTc.mp3\nNumall Fix - Baseball (Original Mix) (Cut From Anderson Set)-enTc.mp3\nODESSEY - Bel Suono (Original Mix) (Cut From Feel Set)-enTc.mp3\nOld Fix - Sonata (Mitka Remix) (Cut From Uplift Set)-enTc.mp3\nPhotographer - Airport (Binary Finary's Hijacked Remix) (Set Rip)-enTc.mp3\nProject Zee - Iter (Original Mix) (Cut From Romel Set)-enTc.mp3\nRene Ablaze &amp; Marcie Joy - My Life (Original Mix) (Cut From Anderson Set)-enTc.mp3\nScience Deal - Infatuation (Original Mix) (Cut From Jerom Set)-enTc.mp3\nScience Deal - Out Of Reach (Original Mix) (Cut From Jerom Set)-enTc.mp3\nSequenze &amp; DJ Falk - Tricky Tricky (Cut From Marlo Set)-enTc.mp3\nSonny Zamolo - 520 (Andre Sobota Remix) (Cut From Saint-Jules Set)-enTc.mp3\nStephane Badey &amp; Timezone - House Nation (Original Mix) (Cut From Anderson Set)-enTc.mp3\nTasso &amp; Daniel Skyver - Do You Copy (Splattered Implant Remix) (Set Rip)-enTc.mp3\nTenishia - Benedictus (Terry Da Libra Remix) (ASOT 650 Rip)-enTc.mp3\nTictoes feat. Debbie-Ellen - Burn My Soul (DJ Yorrin Remix) (Cut From El Jay Set)-enTc.mp3\nTimeLift feat. Chris Kincaid - Love Life (Original Mix) (Cut From Phalanx Set)-enTc.mp3\nTommy Johnson - I Found Her (Original Mix) (Cut From Uplift Set)-enTc.mp3\nTuneflux - Prevail (Original Mix) (Cut From Phalanx Set)-enTc.mp3\nVadim Spark &amp; Yan Space - Morning Without You (Ray Violet Remix) (-Short- Cut From Feel Set)-enTc.mp3\nVasaris - Days Of Future Past (Monoverse Remix) (Cut From Anderson Set)-enTc.mp3\nVasaris - Days Of Future Past (Original Mix) (Cut From Phalanx Set)-enTc.mp3\nWonderful Feeling - Beyond The Truth (Markus Voorn Remix) (Cut From Uplift Set)-enTc.mp3\nX2Sound Feat Sam Vince - Confusion (Daniel B Remix) (Cut From Uplift Set)-enTc.mp3\nXGenic - Ignition (Original Mix) (Set Rip)-enTc.mp3\nYuji Ono - Epic Motion (Cut From BT Set)-enTc.mp3\nYves De Lacroix &amp; Fabio XB feat. Emma Lock - Love Is Lost (Cut From Ferry Set)-enTc.mp3\nZirenz Minosafy - I Think Of You (The Destiny Uplifting Remix) (Cut From Romel Set)-enTc.mp3\n","torrent":{"xt":"urn:btih:15b330aa40d427c3225605214b15f7de65e34ca7","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+February+13th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15b330aa40d427c3225605214b15f7de65e34ca7","infoHashBuffer":{"type":"Buffer","data":[21,179,48,170,64,212,39,195,34,86,5,33,75,21,247,222,101,227,76,167]},"announce":[],"urlList":[]}}