{"title":"James Patterson - Honeymoon - Unb","uid":4767132,"size":198270803,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1698d8e4c852717c21457fa62f38349a0c3a3998&amp;dn=James+Patterson+-+Honeymoon+-+Unb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RamJamSam","files":8,"time":1236909748,"description":"James Patterson - Honeymoon - Unb\nRead by:  Hope Davis and Campbell Scott\nRuntime:  6 Hours and 53 Minutes\n\n\n\n\n\n\n\nNora Sinclair, a beautiful woman who is a highly regarded interior decorator, is also a black widow serial killer. She is presently involved with a former client-a multimillionaire who adores her. She also has a wealthy husband living in Boston who also adores her. Neither is safe from her lethal omelets. Unbeknownst to her, FBI agent, John O'Hara, posing as an insurance claims adjuster, is investigating her possible involvement in her first husband's death. The captivating, brilliant and sensuous Nora soon casts her web around the vulnerable O'Hara. Nora and the agent play a cat and mouse game that leads to assumption after assumption. \nThis is an exciting book which will hold your interest from the first paragraph to its end. Patterson has done it again. Just when the listener has solved the mystery and identified the motives of the bad guys, he throws in another plot twist. The story has more twists and turns than a dangerous mountain road. Patterson and co-author Howard Roughan will surprise you more than once throughout the book, especially at its unexpected conclusion. \nThe two readers, Hope Davie and Scott Campbell, share the narration and do an excellent job of creating easily recognizable characters. So much of the dialogue is between Nora and John or one of her lovers or between John and his supervisor Susan that hearing both a male and female voice is very effective. \nThis book is easy to recommend because it is a first class thriller. It's the kind of book that will have you hoping for a traffic jam so that you can listen to a few more chapters before arriving at your destination.\n\n\n\n\nGooD SeeDinG!\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:1698d8e4c852717c21457fa62f38349a0c3a3998","amp;dn":"James+Patterson+-+Honeymoon+-+Unb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1698d8e4c852717c21457fa62f38349a0c3a3998","infoHashBuffer":{"type":"Buffer","data":[22,152,216,228,200,82,113,124,33,69,127,166,47,56,52,154,12,58,57,152]},"announce":[],"urlList":[]}}