{"title":"Lord Sitar - Lord Sitar (1968 @224)","uid":3374490,"size":68489755,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:17422dc963618f988a69da61de2eceaa7e3b8027&amp;dn=Lord+Sitar+-+Lord+Sitar+%281968+%40224%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"test78","files":13,"time":1124968810,"description":"Search for test78 to find my other uploads.\n\n\nLord Sitar was the alias for renowned session musician and guitar virtuoso Big Jim Sullivan who, in 1966/67, found himself in the enviable position of being the only established session guitarist in England to own a sitar. By 1967, that attribute had turned him into a valuable commodity, mostly because of the instrument's being popularized by George Harrison of the Beatles and Brian Jones of the Rolling Stones on various of their respective groups' recordings. Sullivan had already recorded a whole album of sitar-based music entitled Sitar Beat for Mercury Records (released in 1968) when someone at Regal Zonophone -- an imprint of EMI, which already owned the real article in raga rock in the form of George Harrison's Beatles recordings -- decided that they needed an album to cash in on the boom for the Hindustani instrument's sound. Thus was born &quot;Lord Sitar,&quot; as he was billed, with Sullivan working under producer John Hawkins. In subsequent interviews, including one with Kieron Tyler accompanying the R.P.M. reissue of Sitar Beat, Sullivan has described those sessions as unsatisfying and unmemorable, especially when compared to those for Sitar Beat. The Lord Sitar album, however, managed to get reviewed even in the pages of Rolling Stone (then the Bible of rock music) -- thanks to the mystery surrounding &quot;Lord Sitar&quot; and the fact that the album appeared on Capitol Records in America, some people suspected (encouraged by Hawkins' sleeve notes) that there was some direct connection between Lord Sitar and George Harrison. There was, indeed, but only in the crassest commercial way, and only from one side, and not even involving the musicians. The presence of &quot;If I Were A Rich Man&quot; on the album's song list quickly dispelled any rumors, and &quot;Lord Sitar&quot; was added to a list of peripheral Beatles ephemera (and how much more ephemeral could one possibly get, than to be peripheral ephemera?) that came to include Klaatu and other supposed/alleged/rumored Beatles projects. Ironically, the ruse might've worked -- at least for a few seconds -- if only Hawkins hadn't selected such bizarre material (not just &quot;If I Were A Rich Man&quot;, but also &quot;Daydream Believer&quot; and Kim Fowley's &quot;Ode To Joy&quot; rip-off &quot;Emerald City&quot; and two of Hawkins' own copyrights, &quot;Tomorrow's People&quot; and &quot;In A Dream&quot;) to record. The sheer bizarre nature of the project makes one wonder if anyone ever actually sat down and even decided precisely what it was they were doing. ~ Bruce Eder, All Music Guide\n\n\n\nThe rating of this album is a bit of a problem -- on one level, it isn't any better than one would expect from a studio pick-up band doing raga-style covers of &quot;I Am The Walrus,&quot; &quot;&amp;Black Is Black,&quot; &quot;Eleanor Rigby,&quot; &quot;&amp;Blue Jay Way,&quot; etc. It isn't what one would can call a terribly adventurous recording, and it's exactly the opposite of the recordings -- George Harrison's &quot;Love You To&quot; and &quot;Within You, Without You&quot; -- whose textures it seems to want to emulate. On the other, it does have its odd moments of beauty, such as the heavy sitar noodling on &quot;Eleanor Rigby&quot; and &quot;I Am The Walrus,&quot; and the sitar subbing for the lead vocal line on Pete Townshend's &quot;I Can See For Miles&quot; is worth hearing once, at least. &quot;Blue Jay Way&quot; is so strange -- the Beatles' original being a raga-style number with no sitar -- that it is also worth a listen. Additionally, the album was cut with a special emphasis on the stereo separation and a very bright sound, that makes it a peculiar extension of the late '50s &quot;bachelor's den&quot; audiophile school of recording. And one track here, &quot;Black Is Black,&quot; does rock out in no uncertain terms, and the sitar does a good job there of extending the song into some new territory, sub-continent Top 40 rock. The album was reissued late in 1999 on EMI's revived Zonophone label, an appropriate place for the label's in-house psychedelic vision, limited as it was. ~ Bruce Eder, All Music Guide\n\n\n224kbs\nCover included\n\nTracklist:\n\n1. If I Were a Rich Man\t(5:46)\t  \t  \t\n2. Emerald City\t\t(2:55)\t  \t  \t\n3. Tomorrow's People\t(3:12)\t  \t  \t\n4. Daydream Believer\t(3:34)\t  \t  \t\n5. Like Nobody Else\t(4:22)\t  \t  \t\n6. I Am the Walrus\t(4:18)\t  \t  \t\n7. In a Dream\t\t(3:15)\t  \t  \t\n8. Eleanor Rigby\t(2:21)\t  \t  \t\n9. I Can See for Miles\t(3:41)\t  \t  \t\n10. Blue Jay Way\t(4:24)\t  \t  \t\n11. Black Is Black\t(2:48)\n\nEnjoy !","torrent":{"xt":"urn:btih:17422dc963618f988a69da61de2eceaa7e3b8027","amp;dn":"Lord+Sitar+-+Lord+Sitar+%281968+%40224%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17422dc963618f988a69da61de2eceaa7e3b8027","infoHashBuffer":{"type":"Buffer","data":[23,66,45,201,99,97,143,152,138,105,218,97,222,46,206,170,126,59,128,39]},"announce":[],"urlList":[]}}