{"title":"Vampire Rodents + Ether Bunny Discography (FLAC)","uid":8724381,"size":2387473793,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:175154f8872da6e0cd3bd62e825958513d684f72&amp;dn=Vampire+Rodents+%2B+Ether+Bunny+Discography+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SoulCrusher657","files":148,"time":1374484075,"description":"\nThis is the discography of the &quot;Avant-garde&quot; band Vampire Rodents. It contains five of their albums as well as Ether Bunny's Papa Woody (Daniel Vahnke's jazz project). If we lived in a perfect world Vampire Rodents would have been up there in the Top 40, mingling with the likes of Hole and Soul Collective. But such was not the case and the project was banished to obscurity... until now that is! Lullaby Land seems to be real popular with the kid these days, so make sure to blast it loud out car window for the sake of looking &quot;hip&quot; or perhaps even &quot;fly&quot; if you're real lucky. However, I personally prefer Premonition and also think it's the best starting point (or perhaps Gravity's Rim). If you're having difficulty embracing the band (and even if you aren't) I suggest reading the lyrics as you listen to the music. A good half of what makes the band so spectacular is Danny Vahnke's twisted humor. For all you jazz enthusiasts I've also added Ether Bunny, which never received the admiration among children it desired. As a matter of fact it's criminal that none of these fine albums never received the wider circulation they deserved (although you can readily purchase Lullaby Land on amazon for around 80 dollars). Of course, good ole' Dan &quot;man with the plan&quot; Vahnke is planning on re-releasing all the albums any year now, so be sure to have your wallet at the ready so you can throw all your money at him when the time comes. I know I will...\n\ncontains: \n(1991) War Music\n(1992) Premonition\n(1993) Lullaby Land\n(1995) Clockseed\n(1996) Ether Bunny - Papa Woody\n(1996) Gravity's Rim\n\nflac","torrent":{"xt":"urn:btih:175154f8872da6e0cd3bd62e825958513d684f72","amp;dn":"Vampire+Rodents+%2B+Ether+Bunny+Discography+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"175154f8872da6e0cd3bd62e825958513d684f72","infoHashBuffer":{"type":"Buffer","data":[23,81,84,248,135,45,166,224,205,59,214,46,130,89,88,81,61,104,79,114]},"announce":[],"urlList":[]}}