{"title":"Space STG II v2.7.5","uid":9007000,"size":9343650,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:17fbf02b5d07bf27c00d98deeafc15d7444c5536&amp;dn=Space+STG+II+v2.7.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1381053524,"description":"\nSpace STG II - Death Rain is a sci-fi real time strategy game. It is continuation of Space STG, the finalist of ADC II competition! This is demo version with 4 free missions.\n\nImmerse yourself in a mortal war of clans. Explore solar systems, manage cities, develop technology and create space fleet. Delightfully challenging, yet simple enough to grasp.\n\n&quot;STG II is quite immersive and offers much more depth than most Android RTS games I've seen thus far. With a deep tech-tree, multiple ships, upgrades, and plenty of things to manage, it will keep you on your toes from beginning to end. \n\nThe computer AI seems relatively intelligent, in an artificial sort of way, and provides a tough challenge - even on the standard difficulty.&quot; - droidgamers.com\n\nGame provides:\n\n- 40 beautiful missions in scenario, one special suprise mission endless quick missions.\n- 8 ships: Transporter, Fighter, Warrior, Rocketer, Warship and MotherShip.\n- 8 upgrades of ships to modern your combat. For instance: Shoots from distance, bombard buildings, transformation of ships. \n- 7 special technology to spread power and chaos. For instance: nuclear missile, electrical storm, planetary shield, mining station.\n- 7 technologies to raise your domination. For instance: turn back in time, planetary tunel, invisibility, hologram, antimatern layer.\n\nIf you want to spend some time establishing, developing and conquering, you should try this most wanted RTS game.\n\nWhat's New:\n\nVersion 2.7.3\nBugs fixed.\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=org.ovh.grzegorzaeSTG2Full&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=org.ovh.grzegorzaeSTG2Full&lt;/a&gt;\n","torrent":{"xt":"urn:btih:17fbf02b5d07bf27c00d98deeafc15d7444c5536","amp;dn":"Space+STG+II+v2.7.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17fbf02b5d07bf27c00d98deeafc15d7444c5536","infoHashBuffer":{"type":"Buffer","data":[23,251,240,43,93,7,191,39,192,13,152,222,234,252,21,215,68,76,85,54]},"announce":[],"urlList":[]}}