{"title":"Edison Lighthouse - Love Grows (1970 Mpg)","uid":6076061,"size":25364331,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:18064ec254b8b62832f41b8869da5b9e3a2c2175&amp;dn=Edison+Lighthouse+-+Love+Grows+%281970+Mpg%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Iron_Horse","files":2,"time":1293861016,"description":"Edison Lighthouse - Love Grows (1970 Mpg)\n\nI'm In A Good Mood Tonigt So IGive You This\nEdison Lighthouse - Love Grows (1970)\n\nI Whis You All A Happy New Year Iron_horse\n\nVideo: MPEG1 Video 352x288 (4:3) 25.00fps 1150Kbps [Video]\nAudio: MPEG Audio 44100Hz stereo 224Kbps [Audio]\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Love_Grows_%28Where_My_Rosemary_Goes%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Love_Grows_%28Where_My_Rosemary_Goes%29&lt;/a&gt;\n&quot;Love Grows (Where My Rosemary Goes)&quot; is a popular song by &quot;one-hit wonder&quot; Edison Lighthouse. The single hit the number one spot on the UK singles chart on \n\nthe week ending on 31 January 1970, where it remained for a total of five weeks.\n\nSong profile\n&quot;Love Grows (Where My Rosemary Goes)&quot; was written by Tony Macaulay, Barry Mason and Sylvan Whittingham. Essentially they were a studio group with prolific \n\nsession singer Tony Burrows providing the vocals. When the song became number one a group needed to be put together rapidly to feature on the popular TV show \n\nTop Of The Pops. Sylvan Whittingham found a group called Greenfields and brought them to the auditions a week before Top of the Pops. Once chosen and \n\nrehearsed non-stop they appeared on the show as 'Edison Lighthouse' to mime to the fastest climbing no 1 hit record in history. Burrows sang the song on the \n\nprogramme, which happened to be his third appearance on the same show with three different groups. It reached number 5 on US pop chart, number 3 in Canada, \n\nand number 1 on the UK Singles Chart for five weeks in January and February 1970.\n\nBiography  by Jason Ankeny  allmusic.com\nThe British pop group Edison Lighthouse was primarily the vehicle of session vocalist Tony Burrows; the group's lone hit, 1970's &quot;Love Grows (Where My \n\nRosemary Goes),&quot; was one of four simultaneous U.K. Top Ten records scored by Burrows under different names (the others were White Plains' &quot;My Baby Loves \n\nLovin',&quot; the Pipkins' &quot;Gimme Dat Ding,&quot; and the Brotherhood of Man's &quot;United We Stand&quot;). In truth, Edison Lighthouse was merely the alias of songwriters and \n\nproducers Tony McCaulay and Barry Mason, although members of the group Greenfield Hammer were eventually brought in to perpetuate the image of a real \n\nworking band; after the success of &quot;Love Grows,&quot; Burrows exited to pursue other projects, and McCaulay, who owned the copyright to the Edison name, simply \n\nassembled another group to record under the alias. The second Edison Lighthouse barely cracked the U.K. Top 50 with the single &quot;It's Up to You, Petula&quot; before \n\nvanishing.\n\nSee my other Torrents: http://thepiratebay.se/user/Iron_Horse/","torrent":{"xt":"urn:btih:18064ec254b8b62832f41b8869da5b9e3a2c2175","amp;dn":"Edison+Lighthouse+-+Love+Grows+%281970+Mpg%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18064ec254b8b62832f41b8869da5b9e3a2c2175","infoHashBuffer":{"type":"Buffer","data":[24,6,78,194,84,184,182,40,50,244,27,136,105,218,91,158,58,44,33,117]},"announce":[],"urlList":[]}}