{"title":"WinRAR 5.00 Beta 6!! By ..::munish83::..","uid":8751007,"size":1968048,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:181e5b572560535e14ad6da814405ce0ced1bbd0&amp;dn=WinRAR+5.00+Beta+6%21%21+By+..%3A%3Amunish83%3A%3A..&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Munish83","files":1,"time":1375030705,"description":"WinRAR 5.00 Beta 6!! By ..::munish83::..\n\n\nAbout:::\n\nWinRAR is an archiving utility that completely supports RAR and ZIP archives and is able to unpack CAB, ARJ, LZH, TAR, GZ, ACE, UUE, BZ2, JAR, ISO, 7Z, Z archives. It consistently makes smaller archives than the competition, saving disk space and transmission costs.\n\nWinRAR offers a graphic interactive interface utilizing mouse and menus as well as the command line interface. WinRAR is easier to use than many other archivers with the inclusion of a special &quot;Wizard&quot; mode which allows instant access to the basic archiving functions through a simple question and answer procedure.\n\nWinRAR offers you the benefit of industry strength archive encryption using AES (Advanced Encryption Standard) with a key of 128 bits. It supports files and archives up to 8,589 billion gigabytes in size. It also offers the ability to create selfextracting and multivolume archives. With recovery record and recovery volumes, you can reconstruct even physically damaged archives.\n\nChanges:::::\n\n# Fixed a bug in recovery record generation in RAR 5.0 archive format.\n- Under certain circumstances previous beta versions could produce wrong recovery record data, inefficient to repair a corrupt archive. Such invalid recovery record can be identified with &quot;Test&quot; command, which issues &quot;Recovery record is corrupt&quot; warning for it.","torrent":{"xt":"urn:btih:181e5b572560535e14ad6da814405ce0ced1bbd0","amp;dn":"WinRAR+5.00+Beta+6%21%21+By+..%3A%3Amunish83%3A%3A..","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"181e5b572560535e14ad6da814405ce0ced1bbd0","infoHashBuffer":{"type":"Buffer","data":[24,30,91,87,37,96,83,94,20,173,109,168,20,64,92,224,206,209,187,208]},"announce":[],"urlList":[]}}