{"title":"Skye's Legacy 04 - Intrigued - Bertrice Small.epub","uid":9501336,"size":386950,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:183ed2b43fba4259a528017595fdf84aeefe8c78&amp;dn=Skye%27s+Legacy+04+-+Intrigued+-+Bertrice+Small.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"taylorman","files":1,"time":1390236327,"description":"The latest installment in Small's popular historical-romance series, Skye's Legacy, has been chosen as the launch book for Kensington's new erotic romance imprint. It continues the saga of lusty matriarch Skye O'Malley, this time chronicling the exploits of her great-granddaughter, Lady Autumn Rose Leslie, daughter of the Duchess Jasmine. The mid-17th century finds England engaged in civil war, King Charles the First beheaded, the throne abandoned and Sir Oliver Cromwell establishing an English republic. But 19-year-old Autumn's primary concern is finding a suitable husband amid the strife. Impelled by the war's threat to the blue bloods and the death of her husband, Duchess Jasmine spirits Autumn away to the safety of the family chateau in the Loire Valley. In France, there is still some semblance of order, and the court of 12-year-old King Louis XIV provides a suitable stage for Autumn to make her social debut in style. She is courted in grand fashion by the dashing Marquis d'Auriville; they soon wed and he initiates Autumn into the fine art of carnal pleasures. Marital bliss comes to an end with his untimely death and Autumn's new role as widow soon attracts the attention of the now 18-year-old Louis, whose amorous advances Autumn spurned when the two first met. After a lurid tryst with the insatiable king, Autumn bears a royal bastard. With Cromwell dead and the British monarchy restored, Autumn and her family return to England, where she dazzles the royal court and seduces King Charles II. Small has delivered an erotic adventure couched mildly in the political intrigue of 17th-century France and England. Fans will devour the latest offering in this series, relishing the steamy sex scenes and happy ending","torrent":{"xt":"urn:btih:183ed2b43fba4259a528017595fdf84aeefe8c78","amp;dn":"Skye%27s+Legacy+04+-+Intrigued+-+Bertrice+Small.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"183ed2b43fba4259a528017595fdf84aeefe8c78","infoHashBuffer":{"type":"Buffer","data":[24,62,210,180,63,186,66,89,165,40,1,117,149,253,248,74,238,254,140,120]},"announce":[],"urlList":[]}}