{"title":"Atomic Force Microscopy, Scanning Nearfield Optical Microscopy a","uid":15480736,"size":18725133,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:187235db423952c1eb73d16bd38e786d3b99785a&amp;dn=Atomic+Force+Microscopy%2C+Scanning+Nearfield+Optical+Microscopy+a&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1470251976,"description":"Atomic Force Microscopy, Scanning Nearfield Optical Microscopy and Nanoscratching - G. Kaupp (Springer, 2006).pdf\r\n\r\nMaking a clear distinction is made between nano- and micro-mechanical testing for physical reasons, this monograph describes the basics and applications of the supermicroscopies AFM and SNOM, and of the nanomechanical testing on rough and technical natural surfaces in the submicron range down to a lateral resolution of a few nm. New or improved instrumentation, new physical laws and unforeseen new applications in all branches of natural sciences (around physics, chemistry, mineralogy, materials science, biology and medicine) and nanotechnology are covered as well as the sources for pitfalls and errors. It outlines the handling of natural and technical samples in relation to those of flat standard samples and emphasizes new special features. Pitfalls and sources of errors are clearly demonstrated as well as their efficient remedy when going from molecularly flat to rough surfaces. The academic or industrial scientist learns how to apply the principles for tackling their scientific or manufacturing tasks that include roughness far away from standard samples","torrent":{"xt":"urn:btih:187235db423952c1eb73d16bd38e786d3b99785a","amp;dn":"Atomic+Force+Microscopy%2C+Scanning+Nearfield+Optical+Microscopy+a","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"187235db423952c1eb73d16bd38e786d3b99785a","infoHashBuffer":{"type":"Buffer","data":[24,114,53,219,66,57,82,193,235,115,209,107,211,142,120,109,59,153,120,90]},"announce":[],"urlList":[]}}