{"title":"Music Scene 1969","uid":8325271,"size":4328923136,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:18be9e839577df12a06eda2cf1f4f7867ddaa20d&amp;dn=Music+Scene+1969&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"winiwini","files":11,"time":1364779393,"description":"A ratings disaster when it premiered on the ABC network on September 22, 1969 (and lasting a mere 16 weeks before cancellation), Music Scene now stands as a sublime time capsule of the &quot;flower power&quot; era. Although it was smartly conceived by the hipper-than-average producers of the controversial Smothers Brothers Comedy Hour, the show was riskily scheduled opposite ratings juggernauts Gunsmoke and Laugh-In, and its fate was sealed. Now, with the passage of decades, these shows display a laudable effort to lure serious rock music into the pop-cultural mainstream--there were few if any opportunities for these acts to gain prime-time TV exposure, so it wasn't unusual to find Janis Joplin, Sly &amp; the Family Stone, or Crosby, Stills, Nash &amp; Young colliding on the guest list with bubble-gum pop stars like Bobby Sherman and MOR crooners like Steve Lawrence and Eydie Gorme. \n\nStruggling to bridge the generation gap, host comedian David Steinberg--with a group of five regular cohosts including Lily Tomlin and occasional guest hosts--is a well-chosen mouthpiece for Hollywood's anti-Nixon liberalism, able to distinguish the important (Joe Cocker, Richie Havens) from the ridiculous (the nonexistent Archies and their #1 hit &quot;Sugar Sugar&quot; are duly dismissed). \n\nJames Brown, Crosby Stills Nash &amp; Young, Tom Jones,Rascals,Miracles, Sly &amp; The Family Stone, Temptations, Jerry Lee Lewis, Ten Years After, Janis Joplin, Issac Hayes a.o.","torrent":{"xt":"urn:btih:18be9e839577df12a06eda2cf1f4f7867ddaa20d","amp;dn":"Music+Scene+1969","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18be9e839577df12a06eda2cf1f4f7867ddaa20d","infoHashBuffer":{"type":"Buffer","data":[24,190,158,131,149,119,223,18,160,110,218,44,241,244,247,134,125,218,162,13]},"announce":[],"urlList":[]}}