{"title":"Predictably Irrational by Dan Ariely [epub] [mobi]","uid":8145055,"size":1039832,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:193b861fd2f87a24bfaba6265365d4155dd7b8dc&amp;dn=Predictably+Irrational+by+Dan+Ariely+%5Bepub%5D+%5Bmobi%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":10,"uploader":"mile47","files":2,"time":1360896375,"description":"Predictably Irrational: The Hidden Forces That Shape Our Decisions\n\nby Dan Ariely \n\nWhy do our headaches persist after taking a one-cent aspirin but disappear when we take a 50-cent aspirin?\n\nWhy does recalling the Ten Commandments reduce our tendency to lie, even when we couldn't possibly be caught?\n\nWhy do we splurge on a lavish meal but cut coupons to save twenty-five cents on a can of soup?\n\nWhy do we go back for second helpings at the unlimited buffet, even when our stomachs are already full?\n\nAnd how did we ever start spending $4.15 on a cup of coffee when, just a few years ago, we used to pay less than a dollar?\n\nWhen it comes to making decisions in our lives, we think we're in control. We think we're making smart, rational choices. But are we?\n\nIn a series of illuminating, often surprising experiments, MIT behavioral economist Dan Ariely refutes the common assumption that we behave in fundamentally rational ways. Blending everyday experience with groundbreaking research, Ariely explains how expectations, emotions, social norms, and other invisible, seemingly illogical forces skew our reasoning abilities.\n\nNot only do we make astonishingly simple mistakes every day, but we make the same &quot;types&quot; of mistakes, Ariely discovers. We consistently overpay, underestimate, and procrastinate. We fail to understand the profound effects of our emotions on what we want, and we overvalue what we already own. Yet these misguided behaviors are neither random nor senseless. They're systematic and predictable--making us &quot;predictably&quot; irrational.\n\nFrom drinking coffee to losing weight, from buying a car to choosing a romantic partner, Ariely explains how to break through these systematic patterns of thought to make better decisions. &quot;Predictably Irrational&quot; will change the way we interact with the world--one small decision at a time.","torrent":{"xt":"urn:btih:193b861fd2f87a24bfaba6265365d4155dd7b8dc","amp;dn":"Predictably+Irrational+by+Dan+Ariely+%5Bepub%5D+%5Bmobi%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"193b861fd2f87a24bfaba6265365d4155dd7b8dc","infoHashBuffer":{"type":"Buffer","data":[25,59,134,31,210,248,122,36,191,171,166,38,83,101,212,21,93,215,184,220]},"announce":[],"urlList":[]}}