{"title":"John Norris - Collision Course","uid":7016603,"size":5860935,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:19ecb42da8eedf73ce90701fc5afc096ca5e780e&amp;dn=John+Norris+-+Collision+Course&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"stormium","files":-1,"time":1328685948,"description":"Three formats included (mobi, epub, pdf) Seed and Enjoy.\n\nIf Europe, Russia, and international bodies such as the U.N. and NATO end up playing a more prominent role in Iraq's immediate future, all parties, including the United States, would do well to revisit the lessons learned during the U.S.-led war in Kosovo in 1999. As a confrontation over Kosovo's final push for independence looms, this book offers seminal insight into the negotiations that took place between the United States and Russia in an effort to set the terms for ending the conflict. This study in brinksmanship and deception is an essential background for anyone trying to understand Russia's uneasy relations with the West. America's relationship with Russia has become increasingly important as Washington has engaged Moscow as a critical, but often prickly, ally in the war on terror. From smoky late-night sessions at dachas outside of Moscow to meetings in the White House Situation Room, Norris captures the feel of a war that repeatedly threatened to spin out of control. He offers a vivid portrait of some of the larger-than-life characters involved in the conflict, including U.S. president Bill Clinton, General Wesley Clark, Yugoslav president Slobodan Milosevic, and Russian president Boris Yeltsin. New information includes backstage efforts to open a direct negotiating channel between Milosevic and Washington at the height of the conflict. The book reaches a dramatic crescendo against the backdrop of the war's final days, when Russia unleashed a secret plan to push its forces into Kosovo, ahead of NATO peacekeepers.","torrent":{"xt":"urn:btih:19ecb42da8eedf73ce90701fc5afc096ca5e780e","amp;dn":"John+Norris+-+Collision+Course","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19ecb42da8eedf73ce90701fc5afc096ca5e780e","infoHashBuffer":{"type":"Buffer","data":[25,236,180,45,168,238,223,115,206,144,112,31,197,175,192,150,202,94,120,14]},"announce":[],"urlList":[]}}