{"title":"Prisoner of Zenda","uid":10720670,"size":89490971,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1c04a54b09d8e614f83cf8a43a77073712ebd66a&amp;dn=Prisoner+of+Zenda&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pigman58","files":2,"time":1407478185,"description":"2 x 90 Mins\n\n1) The Prisoner of Zenda\n\n\nThe story of the Prisoner of Zenda is well known, but for those not familiar, the plot is thus. Aristocratic Rudolph Rasendyll and the soon to be crowned King of Ruritania share a common ancestor and look exactly alike, a fact they discover when they meet by chance on the day before the coronation. The King is captured that evening by his half brother Black Michael and Rassendyll is put upon to stand in for the King at the coronation, where he meets Princess Flavia, the King's cousin. They fall in love - the Princess did not love he real King - but Rassendyll must fight Black Michael and is henchmen to rescue the King.\n\n\n2) Rupert of Henzau\n\nRupert of Henzau is the lesser known sequel. It is 3 years since Rassendyll killed Black Michael and saved the King. Rassendyll and the now Queen Flavia have kept up a correspondence. The exiled Rupert of Henzau gets to know of this and steals a letter from the Queen to Rassendyll. The latter must do everything to stop the letter getting to the King and save the Queen's honour.\n\nThese are classic 19th century romantic adventures and feature three actors with wonderful voices for radio: Julian Glover, Martin Jarvis and the thinking man's older totty, Hannah Gordon, she with a voice like velvet.\n\n40 years old, but still two of my favourite dramas. Enjoy.","torrent":{"xt":"urn:btih:1c04a54b09d8e614f83cf8a43a77073712ebd66a","amp;dn":"Prisoner+of+Zenda","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c04a54b09d8e614f83cf8a43a77073712ebd66a","infoHashBuffer":{"type":"Buffer","data":[28,4,165,75,9,216,230,20,248,60,248,164,58,119,7,55,18,235,214,106]},"announce":[],"urlList":[]}}