{"title":"Maximum Ride-The Angel Experiment By James Patterson","uid":8739225,"size":1553101,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e814fdfcf845e2029270a5299e70c421411e799&amp;dn=Maximum+Ride-The+Angel+Experiment+By+James+Patterson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"OrajelJunkie","files":-1,"time":1374745424,"description":"In James Patterson's blockbuster series, fourteen-year-old Maximum Ride, better known as Max, knows what it's like to soar above the world. She and all the members of the &quot;flock&quot;--Fang, Iggy, Nudge, Gasman and Angel--are just like ordinary kids--only they have wings and can fly. It may seem like a dream come true to some, but their lives can morph into a living nightmare at any time...like when Angel, the youngest member of the flock, is kidnapped and taken back to the &quot;School&quot; where she and the others were experimented on by a crew of wack jobs. Her friends brave a journey to blazing hot Death Valley, CA, to save Angel, but soon enough, they find themselves in yet another nightmare--this one involving fighting off the half-human, half-wolf &quot;Erasers&quot; in New York City. Whether in the treetops of Central Park or in the bowels of the Manhattan subway system, Max and her adopted family take the ride of their lives. Along the way Max discovers from her old friend and father-figure Jeb--now her betrayed and greatest enemy--that her purpose is save the world--but can she?","torrent":{"xt":"urn:btih:1e814fdfcf845e2029270a5299e70c421411e799","amp;dn":"Maximum+Ride-The+Angel+Experiment+By+James+Patterson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e814fdfcf845e2029270a5299e70c421411e799","infoHashBuffer":{"type":"Buffer","data":[30,129,79,223,207,132,94,32,41,39,10,82,153,231,12,66,20,17,231,153]},"announce":[],"urlList":[]}}