{"title":"Writing on the Wall - Power of the Picts (1969)(prog,psych)(mp3)","uid":8850080,"size":129636167,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1f69419e8422f1f3dd338a7a3d39f850fdd19eb3&amp;dn=Writing+on+the+Wall+-+Power+of+the+Picts+%281969%29%28prog%2Cpsych%29%28mp3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"glngwl","files":18,"time":1377499352,"description":"Writing on the Wall - &quot;Power of the Picts&quot; (1969) (320kbps)\n\nHeavy prog/psych album from Scottish rock band of the late 1960s and early 1970s.\n\nThe group originally formed as The Jury, changing their name to Writing on the Wall in early 1968. The band's manager moved the group to London and let them perform at his club, the Middle Earth. That same year the band recorded a BBC radio session for disc jockey John Peel, and made a live demo album as well.\n\nThey eventually recorded their lone album &quot;The Power of the Picts&quot; for Waldman's Middle Earth label in 1969. They also recorded a 7&quot; that same year. In 1971 the band did another session for John Peel, and made an LP in Scotland in 1972 that was never released, then went though several lineup changes. The group tried to record another album in Wales near the end of 1973, but finally gave up when their equipment was stolen in December of that year.\n\nNote: the original LP's Side A comprised tracks 6-9 of this upload, and Side B contained tracks 1-5. But for some reason, this CD reissue has unaccountably reversed the sides. This incorrect order has been retained in this upload, in order to maintain consistency with the booklet and cover scans which are included here.\n\nThis reissue also contains the two tracks on the 7&quot; recorded the same year as the album, which were not on the original LP (tracks 10-11).","torrent":{"xt":"urn:btih:1f69419e8422f1f3dd338a7a3d39f850fdd19eb3","amp;dn":"Writing+on+the+Wall+-+Power+of+the+Picts+%281969%29%28prog%2Cpsych%29%28mp3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f69419e8422f1f3dd338a7a3d39f850fdd19eb3","infoHashBuffer":{"type":"Buffer","data":[31,105,65,158,132,34,241,243,221,51,138,122,61,57,248,80,253,209,158,179]},"announce":[],"urlList":[]}}