{"title":"Max Keiser - On The Edge 2012 Mar 09 FR [sebaygo1]","uid":7092892,"size":16705153,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1ff6b8a0c094323f470b12d0b3e19a0bbb40ebd1&amp;dn=Max+Keiser+-+On+The+Edge+2012+Mar+09+FR+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sebaygo1","files":3,"time":1331431412,"description":". \n\nOn The Edge (Press TV)\n- with Max Keiser -\nFriday, 09 March 2012\n\n\n[sebaygo1]\n\n\nIn this edition of On the Edge, Max interviews Steve Keen from DebtDeflation.com. He talks about the Australian economy and the housing sector bubble bursting in Australia, Canada, UK and Hong Kong.\n\nSteve Keen is Professor of Economics &amp; Finance at the University of Western Sydney, and author of the popular book Debunking Economics.\n\nSteve predicted the financial crisis as long ago as December 2005, and warned that back in 1995 that a period of apparent stability could merely be &quot;the calm before the storm&quot;.\n\nHis leading role as one of the tiny minority of economists to both foresee the crisis and warn of it was recognized by his peers when he received the Revere Award from the Real World Economics Review for being the economist who most cogently warned of the crisis, and whose work is most likely to prevent future crises.\n      \n\n\nThe .mp3 in the torrent is extracted audio from the Press TV video. You can watch the video here: http://www.presstv.com/Program/230935.html \n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n\n It is my opinion that in this time it is virtually\n essential to seek information from a variety of sources, \n to listen to a spectrum of voices in order to better \n understand the &quot;big picture.&quot; A reliance solely upon\n mainstream corporate media for news and info is a \n prescription for ignorance. I try to share information\n that counters the monotone of mainstream corporate media.\n \n NOTE: The material here is made available strictly as\n information. Do not assume support or endorsement on my\n part of the contents. \n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n\n !! please try some of the other shows I upload too !!\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.","torrent":{"xt":"urn:btih:1ff6b8a0c094323f470b12d0b3e19a0bbb40ebd1","amp;dn":"Max+Keiser+-+On+The+Edge+2012+Mar+09+FR+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ff6b8a0c094323f470b12d0b3e19a0bbb40ebd1","infoHashBuffer":{"type":"Buffer","data":[31,246,184,160,192,148,50,63,71,11,18,208,179,225,154,11,187,64,235,209]},"announce":[],"urlList":[]}}