{"title":"Stop Diabetes Now - William T. Cefalu","uid":9224348,"size":7229864,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ffc1f144e1491334d87a57478b7504bf4be3c63&amp;dn=Stop+Diabetes+Now+-+William+T.+Cefalu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1384985259,"description":"An effective treatment for diabetes based on the latest cutting-edge research.\n\nDespite heightened public awareness, there are 21 million people with diabetes in the United States and studies show that by 2050, this number will double.\n\nLeading diabetes researcher and clinician Dr. William T. Cefalu explains how patients can stop the diabetes epidemic by taking charge of their own health. As Dr. Cefalu argues, patients can manage symptoms effectively and even reverse the disease through aggressive treatment and cutting-edge integrative therapies now available. However, many doctors are not aware of these treatments and do not emphasize the importance of blood sugar control. Stop Diabetes Now arms readers with the most up-to-date information, including:\n\nï¿½ proven nutritional changes that can successfully manage symptoms, with the help of simple recipes;\n\nï¿½ effective blood glucose monitoring guidelines and the latest pain-free monitoring systems;\n\nï¿½ the most current information on pain-free insulin delivery systems; and\n\nï¿½ the latest research on supplements and alternative therapies.\n\nAuthoritative and groundbreaking, Stop Diabetes Now offers new hope to diabetes sufferers with a treatment plan that proves diabetes.","torrent":{"xt":"urn:btih:1ffc1f144e1491334d87a57478b7504bf4be3c63","amp;dn":"Stop+Diabetes+Now+-+William+T.+Cefalu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ffc1f144e1491334d87a57478b7504bf4be3c63","infoHashBuffer":{"type":"Buffer","data":[31,252,31,20,78,20,145,51,77,135,165,116,120,183,80,75,244,190,60,99]},"announce":[],"urlList":[]}}