{"title":"The Oxford Illustrated History of the Crusades (History Ebook)","uid":14192796,"size":90223535,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2023283762824e051340f37d12e051241f7caf3e&amp;dn=The+Oxford+Illustrated+History+of+the+Crusades+%28History+Ebook%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"STBGD","files":1,"time":1459896413,"description":"The Oxford Illustrated History of the Crusades\r\nOxford University Press | 1995 | 0198204353 | English | 476 pages | PDF | 86 MB\r\n\r\nIn The Oxford Illustrated History of the Crusades, the story of the Crusades is told as never before in an engrossing, authoritative, and comprehensive history that ranges from the preaching of the First Crusade in 1095 to the legacy of the crusading ideals and imagery that continues today. Here are the ideas of apologists, propagandists, and poets about the Crusades, as well as the perceptions and motives of the crusaders themselves and the means by which they joined the movement–crusaders were required to &quot;take the cross&quot; (which involved making a vow, often at an emotional public gatherings under the influence of preachers whose business it was to whip their audiences up into a frenzy) and were foresworn to wear a cross on their clothing until they returned from their mission in the East. The authors describe the elaborate social and civic systems that arose to support the Crusades–taxation, for example, was formalized by the Church and monarchs to raise enormous funds needed to wage war on this scale; nearly 1,000,000 livres tournois were raised from the French church (out of estimated total expenses of some 3,000,000 livres) for Louis IX's first crusade in 1248. And here are vivid descriptions of the battles themselves, frightening, disorienting, and dangerous affairs, with keen and insightful commentary on the reactions of the Muslims to a Christian holy war. Extensively illustrated with hundreds of illustrations, maps, chronologies, and a guide to further reading, The Oxford Illustrated History of the Crusades even includes coverage of crusades outside the eastern Mediterranean region and post-medieval crusades","torrent":{"xt":"urn:btih:2023283762824e051340f37d12e051241f7caf3e","amp;dn":"The+Oxford+Illustrated+History+of+the+Crusades+%28History+Ebook%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2023283762824e051340f37d12e051241f7caf3e","infoHashBuffer":{"type":"Buffer","data":[32,35,40,55,98,130,78,5,19,64,243,125,18,224,81,36,31,124,175,62]},"announce":[],"urlList":[]}}