{"title":"Led Zeppelin -1975.03.19 - Vancouver, BC","uid":4018586,"size":1170782988,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:204d3083c0e4b5a8c4d6a9ca46f8e89def079f0d&amp;dn=Led+Zeppelin+-1975.03.19+-+Vancouver%2C+BC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"TimD54","files":22,"time":1202516263,"description":"This week&amp;#039;s selection is a classic performance presented in stunning sound quality.  The discovery known as Snow Jobs: Vancouver 3-19-75. Robert mysteriously asks the crowd &quot;How is Vancouver?  Is it full of beans?&quot; after Over The Hills And Far Away.  Another show known for Plantations, the name of the show itself coming from Percy&amp;#039;s description of Peter Grant as &quot;the man who provides the blow jobs backstage.&quot;  Percy also mentions blowjobs a couple of days before (and after!) this in Seattle (coming later, I promise - wait until you hear what I have for you there) so this is either a preoccupation of Robert&amp;#039;s at the time, or something Peter was doing before shows in 1975 as a way of ensuring premium performances.  Presumably he was providing the sluts, not personally the blowjobs.  Whatever he was doing was working, as Zeppelin plays their ass off in Vancouver, in between two legendary-themselves Seattle shows.  \n\n \n\nI generally don&amp;#039;t select a show unless the sound is of sufficient quality to play in the car with my family, and this show is no exception - it sounds like a soundboard to me, and my discs are labeled as such, and Underground Uprising calls them such, so I&amp;#039;m calling them soundboards too.  And a very clean soundboard with very little hiss and Jonesy way up in the mix where he belongs.  I wonder if this isn&amp;#039;t a monitor mix or something like that, as it&amp;#039;s really very presentable and could have, with a little work, been &quot;How The Fellatio Was Won.&quot;  It&amp;#039;s very enjoyable to hear Jonesy so well, one of the few boots where his creativity and synchronicity with Bonham shines through the usually badly-mixed recording.\n\n \n\nJimmy Page is in fine form - TSRTS and OTHAFA rival the Flying Circus versions, with TSRTS maybe being better, the chiming hammer-on hammer-offs being cleaner and quicker.  Truly nimble on the night, and completely in-synch.  Plant is in very good voice - I&amp;#039;ve heard better, but honestly, between those Seattle shows, not long after MSG and with the Forum coming, he&amp;#039;s as good as you can expect, and The Rain Song is chill-inducing.  That&amp;#039;s a song that&amp;#039;s grown on me over the years, as some of you know.  Jonesy is always spot on, and again it&amp;#039;s nice to hear him for once.  Bonzo is just plain explosive.  The band is on a four-month hot streak from about MSG in February all the way through Earl&amp;#039;s Court in May.  \n\n \n\nThis recording is an absolute must-have.  Led Zeppelin in excellent soundboard quality, on top of their game.  Even Empress Valley couldn&amp;#039;t screw this up.  \n\n\n \n\nSetlist:\n\n \n\nDisc One\n\n \n\nRock and Roll - 4:11\n\nSick Again - 6:21\n\nOver The Hills and Far Away - 8:44\n\nIn My Time Of Dying - 13:10\n\nThe Song Remains The Same - 5:29\n\nThe Rain Song - 9:22\n\nKashmir - 9:08\n\n \n\nDisc Two\n\n \n\nNo Quarter - 25:36\n\nTrampled Underfoot - 9:23\n\nMoby Dick - 22:07\n\n \n\nDisc Three\n\n \n\nDazed And Confused - 41:13\n\nStairway To Heaven - 13:33\n\nWhole Lotta Love - 7:54\n\nBlack Dog - 6:25\n","torrent":{"xt":"urn:btih:204d3083c0e4b5a8c4d6a9ca46f8e89def079f0d","amp;dn":"Led+Zeppelin+-1975.03.19+-+Vancouver%2C+BC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"204d3083c0e4b5a8c4d6a9ca46f8e89def079f0d","infoHashBuffer":{"type":"Buffer","data":[32,77,48,131,192,228,181,168,196,214,169,202,70,248,232,157,239,7,159,13]},"announce":[],"urlList":[]}}