{"title":"Digital Video and HD (2nd Ed)(gnv64)","uid":8224408,"size":38044671,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:20779b4281e8d94ec67efe6f4a73fe9bb5dac62f&amp;dn=Digital+Video+and+HD+%282nd+Ed%29%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1362559068,"description":"Digital Video and HD, Second Edition: Algorithms and Interfaces\nby Charles Poynton\nMorgan Kaufmann | February 2012 | ISBN-10: 0123919266 | PDF | 752 pages | 36.2 mb\n\nDigital Video and HD: Algorithms and Interfaces provides a one-stop shop for the theory and engineering of digital video systems. Equally accessible to video engineers and those working in computer graphics, Charles Poynton's revision to his classic text covers emergent compression systems, including H.264 and VP8/WebM, and augments detailed information on JPEG, DVC, and MPEG-2 systems. This edition also introduces the technical aspects of file-based workflows and outlines the emerging domain of metadata, placing it in the context of digital video processing.\nWith the help of hundreds of high quality technical illustrations, this book presents the following topics:\n* Basic concepts of digitization, sampling, quantization, gamma, and filtering\n* Principles of color science as applied to image capture and display\n* Scanning and coding of SDTV and HDTV\n* Video color coding: luma, chroma (4:2:2 component video, 4fSC composite video)\n* Analog NTSC and PAL\n* Studio systems and interfaces\n* Compression technology, including M-JPEG and MPEG-2\n* Broadcast standards and consumer video equipment\n\nAbout the Author\nCharles Poynton is an independent contractor specializing in digital color imaging systems, including digital video, HDTV, and digital cinema. A Fellow of the Society of Motion Picture and Television Engineers (SMPTE), Poynton was awarded the Society's prestigious David Sarnoff Gold Medal for his work to integrate video technology with computing and communications. Poynton is the author of the widely respected book, A Technical Introduction to Digital Video, published in 1996. Engineers (SMPTE), and in 1994 was awarded the Society's David Sarnoff Gold Medal for his work to integrate video technology with computing and communications. He is also the author of A Technical Introduction to Digital Video.","torrent":{"xt":"urn:btih:20779b4281e8d94ec67efe6f4a73fe9bb5dac62f","amp;dn":"Digital+Video+and+HD+%282nd+Ed%29%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20779b4281e8d94ec67efe6f4a73fe9bb5dac62f","infoHashBuffer":{"type":"Buffer","data":[32,119,155,66,129,232,217,78,198,126,254,111,74,115,254,155,181,218,198,47]},"announce":[],"urlList":[]}}