{"title":"See_Jayne_Play_-_Jami_Denise.epub","uid":9157018,"size":239235,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:20970f93f4dcff879ba3996ca8a75bbcc51b9752&amp;dn=See_Jayne_Play_-_Jami_Denise.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1383794994,"description":": Rayne Morrow trusts no one, sheÎ“Ã‡Ã–s been burnt too many times. All she wants is to lay low and keep her little flower shop open. But too many people owe her big money and refuse to pay up. If she canÎ“Ã‡Ã–t collect soon sheÎ“Ã‡Ã–ll have to close. Golden Towers needs to decorate their building, but Rayne misses her appointment and is immediately suspicious when the Goldens wish to work with her anyway. Especially since she knocked their enforcer, Brock, on his ass just for touching her.\nNeal Golden is growing restless with his job as the corporate accountant and is not too happy with Ryland when he wants Neal to look over the flower shopÎ“Ã‡Ã–s books. He is sent to The Pretty Flower to speak with Rayne with a warning from Ryland not to touch her without her permission. The instant Neal meets the sassy vixen, he knows her for who she is his mate. Rayne is not happy, she doesnÎ“Ã‡Ã–t need or want a man telling her what to do, even a sexy Weretiger. Neal has to go.\nNeal wants his mate and has no qualms about seducing the feisty woman into seeing everything his way. He just has to figure out how to get around her supernatural barrier to touch the woman to earn her trust and eventually her love. Rayne and Bronwyn Golden are alike in many ways: beautiful, powerful, and lethal. Both are hunted by a secret organization for what they can do. These men will stop at nothing to hunt them down and bring them in kill if necessary.\nThe Goldens must band together with a natural enemy, a vampire, to get their women back. Weretiger blood is very seductive to a vampire. Can they work together for a mutual cause? Will they be in time to stop the madmen? Find out in the third installment of the Golden Streak Series Neal. \n","torrent":{"xt":"urn:btih:20970f93f4dcff879ba3996ca8a75bbcc51b9752","amp;dn":"See_Jayne_Play_-_Jami_Denise.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20970f93f4dcff879ba3996ca8a75bbcc51b9752","infoHashBuffer":{"type":"Buffer","data":[32,151,15,147,244,220,255,135,155,163,153,108,168,167,91,188,197,27,151,82]},"announce":[],"urlList":[]}}