{"title":"Shadow Watch (GOG)","uid":12582810,"size":437143483,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:20e33eac0c330176c68143083231df9273e9c62f&amp;dn=Shadow+Watch+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mercs215","files":3,"time":1444972364,"description":"Install instructions:\r\n- Run &quot;setup_shadow_watch_2.0.0.2.exe&quot;\r\n- Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nTitle: SHADOW WATCH\r\nGenre: Strategy - Turn-based - Tactical\r\nWorks on: Windows (XP, Vista, 7, 8, 10)\r\nLanguages: Audio and text: English\r\nModes: Single-player\r\nReleased: March 31, 2000\r\nSize: 415.5 MB\r\nCompany: Red Storm Entertainment / Ubisoft\r\nRating:\tESRB Rating: Teen (with Animated Violence)\r\nStore page: http://www.gog.com/game/shadow_watch\r\n\r\nAbout:\r\nCongratulations, soldier. You've been recruited to lead an elite corporate commando squad. As chief of security, it's your job to stop a deadly plot to destroy the construction of the world's first international space station. There's no end to the adventure, or the danger, when you step into the shadows...\r\nShadow Watch is a turn-based, isometric game of stealth, intrigue and combat. You have been given command of a team of six highly trained operatives with orders to find out who is behind the attacks against those working on the ISS.\r\nThe game consists of a campaign as well as customizable individual missions. The campaign can be played over and over again without it ever being the same.\r\nShadow Watch takes place in three different settings: Baikonur, Rio de Janeiro and Hong Kong. At each locale, you must talk to various contacts to determine what is going on and then solve the problem through a series of missions. These missions can have a variety of objectives including planting surveillance devices at a location, rescuing a hostage, defending a building, demolishing a building and much more.\r\nAs each mission is completed, the characters in your team gain experience. This allows them to learn new skills, which can make them more effective during future missions. Once the problem at one of the settings is solved, you continue on to the next two before undertaking a final mission to complete the campaign. Shadow Watch is a quick, but engrossing game, which is easy to learn and can be replayed time and time again.\r\nInvestigation: Reconnaissance into the most isolated corners of the globe.\r\nTraining: Learn skills before you launch each deadly mission.\r\nConversation: Interrogate shady locals and underworld contacts.\r\nCombat: Match your team against international adversaries in straight-on combat.\r\n\r\nMinimum system requirements - Windows: Windows XP / Vista / 7 / 8 / 10\r\nProcessor: 1.8 GHz Processor\r\nMemory: 512MB RAM (1 GB recommended)\r\nGraphics: 3D graphics card compatible with DirectX 7 (compatible with DirectX 9 recommended)\r\nHard Drive: 2GB HDD\r\nMouse, Keyboard","torrent":{"xt":"urn:btih:20e33eac0c330176c68143083231df9273e9c62f","amp;dn":"Shadow+Watch+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20e33eac0c330176c68143083231df9273e9c62f","infoHashBuffer":{"type":"Buffer","data":[32,227,62,172,12,51,1,118,198,129,67,8,50,49,223,146,115,233,198,47]},"announce":[],"urlList":[]}}