{"title":"In the Studio With Redbeard Full Site Rip *UPDATED 2013-11-05*","uid":9150870,"size":6816287892,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:219c568eb3ca5319a70b729c0d1132fd51c45047&amp;dn=In+the+Studio+With+Redbeard+Full+Site+Rip+%2AUPDATED+2013-11-05%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"NotHuman","files":-1,"time":1383689519,"description":"**UPDATE 2013-11-05** I noticed there was a problem with inconsistent &quot;Album Artist&quot; tags in the first torrent, which will wreak havoc with the certain media players (i.e. Google Play).  I corrected this problem, and have also added all of the shows that have been uploaded to the site since I made the first torrent in April.  There are 78 new MP3s, so even if you got the first torrent you should snag this one.\n\nThis torrent is a complete audio rip of the website In the Studio with Redbeard (http://www.inthestudio.net/). It contains all the MP3s streaming on the website as of November 5th, 2013. \n\nRedbeard has been a rock radio personality since the 1970s. For over four decades, he has conducted in-depth interviews with legends of rock on his nationally syndicated show &quot;In the Studio with Redbeard.&quot; Each interview focuses on a specific album or subject, and most run about 20 minutes in length (some have multiple parts). \n\nThe torrent is broken up into three sections: In the Studio radio interviews, online exclusive interviews (these were not broadcast on the radio show and only available on the website), and live tracks (these include in-studio and live performances from a variety of artists). \n\nIf you are a fan of rock music and like hearing interviews from the musicians about the creation of the albums, and behind-the-scenes stories, I highly recommend downloading this torrent.  There's hours and hours of interesting conversation here to keep you captivated for a very long time. I haven't seen this offered anywhere else, and I wrote a custom program just to be able to download the files. So it's something you can't get anywhere else. \n\nThere are 366 MP3s in total. All tracks are encoded at 128kbps and downloaded unaltered from the site, aided by a custom Java script using the excellent library jsoup. All files are fully tagged with consistent filenames, and are tidy and well-organized. Click the number next to Files above to see a complete list of files in this torrent.","torrent":{"xt":"urn:btih:219c568eb3ca5319a70b729c0d1132fd51c45047","amp;dn":"In+the+Studio+With+Redbeard+Full+Site+Rip+%2AUPDATED+2013-11-05%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"219c568eb3ca5319a70b729c0d1132fd51c45047","infoHashBuffer":{"type":"Buffer","data":[33,156,86,142,179,202,83,25,167,11,114,156,13,17,50,253,81,196,80,71]},"announce":[],"urlList":[]}}