{"title":"DbookstempPackt.-.Android.Application.Testing.Guide.2011.RETAiL.","uid":8857751,"size":10604806,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2356cb81707f5eb42ef1ed6c10b069b07aa44568&amp;dn=DbookstempPackt.-.Android.Application.Testing.Guide.2011.RETAiL.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"poohtbear","files":1,"time":1377702135,"description":"\n\nIt doesn't matter how much time you invest in Android design, or even how careful you are when programming; mistakes are inevitable and bugs will appear. This book will help you minimize the impact of these errors in your Android project and increase your development productivity. It will show you the problems that are easily avoided, to help get you quickly to the testing stage.\n\nAndroid Application Testing Guide is the first and only book providing a practical introduction to the most common available techniques, frameworks, and tools to improve the development of your Android applications. Clear, step-by-step instructions show how to write tests for your applications and assure quality control using various methodologies.\n\nThe author's experience in applying application testing techniques to real world projects enables him to share insights on creating professional Android applications.\n\nThe book starts by introducing Test Driven Development, which is an agile component of the software development process and a technique where you will tackle bugs early on. From the most basic unit tests applied to a sample project to more sophisticated performance tests, this book provides a detailed description of the most widely used techniques in the Android testing world in a recipe-based approach.\n\nThe author has extensive experience of working on various development projects throughout his professional career. All this research and knowledge has helped create a book that will serve as a useful resource to any developer navigating the world of Android testing.","torrent":{"xt":"urn:btih:2356cb81707f5eb42ef1ed6c10b069b07aa44568","amp;dn":"DbookstempPackt.-.Android.Application.Testing.Guide.2011.RETAiL.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2356cb81707f5eb42ef1ed6c10b069b07aa44568","infoHashBuffer":{"type":"Buffer","data":[35,86,203,129,112,127,94,180,46,241,237,108,16,176,105,176,122,164,69,104]},"announce":[],"urlList":[]}}