{"title":"Top.Wet.Girls.9.XXX.DVDRip.XviD-Jiggly","uid":7887772,"size":2193275642,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:24e7637591e770e249608cc97dd9dea5155fed77&amp;dn=Top.Wet.Girls.9.XXX.DVDRip.XviD-Jiggly&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"R0thschild","files":5,"time":1354655732,"description":"Gallery: \n &lt;a href=&quot;\nhttp://imagedomino.com/?g=764386&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imagedomino.com/?g=764386&lt;/a&gt;\n\nChristoph Clark Immerses Europe's Nastiest XXX Models In Sultry All-Girl Trysts With Graphic Anal Gaping. Features Stunning Tarra White!The French minister of girl-on-girl lust, Monsieur Christoph Clark, presents a new masterpiece of nasty lesbian love. Top Wet Girls 9 stars glammed-up international bitches in hard, sensual action, getting off without a single cock in sight! Watch these classy dames please each other's most intimate areas using tongues, fingers and toys. Mega-slut Tarra White, sporting long red hair, diddles herself on the bathroom counter, then enjoys a juicy ass-licking party with sultry, fishnet-wearing brunette Elisa.Smoking brunette Ally Style twists around a stripper pole with luscious porn veteran Szilvia Lauren, who shoves four fingers deep up Ally's young ass 'til it's gaping wide. Three horny ladies - womanly redhead Brooke Summer, sleek, tall Melissa Ria and soft, nubile Lucybell each tease the camera in separate solo masturbation scenes, then join together on the bed to play with dildos and anal beads.Pigtailed Morgan Moon and her girlfriend, Roxy Taggart, ream out each other's ass with a big rubber phallus, and super-sexy models Lena Cova and Carla Cox do some very unladylike things with their mouths and some plastic dicks, while dolled up in sheer stockings and high heels. It's all glamorous, all-girl, and all anal! Who needs a man, anyhow?","torrent":{"xt":"urn:btih:24e7637591e770e249608cc97dd9dea5155fed77","amp;dn":"Top.Wet.Girls.9.XXX.DVDRip.XviD-Jiggly","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24e7637591e770e249608cc97dd9dea5155fed77","infoHashBuffer":{"type":"Buffer","data":[36,231,99,117,145,231,112,226,73,96,140,201,125,217,222,165,21,95,237,119]},"announce":[],"urlList":[]}}