{"title":"Species DVD5 NTSC BGSub 1995 - MAGNET","uid":8778142,"size":3978242947,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:26104e45ce486af5d25740d046775db37bc654fd&amp;dn=Species+DVD5+NTSC+BGSub+1995+-+MAGNET&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kPulsate","files":19,"time":1375612840,"description":"Species\n\nDirector: Roger Donaldson\n\nCast: Ben Kingsley, Michael Madsen, Alfred Molina, Forest Whitaker, Marg Helgenberger, Natasha Henstridge, Caroline Barclay, Patricia Belcher\n\n\nGenre: Science Fiction &amp; Fantasy\n\nVideo: NTSC - 720/480@854/480\n\nAudio: English, French, Spanish\n\nSub: Bulgarian, French, Spanish\n\nPlot:Fine special effects, eclectic casting, and the freeze-frame-worthy, clothing-free debut of a blonde bombshell made this cheesy science fiction/horror hybrid a cut above its B-grade roots. At a top-secret Utah facility headed up by Dr. Xavier Fitch (Ben Kingsley), scientists have created &quot;Sil&quot; (Natasha Henstridge), a half-human, half-alien product of experiments with DNA codes obtained from beyond the stars. Unfortunately, Sil has escaped. Her primary objective is to mate, and, with the ability to transform herself into an incredibly powerful alien creature, puny humans can't stop her. So Dr. Fitch calls in a quartet of specialists (Forest Whitaker, Michael Madsen, Marg Helgenberger, and Alfred Molina), to attempt Sil's capture. At the same time, Sil is leaving a trail of mostly male corpses in her hormonal wake. The organic-flavored alien designs for Species were provided by H.R. Giger, the artist responsible for the memorable creatures and spaceships of Alien (1979). When MGM decided to cut the spectacular &quot;train birth&quot; sequence in the interest of budget-trimming, Giger personally financed this $100,000 showcase of his work. Those who look closely will notice that &quot;Young Sil&quot; is played by future Dawson's Creek star Michelle Williams\n","torrent":{"xt":"urn:btih:26104e45ce486af5d25740d046775db37bc654fd","amp;dn":"Species+DVD5+NTSC+BGSub+1995+-+MAGNET","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26104e45ce486af5d25740d046775db37bc654fd","infoHashBuffer":{"type":"Buffer","data":[38,16,78,69,206,72,106,245,210,87,64,208,70,119,93,179,123,198,84,253]},"announce":[],"urlList":[]}}