{"title":"Audible Rip - Robert Reid - Year Zero (Unb)","uid":9132701,"size":196952078,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:266f9ae6d6fc8ba0e281cde9ed7240c3bf0f6650&amp;dn=Audible+Rip+-+Robert+Reid+-+Year+Zero+%28Unb%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"brianleb","files":34,"time":1383353515,"description":"Rob Reid's background as the founder of Rhapsody makes this a particularly interesting novel because you know he's not just making up how the music industry works (in Washington, at least). If you like the book, support the author. The book is read by John Hodgman, which is what turned me on to it in the first place. \n &lt;a href=&quot;\nhttp://www.audible.com/pd/Fiction/Year-Zero-Audiobook/B008CGS0WO&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.audible.com/pd/Fiction/Year-Zero-Audiobook/B008CGS0WO&lt;/a&gt;\n\n\nPublisher's Summary\n\nAn alien advance party was suddenly nosing around my planet.\n\nWorse, they were lawyering up....\n\nIn the hilarious tradition of The Hitchhiker's Guide to the Galaxy, Rob Reid takes you on a headlong journey through the outer reaches of the universe - and the inner workings of our absurdly dysfunctional music industry.\n\nLow-level entertainment lawyer Nick Carter thinks it's a prank, not an alien encounter, when a redheaded mullah and a curvaceous nun show up at his office. But Frampton and Carly are highly advanced (if bumbling) extraterrestrials. And boy, do they have news.\n\nThe entire cosmos, they tell him, has been hopelessly hooked on humanity's music ever since &quot;Year Zero&quot; (1977 to us), when American pop songs first reached alien ears. This addiction has driven a vast intergalactic society to commit the biggest copyright violation since the Big Bang. The resulting fines and penalties have bankrupted the whole universe. We humans suddenly own everything - and the aliens are not amused.\n\nNick Carter has just been tapped to clean up this mess before things get ugly, and he's an unlikely galaxy-hopping hero: He's scared of heights. He's also about to be fired. And he happens to have the same name as a Backstreet Boy. But he does know a thing or two about copyright law. And he's packing a couple of other pencil-pushing superpowers that could come in handy.\n\nSoon he's on the run from a sinister parrot and a highly combustible vacuum cleaner. With Carly and Frampton as his guides, Nick now has 48 hours to save humanity, while hopefully wowing the hot girl who lives down the hall from him.\n\nÂ©2012 Robert Reid (P)2012 Random House Audio\nWhat the Critics Say\n\n&quot;Can you imagine The Hitchhiker's Guide to the Galaxy combined with The Social Network? Of course you cannot: because only Rob Reid can. Hilarious, provocative, and supersmart, Year Zero is not merely the first IPSF (intellectual property SF) epic ever written, it is also a plain brilliant novel to be enjoyed in perpetuity, in the known universe and all unknown universes yet to be discovered.&quot; (John Hodgman, resident expert, The Daily Show with Jon Stewart)\n\n&quot;Year Zero is a brilliant satire of the American entertainment industry, and I never stopped grinning.&quot; (Kevin Hearne, author of The Iron Druid Chronicles)\n\n&quot;This book is already required reading on all of the educated planets in the universe, and now they're letting us Earthlings have a look at it, too. There are at least 3.6 good jokes and 9.7 clever ideas per page. I did the math: that's a really impressive ratio. I never thought I would say this, but this book made me laugh out loud and taught me stuff about copyright infringement. Clever, smart, and so original that people are probably already trying to rip it off. (Charles Yu, author of How to Live Safely in a Science Fictional Universe)\n","torrent":{"xt":"urn:btih:266f9ae6d6fc8ba0e281cde9ed7240c3bf0f6650","amp;dn":"Audible+Rip+-+Robert+Reid+-+Year+Zero+%28Unb%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"266f9ae6d6fc8ba0e281cde9ed7240c3bf0f6650","infoHashBuffer":{"type":"Buffer","data":[38,111,154,230,214,252,139,160,226,129,205,233,237,114,64,195,191,15,102,80]},"announce":[],"urlList":[]}}