{"title":"Curse of the Golden Flower(Subs Dutch)(2Lions-Team)","uid":5427353,"size":4681805792,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2896ff3c80b6eaea3b0c1b1f9c324730a1d3c99b&amp;dn=Curse+of+the+Golden+Flower%28Subs+Dutch%29%282Lions-Team%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JUULTJE","files":-1,"time":1268303253,"description":"Man Cheng Jin Dai Huang Jin Jia (2006)\n\nAlternatieve titel: Curse of the Golden Flower \n\n\nHongkong / China\nDrama / Actie\n114 minuten\n\ngeregisseerd door Yimou Zhang\nmet Jay Chou, Li Gong en Yun-Fat Chow\n\nChina, 928 AD Tang Dynastie. De genadeloze Keizer Ping keert onverwachts terug naar het paleis met zijn tweede zoon, Prins Jai, om de Chong Yang feest te vieren met zijn familie. Echter de hechtheid van de koninklijke familie, en zodoende die van het keizerrijk, staat zwaar onder druk. De relatie tussen de Keizer en Keizerin Phoenix, die aan een mysterieuze ziekte lijdt, is al jaren geleden bekoeld. Ondertussen heeft zij een geheime relatie met Kroonprins Wan, haar stiefzoon, terwijl hijzelf droomt van een andere vrouw. Echter, zoals een koninklijke familie betaamt, is uiterlijke schijn alles. Maar niets is wat het lijkt, als donkere geheimen langzaam maar zeker hun weg naar boven vinden.\n\nEngels\n\nChina, Later Tang Dynasty, 10th Century. On the eve of the Chong Yang Festival, golden flowers fill the Imperial Palace. The Emperor (Chow Yun Fat) returns unexpectedly with his second son, Prince Jai (Jay Chou). His pretext is to celebrate the holiday with his family, but given the chilled relations between the Emperor and the ailing Empress (Gong Li), this seems disingenuous. For many years, the Empress and Crown Prince Wan (Liu Ye), her stepson, have had an illicit liaison. Feeling trapped, Prince Wan dreams of escaping the palace with his secret love Chan (Li Man), the Imperial Doctor's daughter. Meanwhile, Prince Jai, the faithful son, grows worried over the Empress's health and her obsession with golden chrysanthemums. Could she be headed down an ominous path? The Emperor harbors equally clandestine plans; the Imperial Doctor (Ni Dahong) is the only one privy to his machinations. When the Emperor senses a looming threat, he relocates the doctor's family from the Palace to a remote area. While they are en route, mysterious assassins attack them. Chan and her mother, Jiang Shi (Chen Jin) are forced back to the palace. Their return sets off a tumultuous sequence of dark surprises. Amid the glamour and grandeur of the festival, ugly secrets are revealed. As the Imperial Family continues its elaborate charade in a palatial setting, thousands of golden armored warriors charge the palace. Who is behind this brutal rebellion? Where do Prince Jai's loyalties lie? Between love and desire, is there a final winner? Against a moonlit night, thousands of chrysanthemum blossoms are trampled as blood spills across the Imperial Palace.\n\n\nWeblink http://www.moviemeter.nl/film/38080\nWeblink http://www.imdb.com/title/tt0473444/\n\n\nVideo                 : DVD RIP\nAudio                 : AC 3 5-1 Chinese  Engels\nDTS                   : 5-ch Chinese\nSubs                  : Nederlands\nID                    : 0xE0\nFormat                : MPEG Video\nFormat version        : Version 2\nBit rate mode         : Variable\nWidth                 : 720 pixels\nHeight                : 576 pixels\nDisplay aspect ratio  : 4:3\nFrame rate            : 25.000 fps\nStandard              : PAL\nCover                 : Yes\nBreedbeeld geschikt voor alle beeldformaten\n\n*****************************************\n\nBrought to you by Juultje\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n                         &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\t\t\n\n\n\n\n","torrent":{"xt":"urn:btih:2896ff3c80b6eaea3b0c1b1f9c324730a1d3c99b","amp;dn":"Curse+of+the+Golden+Flower%28Subs+Dutch%29%282Lions-Team%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2896ff3c80b6eaea3b0c1b1f9c324730a1d3c99b","infoHashBuffer":{"type":"Buffer","data":[40,150,255,60,128,182,234,234,59,12,27,31,156,50,71,48,161,211,201,155]},"announce":[],"urlList":[]}}