{"title":"Guy Wolff Master Potter in the Garden Suzanne Staubach C4dR","uid":15241878,"size":4588002,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:28fe51c68546747645c3e317fd849b51ac7e9805&amp;dn=Guy+Wolff+Master+Potter+in+the+Garden+Suzanne+Staubach+C4dR&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shailab","files":3,"time":1467957946,"description":"Link - https://www.amazon/Guy-Wolff-Master-Potter-Garden/dp/1611683661\r\n\r\nGuy Wolff: Master Potter in the Garden Paperback – July 9, 2013\r\nby Suzanne Staubach  (Author), Joseph Szalay (Photographer), Val Cushing (Contributor), Tovah Martin\r\n\r\nProduct Details\r\n160 pages\r\nPublisher: UPNE (July 9, 2013)\r\nLanguage: English\r\nISBN-10: 1611683661\r\nISBN-13: 978-1611683660\r\n\r\nIf you mention Guy Wolff to a serious gardener, that gardener will almost certainly admit to either owning a Guy Wolff flowerpot or coveting one. Wolff’s pots—some small and perfect for a sunny windowsill, others massive and just right for a favorite outdoor spot—are widely considered to be the epitome of gardenware. Their classical proportions, simple decoration, and the marks of Wolff’s hands all combine to make plants look their best. His pots possess an honesty and liveliness that machine-made flowerpots lack.\r\n\r\nWolff is probably the best-known potter working in the United States today. In gardening circles, he is a highly revered horticultural icon; gardeners flock to his lectures and demonstrations. His work also appeals to lovers of design and fine arts: visit the personal gardens of landscape designers, and you will see Guy Wolff pots. Step inside the gates of estate gardens, and you will see Guy Wolff pots. Yet he is a potter’s potter. He’s a big ware thrower, a skill few have today. He thinks deeply about what he calls the architecture of pots and the importance of handmade objects in our lives.\r\n\r\nWhether you are a longtime collector of Wolff’s pots, anxious to buy your first one, or simply intrigued by the beauty and practicality of hand-crafted goods in our fast-paced era, you’ll want to add this richly illustrated book to your library.\r\n\r\n\r\nKAT - C4dr\r\nTBP - shailab\r\n\r\nBTC - 1CZ4nTozpgfgqufWhiXDtBu9pVurd41SPz","torrent":{"xt":"urn:btih:28fe51c68546747645c3e317fd849b51ac7e9805","amp;dn":"Guy+Wolff+Master+Potter+in+the+Garden+Suzanne+Staubach+C4dR","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28fe51c68546747645c3e317fd849b51ac7e9805","infoHashBuffer":{"type":"Buffer","data":[40,254,81,198,133,70,116,118,69,195,227,23,253,132,155,81,172,126,152,5]},"announce":[],"urlList":[]}}