{"title":"True Blood - Seasons 5 - 7","uid":15543449,"size":7638240943,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:29e8781210ab9fd13cf13c54b097e90ddc3f2add&amp;dn=True+Blood+-+Seasons+5+-+7&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"POtHS11","files":37,"time":1470945810,"description":"True Blood - Seasons 5 thru 7\r\n\r\nThe fictional universe depicted in the series is premised on the notion that vampires exist, unbeknownst to the majority of humans until two years before the series premiere, when the creation of synthetic blood (&quot;Tru Blood&quot;) by Japanese scientists, which eliminated vampires' need for human blood to survive, allowed vampires to &quot;come out of the coffin&quot; and reveal their existence to the world.E-1 This so-called &quot;Great Revelation&quot; has split vampires into two camps: those who wish to integrate into human society (i.e., &quot;mainstream&quot;) by campaigning for citizenship and equal rights,E-1 and those who think human-vampire co-existence is impossible, because it conflicts with the inherently violent nature of vampires. Throughout the series, other supernatural creatures are introduced, among them shapeshifters, werewolves, faeries, witches, and a maenad.\r\n\r\nThe series revolves around Sookie Stackhouse (Anna Paquin), a telepathic human-faerie hybrid known as a halfling (not to be confused with similarly named, but unrelated creatures found in other fantasy works). Sookie is a waitress at Merlotte's Bar and Grill, owned by Sam Merlotte (Sam Trammell) in the small Louisiana town of Bon Temps. Sam is a shapeshifter, though this secret is kept hidden from most of the town. Other characters include Bill Compton (Stephen Moyer), a 173-year-old vampire who has returned to Bon Temps to take up residence in his former home following the death of his last remaining relative; Tara Thornton (Rutina Wesley), Sookie's tough-talking but insecure best friend; Jason (Ryan Kwanten), Sookie's womanizing brother; Eric Northman (Alexander Skarsgård), a 1000-year-old vampire and Sheriff of Area 5; and Lafayette Reynolds (Nelsan Ellis), a short order cook, drug dealer, road crew member, and medium.\r\n\r\nThe show explores several contemporary issues such as the struggle for equal rights, discrimination and violence against minorities and homosexuals, the problems of drug addiction, the power of faith and religion, the control/influence of the media, the quest for identity, and the importance of family","torrent":{"xt":"urn:btih:29e8781210ab9fd13cf13c54b097e90ddc3f2add","amp;dn":"True+Blood+-+Seasons+5+-+7","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29e8781210ab9fd13cf13c54b097e90ddc3f2add","infoHashBuffer":{"type":"Buffer","data":[41,232,120,18,16,171,159,209,60,241,60,84,176,151,233,13,220,63,42,221]},"announce":[],"urlList":[]}}