{"title":"Face.2004.DVDRip.XviD-GaMo [koreanmovies]","uid":3459996,"size":734795991,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2a22ea0d461410ae95e2c280828cda55c67682e0&amp;dn=Face.2004.DVDRip.XviD-GaMo+%5Bkoreanmovies%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"koreanmovies","files":3,"time":1142815328,"description":"Plot:\nHyun-min (Shin Hyun-jun) works for the police, reconstructing faces by examining and interpreting their skulls. His daughter undergoes a heart transplant, and as her condition deteriorates, he loses his interest in his job. Hyun-min suspects that his daughters illness after the operation is caused by the heart, although her doctor, Dr. Yoon, tell him that his daughter is experiencing only minor complications. Distraught, Hyun-min quits his job to care for his duaghter full time. Meanwhile, the police are dealing with a series of bizarre murder cases, where the victim has had all their flesh dissolved away with acid, leaving only the bones behind. Sun-young (Song Yoon-ah) brings the skull of the fourth victim to Hyun-min, hoping that he&amp;#039;ll be able to reconstruct the face. With the skull in their house, his daughter begins to experience visions of a distraught woman in a white robe. Hyun-min reconstructs the face of the victim, and it soon transpires that they all suffered from a (fictitious) affliction known as &amp;#039;beta-allergy&amp;#039;. Tests reveal that Hyun-min&amp;#039;s daughter has the condition, meaning that she has received the heart of someone who did. Romance blossoms between Hynu-min and Sun-young, and as they investigate, they uncover an organ transplant conspiracy - the murder victims were killed for their body parts, and it becomes apparent that Dr. Yoon knows more than he&amp;#039;s letting on.\n\n\nUse VLC to view this movie (with subs): http://www.videolan.org\n\nLiked this? Then make sure you upload at least as much as you download of it!\n\nYou want more korean movies? Search for KOREANMOVIES.\nYou want more asian movies? Search for ASIANTORRENTS.\t","torrent":{"xt":"urn:btih:2a22ea0d461410ae95e2c280828cda55c67682e0","amp;dn":"Face.2004.DVDRip.XviD-GaMo+%5Bkoreanmovies%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a22ea0d461410ae95e2c280828cda55c67682e0","infoHashBuffer":{"type":"Buffer","data":[42,34,234,13,70,20,16,174,149,226,194,128,130,140,218,85,198,118,130,224]},"announce":[],"urlList":[]}}