{"title":"Kate Bush - Lionheart (1978) [EAC-LAME 320kbps]","uid":4641690,"size":88723824,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2ac81c7ca3700c517e483de7b33ad8ff6ccf61bb&amp;dn=Kate+Bush+-+Lionheart+%281978%29+%5BEAC-LAME+320kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"h_benotto","files":10,"time":1231737155,"description":"Proving that the English admired Kate Bush's work, 1978's Lionheart album managed to reach the number six spot in her homeland while failing to make a substantial impact in North America. The single &quot;Hammer Horror&quot; went to number 44 on the U.K. singles chart, but the remaining tracks from the album spin, leap, and pirouette with Bush's vocal dramatics, most of them dissipating into a mist rather than hovering around long enough to be memorable. Her fairytale essence wraps itself around tracks like &quot;In Search of Peter Pan,&quot; &quot;Kashka From Baghdad,&quot; and &quot;Oh England My Lionheart,&quot; but unravels before any substance can be heard. &quot;Wow&quot; does the best job at expressing her voice as it waves and flutters through the chorus, with a melody that shimmers in a peculiar but compatible manner. Some of the tracks, such as &quot;Coffee Homeground&quot; or &quot;In the Warm Room,&quot; bask in their own subtle obscurity, a trait that Bush improved upon later in her career but couldn't secure on this album. Lionheart acts as a gauge more than a complete album, as Bush is trying to see how many different ways she can sound vocally colorful, even enigmatic, rather than focus on her material's content and fluidity. Hearing Lionheart after listening to Never for Ever or The Dreaming album, it's apparent how quickly Bush had progressed both vocally and in her writing in such a short time. ","torrent":{"xt":"urn:btih:2ac81c7ca3700c517e483de7b33ad8ff6ccf61bb","amp;dn":"Kate+Bush+-+Lionheart+%281978%29+%5BEAC-LAME+320kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ac81c7ca3700c517e483de7b33ad8ff6ccf61bb","infoHashBuffer":{"type":"Buffer","data":[42,200,28,124,163,112,12,81,126,72,61,231,179,58,216,255,108,207,97,187]},"announce":[],"urlList":[]}}