{"title":"Fight to the Death: Battle of Guadalcanal (Graphic History)","uid":11360663,"size":13314800,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2acacb4fb32b8c86278dbafb105fd865bb8d4e67&amp;dn=Fight+to+the+Death%3A+Battle+of+Guadalcanal+%28Graphic+History%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":-1,"time":1414993178,"description":"The battle of Guadalcanal brutally shattered the myth of Japanese invincibility. August 7, 1942, marked the first American amphibious assault of World War II, and the first attempt to secure the Japanese-controled island of Guadalcanal. Over 30,000 American and Japanese casualties were suffered during five months of some of the war's most vicious fighting.\n\nFrom the ranks of the units that contested this campaign a seasoned fighting force of US veterans was created that, island by island, would sweep the Japanese back across the Pacific. The US Marines and Army halted the apparently unconquerable Japanese advance in its tracks.\n\nThis full-color comic book includes further reading, essential information on the background, aftermath and key players of the conflict. Its gripping comic strip narrative places the reader at the heart of the action, providing a thrilling account of the arduous struggle that faced soldiers such as valiant Medal of Honor winner Captain Joe Foss, and illustrates the Allies' first major offensive action of the Pacific War","torrent":{"xt":"urn:btih:2acacb4fb32b8c86278dbafb105fd865bb8d4e67","amp;dn":"Fight+to+the+Death%3A+Battle+of+Guadalcanal+%28Graphic+History%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2acacb4fb32b8c86278dbafb105fd865bb8d4e67","infoHashBuffer":{"type":"Buffer","data":[42,202,203,79,179,43,140,134,39,141,186,251,16,95,216,101,187,141,78,103]},"announce":[],"urlList":[]}}