{"title":"Infernal Restraint------ Made up Sarah Jane Ceylon","uid":5384857,"size":444398616,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2b288aa8ba8a7d2847b3e54f91cac97ec002745d&amp;dn=Infernal+Restraint------+Made+up+Sarah+Jane+Ceylon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":136,"time":1266856998,"description":" MADE UP Featuring Sarah Jane Ceylon   + Pics\n\n(Posted: December 11, 2009)  \n      \nsarah jane has never dealt with the likes of Sister Dee before. Things like &quot;dignity&quot; go right out the window when you're her bitch. sarah jane learns it pretty quickly though. The dumb cunt thinks that Damon and Dee are going to let her out of her cage for a stupid thing like needing to piss. That's what buckets are for and she isn't even allowed to pull down her pants before she gets pee all over herself.\n\nSister Dee uses a set of weighted clamps to pinch down on sarah jane's pussy. her new set of balls makes it get sensitive and wet. Dee has no problem sliding a couple fingers into her snatch. she doesn't really start to moan like a slut until Dee is knuckle deep in her ass hole, though. Pleasure doesn't distract her from the task at hand. While Dee vibrates her clit sarah jane manages to jerk off PD AND deep throat Mr. Pogo. she even remembers to beg like a bitch when she wants to cum. she is allowed an orgasm that she screams out through the rubber cock in her mouth.\n\nWhen Dee decides she really wants to hear her little slut scream the vibrator isn't her tool of choice. Instead, to get the really great sounds, Dee puts and inflatable plug up sarah jane's ass and begins pumping it full. It's a completely different scream than cumming but it is no less satisfying for Dee. The same can be said once Dee gets her feet into a set of stocks. They present the perfect target for caning and SD and PD take full advantage. she maintains her composure through the caning but a few shocks from the violet wand and she screams so loud that they have to gag her. The pain must really get her pussy hot, though, because as soon as the distractions are gone sarah jane is begging for permission to cum again. They let her, but not until after they slide a plastic bag over her head. With it each gasp brings a new level of intensity to her orgasm \n\n\nScreens &lt;a href=&quot; http://www.infernalrestraints.com/pages/full1.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.infernalrestraints.com/pages/full1.php&lt;/a&gt;\n\nCheers  :-)","torrent":{"xt":"urn:btih:2b288aa8ba8a7d2847b3e54f91cac97ec002745d","amp;dn":"Infernal+Restraint------+Made+up+Sarah+Jane+Ceylon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b288aa8ba8a7d2847b3e54f91cac97ec002745d","infoHashBuffer":{"type":"Buffer","data":[43,40,138,168,186,138,125,40,71,179,229,79,145,202,201,126,192,2,116,93]},"announce":[],"urlList":[]}}