{"title":"North vs South 3.4.0f5","uid":7445150,"size":57815694,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:2b9d705ce85302d084f705e1c23cf52be3156b6c&amp;dn=North+vs+South+3.4.0f5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"openarena","files":-1,"time":1342347395,"description":"In the colorful strategy game NORTH vs SOUTH, you play the head of one of the armies of the Civil War. Your aim is to conquer American territory. This is a remastered version of the game that was released in 1990, with improved graphics and user-friendliness that are up to current standards.\n\nHead up the Yankees or Confederates, and destroy your enemy! Taking up positions, capturing states, assaulting and capturing enemy forts, attacking trains and protecting your railroads . . . you'll have to deal with everything! Capture the port to use the reinforcements coming from Europe.\n\nProtect yourself from storms and be wary of those Indians in the war and those Mexican bandits . . . if you don't, you'll be in trouble!\n\nTo come out in one piece, you'll have to master taking turns, armed battles in real time, 1 against 30 shoot-outs, and horseback train chases.\n\nWhether you play alone or with others, the objective is the same - emerge victorious from these eventful combats!\n\nFeatures\n\nThis cult game from 1990 has been remastered with excellent graphics and is more user friendly.\nRelive the Civil War in the universe of the Blue Tunics\nDynamic and strategic battles\nSeveral mini games that vary the tempo of the battles (real-time battles, train attacks, fort assaults . . . )\nParameters you can change to your liking! Calm or savagery?\n\nREQS\nMac OS X 10.4 or higher\nIntel processor\nRAM: 256 MB","torrent":{"xt":"urn:btih:2b9d705ce85302d084f705e1c23cf52be3156b6c","amp;dn":"North+vs+South+3.4.0f5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b9d705ce85302d084f705e1c23cf52be3156b6c","infoHashBuffer":{"type":"Buffer","data":[43,157,112,92,232,83,2,208,132,247,5,225,194,60,245,43,227,21,107,108]},"announce":[],"urlList":[]}}