{"title":"Ys.II.Chronicles.Plus-RELOADED","uid":8144281,"size":1438701059,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2ca2f418fe545202d62a748ac3ff1ddb3a4743da&amp;dn=Ys.II.Chronicles.Plus-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mr.Stifmeister","files":-1,"time":1360871890,"description":"\nnERv\n\nYs I &amp; II Chronicles (c) XSEED\n\n02/2013 :..... RELEASE.DATE .. PROTECTION .......: Steam\n1 :.......... DISC(S) .. GAME.TYPE ........: Action, RPG\n\nNote: packed seperately, because that's how Steam delivered them\n\nLong, long ago, there was an ancient kingdom called Ys which prospered under\nthe auspices of two heavenly Goddesses. Over time, the kingdom came to be\nknown as Esteria, and its divine history was largely forgotten by all but the\ndescendants of those who once preached the Goddesses' will. The only reminder\nof this lost lore was a cursed spire at the foot of a giant crater, which\nlocals came to regard as The Devil's Tower.\n\nEventually, the men and women who called Esteria their home began mining a\nuniquely radiant silver from the nearby mountains, and development boomed\nTowns were built, and the land became rich with life.\n\nThen, all at once, monsters began to appear. Only a few at first  but soon\nenough, the land was swarming with them, and the Esterians had no choice but\nto hide in fear, remaining ever vigilant just to stay alive.\n\nOur story begins with a young man who'd heard rumors of these misfortunes,\nand strove to verify them with his own eyes a brave swordsman with an\nadventurous spirit bolstered by his own youthful naivet.\n\nHis name was Adol Christin.\n\nWith no regard for his own safety, Adol set sail toward Esteria through a\nheretofore impassable barrier of neverending storms. There, he was destined\nto become ensconced within a 700 year-old mystery that would ultimately take\nhim to a long-lost land nestled amongst the clouds...\n\nYs I &amp; II Chronicles is the most modernized and up-to-date remake of\nFalcom's classic franchise-spawning action RPGs from 1987 and 1988. Come see\nhow the story began, and witness the birth of a legend\n\nFeatures\nClassic buttonless bump combat receives a full analog-enabled\nupgrade for gamepad users, and is augmented in Ys II by a robust magic\nsystem.\nCharacter art selectable from 90s-style portraits or more modern anime\ndesigns.\nTransform into a demon to speak with any and every standard enemy in the\ngame, creating unparalleled depth that still impresses even to this day.\n(Ys II only)\nAdjustable high-resolution PC graphics with a smooth, consistent\nframerate.\n\n1. Unrar\n2. Burn or mount the image\n3. Install the game.\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory\n5. Play the game\n6. Support the software developers. If you like this game, BUY IT\n\n","torrent":{"xt":"urn:btih:2ca2f418fe545202d62a748ac3ff1ddb3a4743da","amp;dn":"Ys.II.Chronicles.Plus-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ca2f418fe545202d62a748ac3ff1ddb3a4743da","infoHashBuffer":{"type":"Buffer","data":[44,162,244,24,254,84,82,2,214,42,116,138,195,255,29,219,58,71,67,218]},"announce":[],"urlList":[]}}