{"title":"Dave Samuels - Tjader-ized: A Cal Tjader Tribute (1998) [Jazz][m","uid":5143709,"size":168946955,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2d8f614f1ecd3f6b4a0b8e52d6c8366279f65451&amp;dn=Dave+Samuels+-+Tjader-ized%3A+A+Cal+Tjader+Tribute+%281998%29+%5BJazz%5D%5Bm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":22,"time":1257098701,"description":"Dave Samuels - Tjader-ized: A Cal Tjader Tribute\nAudio CD: May 19, 1998 \nOriginal Release Date: May 19, 1998 \nLabel: Verve, Polygram\nQualiity: mp3 320 kbps\n\nEditorial Reviews\nAmazon. com\nThere's a breezy cool at the heart of this homage to the late jazz great Cal Tjader.  As performed by vibe player Dave Samuels, who has made music with Spyro Gyra in the past, this LP maximizes what might be construed as a nod to '60s and '70s-era James Bond-like suavity.  It's compulsively easy to listen to as background noise yet it tweaks the memory by combining style and sensibility with a dreamy, old-world approach.  It's both complex and vapid; dark and light--and most of all--compels the listener to reach for that frosty glass of whatever sitting on the coffee table.  Tjader was a guiding force to an era of light jazz, calypso beats, and Latin styles, and as honored by Samuels, he's also reminiscent of artists the likes of Ramsey Lewis and the whole &quot;in crowd&quot; mindset while still maintaining his individuality.  Great listening for a summer day.  ~ Paula Nechak \n\nI have been listening to Spyro Gyra for years, and have always enjoyed Dave's contributions to their albums.  So, it's no surprise that Dave's solo projects have found their way to my collection.  This record is excellent from beginning to end, and it features a wide range of supporting musicians.  For example, Eddie Palmieri, who collaborated with Tjader, plays piano on 3 tracks (which he wrote or co-wrote).  Also, Dave Valentin is featured on flute on 4 of the tracks, including a five minute version of &quot;Soul Sauce&quot;.  More important, this record prompted me to learn more about the work of Tjader.  If you are a fan of Tjader, Latin Jazz, and/or the vibraphone, this CD is a must.  ~ Chuck S. \n\nAll of us know the enormous relevance of Carl Tjader in what Latin Jazz concerns.  This circumstance earned him the admiration, stem and affection of millions of aficionados worldwide.  \n\nDave Samuels is a undeniable virtuoso who gave Spyro Gyra that preferential status ; currently he plays too with Andy Narell, that eminence of the vibraphone.  \n\nEddie Palmieri, one of the last living legends; five time Grammy winner composed Tjaderized.  But if you consider the superb musical support with artists of the stature of Dave Valentin.  Joe Santiago, Alain Mallet, Ray Barreto in congas (Triste), Marc QuiÃƒÂ±ones (percussion), &quot;El Negro&quot; HernÃƒÂ¡ndez in drums, Michael Wolff and John Benitez, you must agree we have a &quot;Big Leaguers Team&quot;, that hardly will be far to disappoint you.  \n\nThere is no minor track.  This is a well deserved homage to a notable figure of Latin Jazz, his majesty Carl Tjader.  \n\nBuy it without dilation.  The album is a jam session.  ~ Hiram Gomez Pardo\n\nDave Samuels - Tjader-ized: A Cal Tjader TributeTracks: \n01  Tjaderized \n02  Bachi \n03  Soul Sauce \n04  Delta Sierra \n05  Viva Cepeda \n06  Triste \n07  Tres Plabras \n08  Resemblance \n09  Yeah \n10  Hand Me Down \n11  Duo Plus Four \n","torrent":{"xt":"urn:btih:2d8f614f1ecd3f6b4a0b8e52d6c8366279f65451","amp;dn":"Dave+Samuels+-+Tjader-ized%3A+A+Cal+Tjader+Tribute+%281998%29+%5BJazz%5D%5Bm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d8f614f1ecd3f6b4a0b8e52d6c8366279f65451","infoHashBuffer":{"type":"Buffer","data":[45,143,97,79,30,205,63,107,74,11,142,82,214,200,54,98,121,246,84,81]},"announce":[],"urlList":[]}}