{"title":"[-SexArt-] Chloe Amour [-Love For Sale Season 2 - Episode 4-] --","uid":12242334,"size":408613788,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:2ff54d585e823d87c25380864137ffe236797604&amp;dn=%5B-SexArt-%5D+Chloe+Amour+%5B-Love+For+Sale+Season+2+-+Episode+4-%5D+--&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Upl0ad3rR","files":1,"time":1439771669,"description":"[-SexArt-] Chloe Amour [-Love For Sale Season 2 - Episode 4-] --NEW-- 16-August-2015\n\n---:More From My Torrent's Here:---   &lt;a href=&quot;\nhttps://thepiratebay.se/user/Upl0ad3rR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/Upl0ad3rR&lt;/a&gt;\n\n---:ScreeNshotS:---  &lt;a href=&quot;\nhttp://imgfresh.com/image/20230.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgfresh.com/image/20230.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgfresh.com/image/20231.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgfresh.com/image/20231.html&lt;/a&gt;\n\nWhile the Second season of Alis Locanta's &quot;Love for Sale&quot; Deals with Complex subject matter, Often on A Cosmic scale, in &quot;Love For Sale, Season 2 - Episode 4 - Checkmate &quot;the complexity occurs on an intensely personal and intimate level. Drawing from her own upbringing, series star Chloe Amour discusses the behavioral patterns of men and women, particularly relating to fidelity, monogamy, love, and lust. This provides the underpinning of an ongoing conversation with her ??somewhat naive but well-meaning girlfriend, Layla Sin, as she struggles with the difficulties she's experiencing with her ??boyfriend, Jay Smooth. During the course of her discussion with Sin, Amour is inspired to offer a confession, and tells wide-eyed Layla about her career as a high-priced prostitute. Chloe goes as far as inviting Layla to join her on one of her jobs, and that's when things begin to get complicated. When the two women meet for cocktails prior to Amour's appointment, Sin overindulges and winds up passed out on a couch in a hotel hallway. After slipping her friend the key to a room of her own, Amour meets her client, and here the complication takes a quantum leap. Amour, experiencing emotional and hormonal turmoil of her own, loses her usual professional detachment during this passionate and highly-charged encounter. She allows the customer to blindfold her, and, once the blindfold is removed, she immerses herself completely in the animal intensity of the encounter, orgasming powerfully and repeatedly while letting her usually locked-down romantic imagination to run free. Her partner's explosive ejaculation, and his behavior in the immediate aftermath, brings Amour back to Earth, while also triggering an unforeseen series of complex repercussions. &quot;Love For Sale, Season 2 - Episode 4 - Checkmate&quot; contains unexpected events and shocking surprises, but fans of the series will not be surprised by the stunning impact of its visceral and cerebral eroticism","torrent":{"xt":"urn:btih:2ff54d585e823d87c25380864137ffe236797604","amp;dn":"%5B-SexArt-%5D+Chloe+Amour+%5B-Love+For+Sale+Season+2+-+Episode+4-%5D+--","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ff54d585e823d87c25380864137ffe236797604","infoHashBuffer":{"type":"Buffer","data":[47,245,77,88,94,130,61,135,194,83,128,134,65,55,255,226,54,121,118,4]},"announce":[],"urlList":[]}}