{"title":"The MacLarens of Balmorie Books 1-5 by Kam McKellar Highlander","uid":12640663,"size":2060756,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:30fa278a37fe734d069c04bca42faf0a22671ff3&amp;dn=The+MacLarens+of+Balmorie+Books+1-5+by+Kam+McKellar+Highlander&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KiwiSue49","files":11,"time":1445985660,"description":"Title: MAD ABOUT PLAID – Book 1\r\n\r\nDescription:\r\n\r\nIn Kam McKellar’s fun, sexy contemporary Scottish romance, Ian MacLaren—retired U.S. soldier turned Innkeeper is keeping his family legacy going. He and his brothers have moved to Scotland to farm the land, restore and rent out cottages, and convert the west wing of the five-hundred year old Balmorie Castle into a guest house. The last thing on his mind is a Highland romance. But tell that to his first visitor...\r\n\r\nLucy Walker isn’t a travel writer, but she’s taking her cousin’s place and going to Scotland anyway. Why she gets talked into these things, she doesn’t know. But what she does know is that Ian MacLaren is not the type of Innkeeper she was expecting. Her plan to take notes and record all of Balmorie’s amenities, so her cousin can then write a review, becomes more and more difficult to do when she has her very own Scottish Highlander as her tour guide. One who soon finds out the sexy travel writer isn’t who she claims to be…\r\n\r\n\r\n\r\nTitle: A SCOT LIKE YOU – Book 2\r\n\r\nDescription:\r\n\r\nIn Kam McKellar’s 2nd contemporary Scottish romance, Kate Walker tries to restore her wild side by skinny-dipping in a loch while on vacation in Scotland. Too bad she gets caught by a rugged Highlander...\r\n\r\nWith Balmorie Guest House up and running, Devin MacLaren can finally focus on restoring the holiday cottages on the estate. Recently returned from war, all he wants is the peace and quiet only the Highlands can give him. With Kate's arrival, that peace goes right out the window. As much as he’d like to avoid the sexy troublemaker, he needs her animal expertise to help his retired military dog, Hildie.\r\n\r\nDespite their failed first (and second) meeting, Kate can’t help but be attracted to the solitary Highlander; there’s so much heat lurking behind those solemn eyes that she can’t seem to stay away. There’s more to Devin MacLaren than meets the eye. And while Hildie might need her help, it’s Devin who needs her heart.\r\n\r\n\r\n\r\nTitle: THE TROUBLE WITH KILTS – Book 3\r\n\r\nDescription:\r\n\r\nJamie is a wounded Highlander with an attitude and Riley is the kind of woman who can't resist a challenge.\r\n\r\nRiley Brooks’ life is in a tailspin. With divorce papers shoved into her suitcase, she takes off for a much needed vacation to Scotland to see her cousin Lucy wed Ian MacLaren. Highland romance is in the air, but she wants none of it. Neither does Jamie MacLaren. The Scottish farmer is pissed off and bitter, and wants to be left alone. But when Riley’s ex-husband shows up at the castle to reopen old wounds, misery loves company, and Riley and Jamie join forces with a little Scottish whisky to ease their hurts, and maybe open their hearts…\r\n\r\n\r\n\r\nTitle: ANY SCOT OF MINE – Book 4\r\n\r\nDescription:\r\n\r\nIn Kam McKellar’s 4th sexy contemporary Scottish romance, it’s been twelve years since Ross MacLaren saw Harper Dean. Now, she’s left Kentucky for Scotland to take back what she claims is rightfully hers—her father’s lost whisky-making recipes. Ross has no intention of giving the woman who broke his teenage heart anything at all. But Harper has other ideas and getting around a six-foot-three Highlander is nothing to a country girl. She’s not giving up, even if that means a little criminal activity is in order...\r\n\r\n\r\n\r\nTitle: ONE UPON A TIME IN SCOTLAND – Book 5\r\n\r\nDescription:\r\n\r\nIn Kam McKellar's 5th sexy contemporary Scottish romance, divorced single mother, Abbie, heads to Balmorie Estate for a nine week stay to catch up with friends, enjoy the peace and quiet, and hopefully get a little work done. But a Highlander with a bad boy reputation seems bound and determined to change her plans, and her mind","torrent":{"xt":"urn:btih:30fa278a37fe734d069c04bca42faf0a22671ff3","amp;dn":"The+MacLarens+of+Balmorie+Books+1-5+by+Kam+McKellar+Highlander","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30fa278a37fe734d069c04bca42faf0a22671ff3","infoHashBuffer":{"type":"Buffer","data":[48,250,39,138,55,254,115,77,6,156,4,188,164,47,175,10,34,103,31,243]},"announce":[],"urlList":[]}}