{"title":"Photo DVD Slideshow Professional 8.20 Portable [ak]","uid":6319003,"size":29046360,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:319d8287a13d3edaa222a27722069c1e23207822&amp;dn=Photo+DVD+Slideshow+Professional+8.20+Portable+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1302800512,"description":"Photo DVD Slideshow Professional 8.20 Portable\n\nPhoto DVD Slideshow Pro. allows you to create entertaining photo slideshows you can watch on TV, create Flash slideshow (Flash for Video) perfect for posting online to your website, generate MPEG video files for mobile devices such as Apple iPod, Sony PSP, cellular phone, build photo slideshow video ready for upload to YouTube, MySpace. With few clicks, Photo DVD Slideshow creates an exciting photo slide show with music, CD or DVD menu, Pan&amp;Zoom and transition effects. Photo DVD Slideshow supports DVD, SVCD and VCD 2.0, MPEG, MPEG-4, FLV (Flash for Video) as the output format, supports over 360 amazing transition effects, Pan &amp; Zoom, anti-flickering filter, supports adding background music directly from music CD and adding text Macro such as photo album name, photo file name, date, etc. It supports sub-title and art clips for each photo slide which adds amazing special effects for the slideshow\n\nkey features:\nÃ‚Â· Add Video Clips to photo slideshow and burn video to DVD!\nÃ‚Â· Make Web Photo Album to show photo slideshow on website.\nÃ‚Â· Supports more slideshow output options: MPEG video, FLV, MPEGII, MPEG-4, 3GP video\nÃ‚Â· Support trimming background music and recording your own voice.\nÃ‚Â· High quality VCD, SVCD, DVD output : photo or picture looks great on TV.\nÃ‚Â· Support designing your own Hollywood-style video and motion menus.\nÃ‚Â· Decorate your photos with your own voice, text, art clips.\nÃ‚Â· Customize transition effects, Pan &amp; Zoom for individual slide.\nÃ‚Â· Support amazing SWF Flash album themes, titles and credits for slideshow.\nÃ‚Â· All-in-One: Basic picture editing, Creating slide show with music, Burning DVD disc.\nÃ‚Â· Supports both PAL and NTSC formats. Fullscreen (4:3) and Widescreen (16:9) output.\n\nHome Page - http://www.photo-dvd-slideshow.com\n\n","torrent":{"xt":"urn:btih:319d8287a13d3edaa222a27722069c1e23207822","amp;dn":"Photo+DVD+Slideshow+Professional+8.20+Portable+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"319d8287a13d3edaa222a27722069c1e23207822","infoHashBuffer":{"type":"Buffer","data":[49,157,130,135,161,61,62,218,162,34,162,119,34,6,156,30,35,32,120,34]},"announce":[],"urlList":[]}}