{"title":"McManus-Financial Terrorism(financial hijacking of America)(1993","uid":7007126,"size":2530893,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:31cb390ccc941a0e739d4a8547572c38c248b15f&amp;dn=McManus-Financial+Terrorism%28financial+hijacking+of+America%29%281993&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1328309546,"description":"This is John F. McManus's revealing book Financial Terrorism - Hijacking America Under the Threat of Bankruptcy (1993) which exposes the conspiracy to lead the U.S. into world government by bankrupting the nation as a whole. Modern terrorism comes in many guises. Far more potent than bombs and guns is the role being played by money in whiplashing America into a new world order. With the exceptional clarity and logic characteristic of his writing, the author explains how the critical fiscal situation is the intentional result of insider monetary subversion from the founding of the Federal Reserve System (US central bank) in 1913 to today's frenzy of deficit spending and horrendous national debt. In the face of mushrooming national debt and interest payments, key establishment insiders have prepared totalitarian solutions to meet the looming &quot;crisis&quot; their allies have helped to create. &quot;The threat of national bankruptcy,&quot; claims the author, &quot;is designed to push our nation into the new world order.&quot; If you don't know what has happened in the past, you won't have a clue about the present and Financial Terrorism will give you the necessary historical perspective in a wholly documented form. 270 pages. some pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:31cb390ccc941a0e739d4a8547572c38c248b15f","amp;dn":"McManus-Financial+Terrorism%28financial+hijacking+of+America%29%281993","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31cb390ccc941a0e739d4a8547572c38c248b15f","infoHashBuffer":{"type":"Buffer","data":[49,203,57,12,204,148,26,14,115,157,74,133,71,87,44,56,194,72,177,95]},"announce":[],"urlList":[]}}