{"title":"Joey DeFrancesco - Joey D","uid":9924510,"size":153182374,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:33e08c1503b49f5f15e3d050b6f6d8b426c70b8b&amp;dn=Joey+DeFrancesco+-+Joey+D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"L_Hammond","files":-1,"time":1397044585,"description":"Joey DeFrancesco - Joey D\n\nThis is a great traditional jazz organ trio session on which jazz organ virtuoso Joey DeFrancesco is accompanied by tenor saxophonist Jerry Weldon and drummer Byron Landham.\n\n\nTracklist:\n01. Dig (7:14)\n02. Lament (6:31)\n03. Take Me out to the Ballgame (8:04)\n04. If Ever I Should Leave You (10:41)\n05. Besame Mucho (8:15)\n06. Come Dance with Me (5:51)\n07. Nancy (With the Laughing Face) (6:44)\n08. Blues Up and Down (6:57) \n\n\nPersonnel: \nJoey DeFrancesco: organ,\nJerry Weldon: tenor saxophone,\nByron Landham: drums.\n\nRecord Label: HighNote Records\nRelease: 2008\n\nFormat: MP3 320 kbit/s. All songs are tagged by the book.\n\n---------------------\n\nReview by Jack Bowers\nJoey DeFrancesco, who has graduated from heir-apparent to undisputed king among contemporary jazz organists, is in his element here, presiding over a trio comprised of himself, undervalued tenor saxophonist Jerry Weldon and reliable drummer Byron Landham. Rest assured DeFrancesco's nimble fingers are as virtuosic as ever, and there's no need to fret about the slender rhythm section, as DeFrancesco happily provides his own.\n\nDeFrancesco is perfectly at ease and in control even though recording for the first time on a new Diversi DV-Duo Plus drawbar organ with 'modified sound engine and modeling technology'. It comes alive, as one would expect, in DeFrancesco's proficient hands, and he is squarely on his game regardless of mood or tempo. The same can be said of Weldon, an unapologetic bopper whose hard-edged tenor complements superbly the leader's more even-tempered moments. Landham, DeFrancesco's longtime companion and helpmate, is ideally cast in the role of rhythmic navigator.\n\nDeFrancesco's choice of music is exemplary, from Miles Davis' meteoric curtain-raiser, 'Dig', to the heated finale, Gene Ammons' impulsive 'Blues Up and Down' (which underlines the Dexter Gordon ascendancy in Weldon's arsenal). The trio even manages to make 'Take Me Out to the Ball Game' seem fresh and engaging. Completing the prismatic program are J.J. Johnson's plaintive 'Lament' and the tasteful standards 'If Ever I Should Lose You', 'Besame Mucho', 'Come Dance with Me' and 'Nancy (with the Laughing Face)', the last two associated with Frank Sinatra.\n\nThis is high-quality straight-ahead contemporary jazz, a worthy successor to splendid organ trios led in years past by such giants as Jimmy Smith, Jimmy McGriff, Richard 'Groove' Holmes, Jack McDuff, Don Patterson and others. DeFrancesco is the monarch now, and if Joey D! is any signpost, he harbors no desire to abdicate.\n\n--------\n\nIf you encounter errors during the file sharing, please, place this material as close to the root of the hard disk as possible and restart the file sharing (e.g. as close as possible to C: in Windows). This is in order to make the path (drive, directory and filename) as short as possible. Operating systems have limits regarding how long a path including the filename can be, and if this limit is exceeded there will be errors.\n\n--------\n\nL Hammond, The Pirate Bay, where you'll find more jazz organ.\n\n","torrent":{"xt":"urn:btih:33e08c1503b49f5f15e3d050b6f6d8b426c70b8b","amp;dn":"Joey+DeFrancesco+-+Joey+D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33e08c1503b49f5f15e3d050b6f6d8b426c70b8b","infoHashBuffer":{"type":"Buffer","data":[51,224,140,21,3,180,159,95,21,227,208,80,182,246,216,180,38,199,11,139]},"announce":[],"urlList":[]}}