{"title":"Bob Seger &amp; The Silver Bullet Band - Against the Wind [1980]","uid":8300951,"size":99153143,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:34237e1f506711e5eb4821e6418bd3591f414f16&amp;dn=Bob+Seger+%26amp%3B+The+Silver+Bullet+Band+-+Against+the+Wind+%5B1980%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1364268395,"description":"mp3 320 \n\nThough there are still some traces of the confessionals that underpinned Beautiful Loser through Stranger in Town, Against the Wind finds Bob Seger turning toward craft. Perhaps he had to, since Against the Wind arrived after three blockbuster albums and never-ending tours. Even so, this record winds up not feeling as immediate or soulful as its predecessors, especially since it begins with a tossed-off rocker called &quot;The Horizontal Bop,&quot; possibly his most careless tune since &quot;Noah.&quot; It's fun, but once it's done, the record really starts to kick into high gear with &quot;You'll Accomp'ny Me,&quot; a ballad the equal of anything on its two predecessors. Throughout Against the Wind, Seger winds up performing better on the ballads than the rockers, which, while good, tend to sound a little formulaic. Still, Seger's formula is good and if &quot;Her Strut&quot; and &quot;Betty Lou's Gettin' out Tonight&quot; would have been second stringers on Stranger in Town, they offer a nice balance here, and the rest of the record alternates between similarly well-constructed rockers and introspective ballads like &quot;Against the Wind&quot; and &quot;Fire Lake.&quot; Compared to its predecessors, this does feel a little weak, but compared with its peers, it's a strong, varied heartland rock album that finds Seger at a near peak. ","torrent":{"xt":"urn:btih:34237e1f506711e5eb4821e6418bd3591f414f16","amp;dn":"Bob+Seger+%26amp%3B+The+Silver+Bullet+Band+-+Against+the+Wind+%5B1980%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34237e1f506711e5eb4821e6418bd3591f414f16","infoHashBuffer":{"type":"Buffer","data":[52,35,126,31,80,103,17,229,235,72,33,230,65,139,211,89,31,65,79,22]},"announce":[],"urlList":[]}}