{"title":"BulletProof FTP 2.42 (client) + crack [H]","uid":3324573,"size":3304124,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:34f1a5146eda2d778428034d36569c3752da68d6&amp;dn=BulletProof+FTP+2.42+%28client%29+%2B+crack+%5BH%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheHooligan","files":1,"time":1115063951,"description":"BulletProof FTP Client\n\nNeed to upload your website? Or trade files?\n\nBulletProof FTPâ„¢ is a fully automated FTP client, with many advanced features including automatic download resuming, leech mode, ftp search and much more. Perfect for personal or corporate Webmasters as well as for Software and Music traders.\n\nDownload files in any order, from any directory on an FTP site. \n\nAutomatically reconnect and resume from where it left off if the connection is lost, or no data is received for a specified period of time. This works with uploading as well! \n\nBrowse the FTP site from the cache while off line or transferring - this does not open another connection to the FTP server like other FTP clients. \n\nList hidden files \n\nLeech mode - on FTP servers that have a specified limit that you can download.\n\nBullet Proof FTP can disconnect, reconnect and keep downloading automatically when your download credit runs out.\n\nMonitor the clipboard, and when an ftp or http (web site) url is copied into it, it can instantly connect to the appropriate site in the background and start transferring. \n\nQueue files on more than one site for download. \n\nProxy/firewall support\n\nHTTP downloading with support for redirected URLs \n\nLocal file listing with rename/delete/make directory support\n\nImport site listings from Cute FTP, WS_FTP, and FTP Explorer. With Cute FTP and FTP Explorer, the passwords are also imported.\n\nRemote mirroring - BPFTP will automatically download new files, resume half-downloaded files, and skip files you already have. You can download entire sites.\n\nWindows-style file finding ability. ie, enter a wildcard and other details about a file, and BPFTP will search an entire FTP site and download every file that matches.\n\nPlus everything else you'd expect in an FTP client, and a few things you wouldn't. And its a very small download, NO extra support files/DLLs needed.\n\n","torrent":{"xt":"urn:btih:34f1a5146eda2d778428034d36569c3752da68d6","amp;dn":"BulletProof+FTP+2.42+%28client%29+%2B+crack+%5BH%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34f1a5146eda2d778428034d36569c3752da68d6","infoHashBuffer":{"type":"Buffer","data":[52,241,165,20,110,218,45,119,132,40,3,77,54,86,156,55,82,218,104,214]},"announce":[],"urlList":[]}}