{"title":"EnigmaT Set Rips { Cuts } - June 27th, 2013","uid":8619679,"size":1410252147,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:352c767de10225cc1ee92002e4e0508ae3feeb7e&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+June+27th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":154,"time":1372294578,"description":"Active Sight - Out Of Our Lives (Manuel Le Saux For Fun Remix) (Cut From Saux Set)-enTc.mp3\nAdam Kancerski - Pussy Magnet (Original Mix) (Cut From Anderson Set)-enTc.mp3\nAddictive Glance vs Trian - Alliance (Original Mix) (Cut From Haig Set)-enTc.mp3\nAero 21 - You &amp; Me In The Sunset (Farzam's Uplifting Remix) (Cut From Haig Set)-enTc.mp3\nAlae Khaldi - Hope (Original Mix) (Cut From Suzy Set)-enTc.mp3\nAlex Blest Presents Soundbreeze - Skylight (Original Mix) (Cut From Kaeno Set)-enTc.mp3\nAlexander Kornauhoff - Memories of the Sun (Cut From Tydi Set)-enTc.mp3\nAlly Brown &amp; Filip Marak - Remote Access (Touchstone Remix) (Cut From Kaeno Set)-enTc.mp3\nAlmost Famous - Symbiosis (Mobil Remix) (Cut From Anderson Set)-enTc.mp3\nAlt &amp; J - Emotion (Michele Cecchi Remix) (Cut From Saux Set)-enTc.mp3\nAly &amp; Fila - City of Angels (Extended Mix) (Cut From A&amp;F Set)-enTc.mp3\nAly &amp; Fila - First Sun (Extended Mix) (Cut From A&amp;F Set)-enTc.mp3\nAly &amp; Fila Vs Arctic Moon - Daydreaming (Extended Mix) (Cut From A&amp;F Set)-enTc.mp3\nAly &amp; Fila vs John O'Callaghan Feat. Eli - Your Heart Is Mine (Extended Mix) (Cut From A&amp;F Set)-enTc.mp3\nAmitacek - Bhadar (Daniel Skyver Remix) (Cut From Space Garden Set)-enTc.mp3\nAndre Visior feat. Cathy Burton - Daylight (Alexandre Bergheau remix) (Set Rip)-enTc.mp3\nAndrex presents 3X - Believers (CBM Remix) (Cut From Stowers Set)-enTc.mp3\nAndy van Kayne - In The Name Of Love (Ikerya Project Remix) (Cut From Sty Set)-enTc.mp3\nAshe - Forge (Andy Tau Remix) (Cut From Jules Set)-enTc.mp3\nAustin Leeds - Fresco (Original Mix) (Cut From Blake Set)-enTc.mp3\nAvail - Dominion (Original Mix) (Cut From Above Clouds Set)-enTc.mp3\nAxwell feat. Magnus Carlson - Center Of The Universe (Cut From Jules Set)-enTc.mp3\nAyla - Sun Is Coming (Adam Ellis &amp; Pete UniQue Remix) (Cut From A&amp;F Set)-enTc.mp3\nAyla - Sun Is Coming (Adam Ellis &amp; Pete UniQue Remix) (Set Rip)-enTc.mp3\nAzotti - Coffee (Original Mix) (Cut From Saux Set)-enTc.mp3\nAzotti - Coffee (Peter Hulsmans Remix) (-SHORT- Cut From Solarstone Set)-enTc.mp3\nBass Kleph - Less Is More (Cut From Andi Set)-enTc.mp3\nBassjackers - CrackIn (Cut From Xabi Set)-enTc.mp3\nBenya with Shanokee - Sanctuary (Cut From Audrey G Set)-enTc.mp3\nBlue Twinkle - Last Promise (Cut From Haig Set)-enTc.mp3\nBlugazer - Utopian Suicides (Cut From Solarstone Set)-enTc.mp3\nBlugazer feat. Catherine - Perpetual Quietus (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nC-Systems feat. Hanna Finsen - Listen To The Wind (Cut From C-Systems Set)-enTc.mp3\nCalvin Logue - Helter Skelter (Original Mix) (Cut From Saux Set)-enTc.mp3\nCavin Viviano - Laba (Instrumental Mix) (Cut From Anderson Set)-enTc.mp3\nChasing Sunset - One Day (Morrison Kiers Remix) (Cut From Several Spirits Set)-enTc.mp3\nChasing Sunset - One Day (Morrison Kiers Remix) (Cut From Shah Set)-enTc.mp3\nChasing Sunset - One Day (Morrison Kiers Remix) (Cut From Tydi Set)-enTc.mp3\nChris Baker Presents Virtue - Levitation (Lakes Remix) (Cut From Sty Set)-enTc.mp3\nChris Voro - Alter Ego (Original Mix) (Cut From Oakenfold Set)-enTc.mp3\nCloudwalker - Silence (Original Mix) (Cut From Anderson Set)-enTc.mp3\nConcept 32 - Here We Go (Cut From Ferry Set)-enTc.mp3\nConrad Winged - Mystic River (Original Mix) (Cut From Above Clouds Set)-enTc.mp3\nCosmic Gate feat. Kyler England vs. Paul Trainer - Flatline Quasar (D-Mark Mashup) (Cut From GO Set)-enTc.mp3\nCraig Meichan - Warp Drive (Original Mix) (Cut From Nadz Set)-enTc.mp3\nCybernetic - Perseids (DJ Space Raven Remix) (Cut From Haig Set)-enTc.mp3\nD.O.D - What Time (Cut From Bolier Set)-enTc.mp3\nDannic - Ignite (Cut From W&amp;W Set)-enTc.mp3\nDanny Avila - Voltage (Cut From W&amp;W Set)-enTc.mp3\nDarren Porter - Spellbound (Ferry Tayle Remix) (Cut From Sherry Set)-enTc.mp3\nDawnchaser - Shuksan (Hiking Mix) (Cut From El Jay Set)-enTc.mp3\nDelaRed - Revolver (Cut From Beat Service Set)-enTc.mp3\nDelta3 &amp; JFK - The Haunting (Cut From Delta3 Set)-enTc.mp3\nDelta3 - Focus (Cut From Delta3 Set)-enTc.mp3\nDepeche Mode - Soothe My Soul (Victor Dinaire &amp; Bissen Remix) (Set Rip)-enTc.mp3\nDJ Sveta &amp; Alexsandra Mell - Track To Infinity (Philip Aniskin Remix) (Cut From Shah Set)-enTc.mp3\nDNYO - Roots (Sezer Uysall '3AM' Remix) (Cut From Solarstone Set)-enTc.mp3\nDreamy - Emiliah (Scott Lowe &amp; High Definition Remix) (Cut 2 From Saux Set)-enTc.mp3\nDreamy - Emiliah (Scott Lowe &amp; High Definition Remix) (Cut From Saux Set)-enTc.mp3\nDreamy feat. Magdalen Silvestra - As It Was Meant To Be (Original Mix) (Cut From Teef Set)-enTc.mp3\nDuher - Goosebumps (Original Mix) (Cut From Oakenfold Set)-enTc.mp3\nEast &amp; Young feat. Tom Cane - Starting Again (Festival Mix) (Cut From Claessen Set)-enTc.mp3\nEchomen - Perpetual (Guy J Remix) (ABGT 033 Rip)-enTc.mp3","torrent":{"xt":"urn:btih:352c767de10225cc1ee92002e4e0508ae3feeb7e","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+June+27th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"352c767de10225cc1ee92002e4e0508ae3feeb7e","infoHashBuffer":{"type":"Buffer","data":[53,44,118,125,225,2,37,204,30,233,32,2,228,224,80,138,227,254,235,126]},"announce":[],"urlList":[]}}