{"title":"Halloween(2007)DVDRip.AC3(ENG)-DROCK","uid":6387103,"size":733859840,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:35485d2827b8336381f0eddd2c116f92526a0520&amp;dn=Halloween%282007%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1305239862,"description":"The Devil's Rejects director Rob Zombie resurrects one of the most notorious slashers in screen history with this re-imagining of the 1978 John Carpenter classic that spawned numerous sequels and countless imitators. As a child, young Michael Myers (Daeg Faerch) committed one of the most unspeakable crimes imaginable. Subsequently locked in an asylum and placed under the care of Dr. Loomis (Malcolm McDowell), the hollow-eyed boy grew into an emotionless man determined to escape back to his hometown of Haddonfield and complete the murderous mission that he began so many years back. These days, the long-abandoned Myers house sits decrepit and overgrown on a peaceful suburban street, its boarded windows and rotting wood a silent testament to the slaughter that has haunted Haddonfield for decades. Now Michael Myers (Tyler Mane) is back, and as the children of this typical Midwestern town fill the sidewalks for a fun-filled night of tricks and treats, Haddonfield is about to find out that there is no escape from pure evil. Brad Dourif, William Forsythe, Udo Kier, Dee Wallace, Sheri Moon Zombie, Danny Trejo, and Adrienne Barbeau co-star. \n\nRipped with Autogk.\n\nLength: 1 Hour 49 Minutes\n\nFile Type: AVI","torrent":{"xt":"urn:btih:35485d2827b8336381f0eddd2c116f92526a0520","amp;dn":"Halloween%282007%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35485d2827b8336381f0eddd2c116f92526a0520","infoHashBuffer":{"type":"Buffer","data":[53,72,93,40,39,184,51,99,129,240,237,221,44,17,111,146,82,106,5,32]},"announce":[],"urlList":[]}}