{"title":"GiliSoft SecureDisk Creator v7.1.0","uid":15180443,"size":5423000,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:357da933a6c1d958064282db401ea75d3543dbcb&amp;dn=GiliSoft+SecureDisk+Creator+v7.1.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZarkBit","files":1,"time":1467452860,"description":"GiliSoft SecureDisk Creator v7.1.0\r\n\r\nGiliSoft Secure Disc Creator is a CD/DVD encryption software for creating encrypted image files, virtual discs and burning encrypted CD/DVDs. It can create a safe and public space on one disc. Using the military standard of 256-bit AES on-the-fly encryption algorithm, Secure Disc Creator helps protect important files and folders by encrypting the safe space. The safe space can only be opened by a set password, while everyone can view the public space. Powerful functions along with easy operability makes Secure Disc Creator the best choice to prevent leakage of confidential information on your CD/DVD. Without installing any extra program on a computer, you can open and read the data on the CD/DVD just by entering the correct password. \r\nFor the convenience of enterprise users to deploy, or secondary development, we also provide the command-line version, please contact us if you need.\r\n\r\nExclusive Features of GiliSoft Secure Disc Creator\r\n\r\nPassword Protect CD/DVDs\r\nCreate password protected CD/DVD. Encrypted CD can can be safely sent via email. Work with encrypted CD without continuous period of data decryption. No need to decrypt files on CD/DVD before use. Simply enter password and work with any document as usual.\r\n\r\nHide Files, Folders on CD/DVDs\r\nWhatever information, files, folders and documents you put in your CD/DVD drive, GiliSoft Secure Disc Creator creates encrypted backups on CD/DVD and keeps them completely secured. Encrypted discs can be kept in public and insecure locations.\r\n\r\nVirtual Disc (Virtual Drive)\r\nGiliSoft Secure Disc Creator has another interesting feature: Virtual Disc(Drive). You can use this app to create virtual discs. You can mount ISO images into virtual drives.\r\n\r\nSecurely Share\r\nThe third party user simply needs to insert the storage media to their host computer and enter the password to work as they would with any other CD.\r\n\r\nMake Encrypted ISO Image File\r\nIt can create ISO image file of CD/DVD. Adopting AES 256-bit encryption which is used to protect the most sensitive information of the U.S.Government and commercial organizations including banks\r\n\r\nBuilt-in CD and DVD burner\r\nIt has a built-in CD and DVD burner that can create discs that have both a public area and a secure area and can burn ISO Image File to CD/DVDs.\r\n\r\nOfficial Website: http://www.gilisoft.com/product-secure-disc-creator.htm","torrent":{"xt":"urn:btih:357da933a6c1d958064282db401ea75d3543dbcb","amp;dn":"GiliSoft+SecureDisk+Creator+v7.1.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"357da933a6c1d958064282db401ea75d3543dbcb","infoHashBuffer":{"type":"Buffer","data":[53,125,169,51,166,193,217,88,6,66,130,219,64,30,167,93,53,67,219,203]},"announce":[],"urlList":[]}}