{"title":"Space Colony ISO [AHM]","uid":3507863,"size":795550563,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:370d142e64a237793a29e8bd0a6b6e31d818a22d&amp;dn=Space+Colony+ISO+%5BAHM%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"soapbath","files":1,"time":1154063161,"description":"A Full ISO Brought to you by the guys at: http://www.x606x.com/ahhmymaties/. You can download via HTTP if you visit that forum. \n\n&quot;Space the final frontier... not anymore. In Space Colony you will explore and colonize new worlds with the same sense of familiarity of popping in your local coffee shop for a skinny decaf latte. Space Colony is best described as a People Sim meets a City Builder. The player manages and nurtures a group of dysfunctional space dwellers colonizing the most unearthly corners of the galaxy. Make no mistake, none of the 20 colonists you&amp;#039;ll meet were ever on a NASA shortlist. Ahhh, welcome to life beyond the stars. It&amp;#039;s everything the brochure said. So what if half the staff are brawling, the Harvester Robot is chain sawing its way through the oxygen supply and small furry aliens have taken over the disco? This is home! Space Colony comes from Firefly Studios, the creative force behind the million selling Stronghold series. Creating the pressure cooker environment with emotions flying around, where else could you find a Norwegian biker who can&amp;#039;t live without disco, a gym instructor operating a nuclear reactor and a geriatric in charge of base defence? [Gathering of Developers]&quot;\n\nMetacritic rating: 75\nPassword: warezforum\n\n","torrent":{"xt":"urn:btih:370d142e64a237793a29e8bd0a6b6e31d818a22d","amp;dn":"Space+Colony+ISO+%5BAHM%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"370d142e64a237793a29e8bd0a6b6e31d818a22d","infoHashBuffer":{"type":"Buffer","data":[55,13,20,46,100,162,55,121,58,41,232,189,10,107,110,49,216,24,162,45]},"announce":[],"urlList":[]}}