{"title":"Bill Charlap - 2007 - Live at the Village Vanguard FLAC","uid":9644446,"size":327499653,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:37980b528d24562dd4aad7e4694dd85854e679d3&amp;dn=Bill+Charlap+-+2007+-+Live+at+the+Village+Vanguard+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1392969949,"description":"Bill Charlap - 2007 - Live at the Village Vanguard\n\nSome 13 years into his recording career, jazz pianist extraordinaire Bill Charlap's first live album is, perhaps, his most exquisite release to date. While virtually all of his studio albums more than adequately showcase Charlap's virtuosity, good taste, and ceaseless imagination at the keys, it took the spontaneity of the live performance -- at New York's fabled Village Vanguard -- to give the first true indication of just what Charlap is capable of creating on the fly. The pinpoint accuracy and sophistication of his solos, whether at breakneck speed or in a ballad setting, are a marvel. Charlap's concentration never strays, and although he feels no compunction to strut, he lets it be known with each passage that he's among the most gifted pianists in jazz today. There is an economy to his playing even when the notes are rippling out faster than most listeners can probably hear them, and his sense of romanticism never flags. Those hot displays, particularly the seven-and-a-half-minute &quot;My Shining Hour&quot; (one of three Harold Arlen songs performed), &quot;The Lady Is a Tramp,&quot; and &quot;Rocker&quot; (a horn-less take on the Gerry Mulligan-penned classic made famous by Miles Davis), serve as perfect showcases not only for Charlap's fleet-fingered acrobatics but for the rhythm section, bassist Peter Washington and drummer Kenny Washington, to let loose. The drummer is as impressive skimming brushes across his traps as when wailing on them with a pair of sticks, and the bass player never loses sight of the root of the song as he wanders forcefully but melodically and thoughtfully. Where Charlap shines most brightly, though, is on the ballads. &quot;It's Only a Paper Moon,&quot; &quot;Autumn in New York,&quot; and Jim Hall's &quot;All Across the City&quot; give voice to Charlap's most vivid pianistics -- his range within a standard is admirable and something to be emulated, as is the discipline that keeps him from shooting off into the cosmos -- and serve as a constant reminder that grace, inspiration, and skill are not mutually exclusive traits. This CD was nominated in 2007 for a Grammy award as Best Jazz Instrumental Album (Individual or Group). (AllMusic)\n\nTrack list:\n01 - Rocker\n02 - Autumn In New York\n03 - Godchild\n04 - The Lady Is A Tramp\n05 - It's Only A Paper Moon\n06 - My Shining Hour\n07 - All Across The City\n08 - While We're Young\n09 - Last Night When We Were Young\n\nPersonnel:\nBill Charlap: piano\nPeter Washington: bass\nKenny Washington: drums\n\nEnjoy and share!","torrent":{"xt":"urn:btih:37980b528d24562dd4aad7e4694dd85854e679d3","amp;dn":"Bill+Charlap+-+2007+-+Live+at+the+Village+Vanguard+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37980b528d24562dd4aad7e4694dd85854e679d3","infoHashBuffer":{"type":"Buffer","data":[55,152,11,82,141,36,86,45,212,170,215,228,105,77,216,88,84,230,121,211]},"announce":[],"urlList":[]}}