{"title":"Counter Strike Source Dedicated Server","uid":4930712,"size":470866944,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:37e53a2b0bb9ca4d847cb370d0fe86fa9805a1fb&amp;dn=Counter+Strike+Source+Dedicated+Server&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mac-Sparrow","files":-1,"time":1243989587,"description":"This .rar arcive contains all the files needed to run and update your own css dedicated server. \n\nInstallation:\nTo Install the server you just have to extract the .rar file you you C directory. It's vital that it gets\nextracted to the C directory, or else you can't update it (wich is essential). when that is done you\nhave a folder at C:CSS Server containing all the server files and what not.\n\nNext you want to add yourself as admin and here's how you do:\n\ngo to C:CSS Servercstrikecfgmani_admin_plugin\nOpen up adminlist.txt configuration\nFollow the instructions given in the text file\nif you're not sure what your steam ID is, go to a random game online and type status in the console.\n\nServer settings can be configured in C:CSS Servercstrikecfg in the Server.cfg file.\n\nThe last thing you need to do in order for everything to work is portforwarding. www.portforward.com\nis a great website with info on close to every router out there on portforwarding. for counter strike\nyou wanna forward ports 27011 in both TCP and UDP as well as port 27015 (also TCP and UDP)\n\nUpdating the server:\nBefore you run the server for the first time, it's important that you run the update. Chances are \nthat the game may have been updated in the time this has been on tpb.\n\nTo update you simply run the Server Update shortcut found at C:CSS Server\n\nStarting up the server:\nNow all we need to do is start up the server.\nTo do this we need to make a shortcut for the srcds.exe found in C:CSS Server.\nWhen that is done you need to right click that shortcut and go to properties.\nHere we need to add a little something in the &quot;target&quot; field. It should say something like:\nC:GMODsrcds.exe\nwe want to add  -console -game Cstrike +map de_dust2 -maxplayers 24 -autoupdate +port 27015 -tickrate 100\ninto the target field, so now it says:\nC:GMODsrcds.exe -console -game Cstrike +map de_dust2 -maxplayers 24 -autoupdate +port 27015 -tickrate 100\nyou can go ahead and change these settings, if you want more/less players or another map to play. In any case\nyour server is now done and ready to use!\n\n\nIf you need further help, just ask in the comments of this torrent and I'll help you out.\n","torrent":{"xt":"urn:btih:37e53a2b0bb9ca4d847cb370d0fe86fa9805a1fb","amp;dn":"Counter+Strike+Source+Dedicated+Server","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37e53a2b0bb9ca4d847cb370d0fe86fa9805a1fb","infoHashBuffer":{"type":"Buffer","data":[55,229,58,43,11,185,202,77,132,124,179,112,208,254,134,250,152,5,161,251]},"announce":[],"urlList":[]}}