{"title":"Ry Cooder Boomer's Story","uid":7066523,"size":205052895,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:38151e1d04ba96aab173df7b7fc63fbdf34c8039&amp;dn=Ry+Cooder+Boomer%5C%27s+Story&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"akasyliphone","files":-1,"time":1330532834,"description":"Needledrop from 1982 West German press K44 224\n\nUsing Linn LP12, Lingo, Ekos and Dynavector XX2 moving coil cartridge, via a  Naim 62 pre-amp into Pioneer PDR-609 CDR, using TDK audio CD-R.\n\nArt work included.\n\nBoomer's Story, Ry Cooder's third record, continues his archeological dig through music's familiar and forgotten past. As was the case with his previous recordings, he not only looks to the masters -- including blues legend Sleepy John Estes, songwriter Dan Penn (both of whom appear here) and the great Skip James -- for material, but to lost and neglected pieces of American folk and blues, as well. Cooder adds the traditional title-track, which opens the album, and Lawrence Wilson's &quot;Crow Black Chicken,&quot; which dates back to the late 1920s, to this collection of discoveries -- both of which are handled with just the right balance of personality and reverence. Elsewhere, he injects a dark irony into the jingoistic &quot;Rally 'Round the Flag,&quot; with its slow, mournful piano (played by Randy Newman) and slide guitar, while the Joseph Spence-style guitar arrangement of the World War II standard &quot;Comin' in on a Wing and a Prayer&quot; has a sense of hope and conviction. Often criticized for possessing a less than commanding voice, Cooder steps back from the microphone for four of the album's ten tracks -- three instrumentals and one featuring Sleepy John Estes on his own &quot;President Kennedy.&quot; And while all of the instrumentals presented here are fine renditions of great tunes, it's &quot;Dark End of the Street&quot; which truly stands out. Here, Cooder realizes that the only thing in his arsenal that can do justice to James Carr's definitive version is his own remorseful slide guitar. Without uttering a single lyric, he's able to convey the shame and deep regret of the Dan Penn/Chips Moman classic. Thanks to moments like this, along with Cooder's consistently strong choice of material and brilliant guitar work, Boomer's Story -- less eccentric than his first, and less eclectic than Into the Purple Valley -- ranks among his best work ","torrent":{"xt":"urn:btih:38151e1d04ba96aab173df7b7fc63fbdf34c8039","amp;dn":"Ry+Cooder+Boomer%5C%27s+Story","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38151e1d04ba96aab173df7b7fc63fbdf34c8039","infoHashBuffer":{"type":"Buffer","data":[56,21,30,29,4,186,150,170,177,115,223,123,127,198,63,189,243,76,128,57]},"announce":[],"urlList":[]}}