{"title":"Sum and Substance; Criminal Procedure (5th ed) by Professor Jos","uid":5896861,"size":807806455,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3846dd9b9fe69835ad85d4d5e1d33741d9377a75&amp;dn=+Sum+and+Substance%3B+Criminal+Procedure+%285th+ed%29+by+Professor+Jos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nov1916","files":31,"time":1287528629,"description":"5th Edition - 2010\n\nStudy Any Time, Anywhere, With the Top Law Professors in the Country. With Sum &amp; Substance you get dynamic lectures from gifted law professors whose years of teaching experience enable them to express even the most complex ideas clearly and succinctly. Listen to lectures anywhere, at your convenience - while commuting, exercising, or even running errands.\n\nProfessor Joshua Dressler is the Edwin M. Cooperman Designated Professor of Law at Ohio State University College of Law. He has taught Criminal Law and Criminal Procedure for over 30 years, receiving &quot;Best Professor&quot; awards for teaching at various law schools. He is an internationally recognized scholar, author of widely adopted casebooks in the fields of criminal law and procedure, and is the author of student-popular treatises in both subject areas.\n\nCriminal Procedure by Professor Dressler introduces the Fourth Amendment and discusses retroactivity, harmless error, and incorporation. It includes an issue checklist and examines the Katz search doctrine. It analyzes various surveillance and search methods and covers the exclusionary rule, entrapment, interrogations, pretrial procedures, trial, and the right to counsel.","torrent":{"xt":"urn:btih:3846dd9b9fe69835ad85d4d5e1d33741d9377a75","amp;dn":"+Sum+and+Substance%3B+Criminal+Procedure+%285th+ed%29+by+Professor+Jos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3846dd9b9fe69835ad85d4d5e1d33741d9377a75","infoHashBuffer":{"type":"Buffer","data":[56,70,221,155,159,230,152,53,173,133,212,213,225,211,55,65,217,55,122,117]},"announce":[],"urlList":[]}}