{"title":"Coast to Coast AM February 24 2013","uid":8189851,"size":57354997,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:388cb65733b8c7d7e3452791c16afc17ac8c17d9&amp;dn=Coast+to+Coast+AM+February+24+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1361801532,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t02-24-13\nHost: \tGeorge Knapp\nGuests: \tRay Kurzweil, Lon Strickler\n\nIn the first half, George Knapp welcomed futurist Ray Kurzweil for a discussion on the merging of man and machine as well as his research into reverse engineering the human brain to understand precisely how it works. According to Kurzweil's estimate, the brain consists of 300 million &quot;pattern recognizers&quot; which assign these trends into hierarchies. This hierarchy ranges from simple patterns like shapes and sounds, at the low end, to more abstract concepts like irony, humor, and beauty, at the top. Driving the creation of this hierarchy, he said, are our own thoughts as we &quot;create one conceptual level at a time.&quot; By understanding how this process works, Kurzweil said, he now plans on designing computers which will utilize the same methodology.\n\nKurzweil observed that the envelopment of humanity by technology is not a fearful new development and contended that it is merely part of larger evolution of the species to &quot;transcend the limitations of biology.&quot; To that end, he dismissed concerns about the eventual augmentation of the body with technological devices and suggested that &quot;very, very few people will opt out&quot; when the opportunity becomes available. Additionally, he surmised that, much like there are a myriad of apps available for cell phones, there will be &quot;millions of choices&quot; for people to fuse technology with their body. Similarly, Kurzweil pointed to the ubiquity of cell phones as a sign that technologically augmenting the body will not be solely the domain of the wealthy. Ultimately, he stressed that machines are the creations of humans and, thus, are already &quot;part of who we are.&quot;\n\n--------------------------------------\n\nIn the latter half, Lon Strickler, paranormal researcher and creator of the website Phantoms and Monsters, talked about his Bigfoot encounter, the nature of ghosts, remote viewing, and the current state of paranormal research. As a collector of numerous reports concerning a wide range of paranormal phenomena, Strickler said that his goal is to &quot;give people the benefit of the doubt&quot; rather than pass judgement as to the veracity of their experiences. &quot;Some of the stories are pretty outrageous,&quot; he conceded, &quot;but my thought is, if the person did not think it was real, I don't think they would have contacted me.&quot; That said, Strickler explained that he usually tries to contact these witnesses before posting their story and, upon speaking to them, &quot;most of these people are very sincere&quot; about their paranormal experiences.\n\nRegarding his 1981 Bigfoot encounter, Strickler recounted being on a fly fishing trip in Maryland when he noticed a stray dog amongst the weeds and then heard it barking and growling. &quot;All of a sudden, this dark hairy creature was bobbing up and down in the thicket,&quot; Strickler said. The dog briefly grew silent and then let out a yelp, which appeared to startle the creature as it quickly stood up. &quot;It was about seven or eight feet tall and had dark matted hair on its body,&quot; he recalled. Unable to investigate further, since he'd been wearing waders into the water and couldn't follow the creature, Strickler returned to town and reported the sighting to the police. Oddly, he was told to return to the area, where he was amazed to see numerous state police cruisers and was subsequently told to get out of there.\nWebsite(s):\n\n    kurzweilai.net\n    Phantoms and Monsters\n\nBook(s):\n\n    How to Create a Mind\n    The Age of Spiritual Machines\n    Phantoms &amp; Monsters: Cryptid Encounters\n\n","torrent":{"xt":"urn:btih:388cb65733b8c7d7e3452791c16afc17ac8c17d9","amp;dn":"Coast+to+Coast+AM+February+24+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"388cb65733b8c7d7e3452791c16afc17ac8c17d9","infoHashBuffer":{"type":"Buffer","data":[56,140,182,87,51,184,199,215,227,69,39,145,193,106,252,23,172,140,23,217]},"announce":[],"urlList":[]}}