{"title":"Sun Ra - The Great Lost Sun Ra Albums (lossless True Audio)","uid":6320285,"size":511335615,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:38a4fbd9a372f72137303ad0c13c0158c9d5d732&amp;dn=Sun+Ra+-+The+Great+Lost+Sun+Ra+Albums+%28lossless+True+Audio%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nuovonadrachal","files":9,"time":1302926014,"description":"Format: True Audio (lossless)\n\nDisc: 1\n1. The World Of The Invisible\n2. Thoughts Under A Dark Blue Light\n3. The Order Of The Pharaonic Jesters\n4. The Mystery Of Two\n5. Land Of The Day Star\n\nDisc: 2\n1. Crystal Spears\n2. The Eternal Sphynx\n3. The Embassy Of The Living God\n4. Sunrise In The Western Sky\n\nThis two-CD set consists of two &quot;lost&quot; Sun Ra LPs, both recorded in 1973 and originally intended for release by Impulse Records. Cymbals, the first of them, emphasizes Sun Ra's organ and rhythm section playing at medium tempos with only one or two horn players at a time joining them. The great bassist Ronnie Boykins, whose flexible walking bass lines and creative bowed work were often obscured on recordings of the large band, is unusually prominent, with particularly good musical dialogue between him and Sun Ra (playing a rocksichord) on &quot;The Order of the Pharaonic Jesters.&quot; &quot;Thoughts under a Dark Blue Light,&quot; 16 minutes long, is a lumpy polyrhythmic blues that includes a masterpiece of sustained avant-blues playing by John Gilmore, a giant of the tenor saxophone who influenced Coltrane but rarely ventured out of the Arkestra.\n\nThe second CD, Crystal Spears, uses the horns more extensively, along with a battery of percussionists. Drummer Clifford Jarvis and two conga players often build up extraordinary polyrhythms at slow and medium tempos, and there's a processional or ceremonial feel to much of the music. Sun Ra's use of the mini-Moog synthesizer is particularly creative on the album's original title track. &quot;The Embassy of the Living God&quot; matches his dirgelike organ with the horns' brilliantly chaotic collective improvisation. There are fine solos throughout by trumpeter Akh Tal Ebah and the trio of Gilmore, Danny Davis, and Marshall Allan on reeds. The original LPs were mixed in Quadraphonic Sound, and Cymbals, like many Sun Ra recordings, has muddy sound and considerable mike distortion on Sun Ra's keyboards and the horns. Evidence Music has done heroic work in cleaning up the sound to the extent that they have. --Stuart Broomer (Amazon.com)\n","torrent":{"xt":"urn:btih:38a4fbd9a372f72137303ad0c13c0158c9d5d732","amp;dn":"Sun+Ra+-+The+Great+Lost+Sun+Ra+Albums+%28lossless+True+Audio%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38a4fbd9a372f72137303ad0c13c0158c9d5d732","infoHashBuffer":{"type":"Buffer","data":[56,164,251,217,163,114,247,33,55,48,58,208,193,60,1,88,201,213,215,50]},"announce":[],"urlList":[]}}