{"title":"Goths - A Guide to an American Subculture","uid":7925656,"size":3457265,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3ae49dd64a7b48e12cf0e5fa7d39560731dff2af&amp;dn=Goths+-+A+Guide+to+an+American+Subculture&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"imarion","files":-1,"time":1355577574,"description":"Micah L. Issitt, &quot;Goths: A Guide to an American Subculture&quot;\nISBN: 0313386048 | 2011 | PDF | 159 pages | 3 MB\n\n\nGoth culture is extremely diverse, touching on visual art, fashion, film, music, and body aesthetics. Goths: A Guide to an American Subculture offers a concise, easy-to-follow history of the subculture that explores its emergence and its impact on popular culture in the United States.\n\nThe book covers films, bands, and artists central to Goth culture, with emphasis on the Goth approach to fashion and body adornment. In addition, it discusses how America's Goth culture has influenced Goth populations elsewhere and how international developments have changed the U.S. Goth community. The volume is enriched with biographies of prominent Goth celebrities, such as Marilyn Manson and Robert Smith, as well as with interviews that offer readers a firsthand view of the culture. It concludes with an evaluation of Goth culture today, a look at what the future might hold, and a discussion of the significance of Goth culture to American society as a whole. ","torrent":{"xt":"urn:btih:3ae49dd64a7b48e12cf0e5fa7d39560731dff2af","amp;dn":"Goths+-+A+Guide+to+an+American+Subculture","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ae49dd64a7b48e12cf0e5fa7d39560731dff2af","infoHashBuffer":{"type":"Buffer","data":[58,228,157,214,74,123,72,225,44,240,229,250,125,57,86,7,49,223,242,175]},"announce":[],"urlList":[]}}