{"title":"Standup Comedy - Brian Posehn - Nerd Rage","uid":4319901,"size":89313871,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3ba5e10a25bc64abba9621c1d7cb6871269130d2&amp;dn=Standup+Comedy+-+Brian+Posehn+-+Nerd+Rage&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rambam1776","files":20,"time":1217372108,"description":"I finally got an invitation to join Demonoid, where my Google searches for torrents I cannot find here keep showing great stuff. I spent all last week grabbing comedy albums which I am now going to upload here. Other than going to the trouble of fixing tags and getting artwork and details, these torrents are as the original posters seeded them. I am not endorsing or recommending all of these. In fact, I think some of them suck. However, there is a major lack of well seeded comedy torrents here, and I hope to encourage more people to post new ones. Also, who says *MY* taste matches somebody elses? The reviews are from ALLMUSIC or from AMAZON. As usual, much thanks to the OPs who put these out and about.\n\nRambam1776\n\n\n\nBRIAN POSEHN ? NERD RAGE\n\nRambam1776 note ? possibly the stupidest and least funny commercial comedy album I have ever suffered through.\n\nReview by David Jeffries \nBalding, bitter potheads who love &quot;real&quot; heavy metal and Star Wars ? the real trilogy, not the ponderous prequel stuff ? never had a better friend than self-professed nerd Brian Posehn, a strange fellow you might recognize from his work on Just Shoot Me or Mr. Show (although his &quot;Gibbons&quot; creation on Adult Swim&amp;#039;s Tom Goes to the Mayor is his ultimate unsettling creation). The most surprising thing about Live In: Nerd Rage is that all the oddball character actor work and edgy writing Posehn is known for seems like moonlighting after hearing his conversational and perfectly at home standup delivery. Cynicism, downtrodden disgust with self, and a heaping portion of gross sleaze are all juggled effortlessly by the man, and while his delivery flows like he&amp;#039;s just talking with the guys, his act is tight and gives up more laughs per minute than most observational ramblers can offer. Being pop culture literate helps a lot, since references to the death metal band Deicide, the television show Space 1999, and the importance of &quot;Greedo shoots first&quot; might be lost on squares, but they welcome home Posehn&amp;#039;s target audience with arms wide open. Tacked onto the end of the disc are two numbers from his thrown-together metal supergroups, Posehn and Titannica. &quot;Metal by Numbers&quot; is the winner just because of its great &quot;Cookie! Cookie! Cookie!&quot; reference to death metal, and if you haven&amp;#039;t noticed yet, Live In: Nerd Rage was released by the edgy metal label Relapse, proving Posehn ain&amp;#039;t no nu-metal poser. If you like to laugh, own a crapload of black T-shirts, have repeatedly ruined rugs with bong water, and wear &quot;dork&quot; as a badge of honor, this is your new favorite album.\n\nTracks\n\n\n   1. Opening / I&amp;#039;m a Good Friend  1:28    \n   2. Dork for Thirty Years  3:12    \n   3. Married Life - Sorry Fat Dudes  5:17    \n   4. Puppy Time  2:58    \n   5. Religion&amp;#039;s Weird  2:05    \n   6. Movie Ruiners / the Unholy Trilogy  5:44    \n   7. Monkey Birthday  2:33    \n   8. Reunion  1:11    \n   9. No Dirty Magazines  1:29    \n 10. Show a Little Neck  1:54    \n 11. Late Night TV  2:32    \n 12. The News  1:39    \n 13. Quitting Pot  1:26    \n 14. Baby / Kitty Porn  3:18    \n 15. War&amp;#039;s Over / New Boobs  1:32    \n 16. Nerd Rage / the Mattress Story  2:57    \n 17. Yelling Stuff  4:57    \n 18. Metal By Numbers  4:18    \n 19. Titannica Interview  2:57    \n 20. Try Again, Again  4:54 \n \t\t ","torrent":{"xt":"urn:btih:3ba5e10a25bc64abba9621c1d7cb6871269130d2","amp;dn":"Standup+Comedy+-+Brian+Posehn+-+Nerd+Rage","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ba5e10a25bc64abba9621c1d7cb6871269130d2","infoHashBuffer":{"type":"Buffer","data":[59,165,225,10,37,188,100,171,186,150,33,193,215,203,104,113,38,145,48,210]},"announce":[],"urlList":[]}}