{"title":"Dave Cooper - Ripple A Predilection for Tina","uid":10211735,"size":51244668,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:3ccbd3c1b710d7167597eeadfbfbe0c7fa1509d4&amp;dn=Dave+Cooper+-+Ripple+A+Predilection+for+Tina&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1400922697,"description":"Ripple is, in fact, the collected Weasel issues 1-5. But it looks very different in this format.\n\n---------------------------------------------------------------------------\n\nRipple - A Predilection for Tina\nCarefully color-coded for maximum narrative clarity\nA Martin comicbook story\n\nDave Cooper\n\nFantagraphics, 2004 (this edition), 136 pages\n\nA tortured psychodrama about a painter who becomes obsessed with his model.\n\nRipple is a breakthrough graphic novel for Dave Cooper, creator of the wildly surreal and critically-acclaimed graphic novels Crumple and Suckle. Unlike those works, Ripple is a highly realistic story in terms of subject matter and drawing style. Martin is a floundering painter desperately attempting to pursue his fine art inclinations rather than toil in the world of commercial art. He hires a homely model, Tina, to pose for a series of &quot;erotic&quot; paintings that he hopes will be his breakthrough into the gallery world.\n\nOver time, Martin and Tina's relationship evolves from a tenuous working relationship to a confused sexual one. Martin's initial repulsion for Tina slowly turns to attraction and eventually lust, causing him to re-evaluate his own notions of beauty and sexuality. Meanwhile, Tina's own motives behind working for Martin are slowly turned upside down as well, building the book towards its inevitably explosive end. Throughout it all, Ripple is a complex love story poked and prodded from all angles, from Martin and Tina's physical and emotional feelings toward each other, Martin's dishonesty to himself, Tina's self-loathing, and everything in between. Sad, funny, and often uncomfortably titillating, Ripple is a remarkably introspective graphic novel, rendered with kinetic realism in a pen technique that calls to mind a more controlled Edward Sorel and Jules Feiffer. ","torrent":{"xt":"urn:btih:3ccbd3c1b710d7167597eeadfbfbe0c7fa1509d4","amp;dn":"Dave+Cooper+-+Ripple+A+Predilection+for+Tina","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ccbd3c1b710d7167597eeadfbfbe0c7fa1509d4","infoHashBuffer":{"type":"Buffer","data":[60,203,211,193,183,16,215,22,117,151,238,173,251,251,224,199,250,21,9,212]},"announce":[],"urlList":[]}}