{"title":"Networking (Prentice Hall 2nd Edition 2008)","uid":4451480,"size":22410343,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3d52daffcc51d88a69cfcdd8cf3be11103e8a5f0&amp;dn=Networking+%28Prentice+Hall+2nd+Edition+2008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chuckie6","files":1,"time":1224280120,"description":"Description / general overview :\n \nThis text provides a comprehensive look at computer networking from the point of view of the network administrator. It guides readers from an entry-level knowledge in computer networks to advanced concepts in Ethernet networks; router configuration; TCP/IP networks; local-, campus-, and wide-area network configuration; network security; optical networks; voice over IP; and industrial networks. Extensive examples on the Windows Server 2003/2008 configuration and system configuration for the Linux operating system are also included. A complete chapter is devoted to protecting and securing a network from potential network attacks. Topics include denial of service attacks, firewalls, intrusion detection, password cracking, packet sniffing, and analyzing unsecured data packets. Other key network security issues, such as configuring router access lists, configuring a virtual private network (VPN) connection, and securing wireless networks, are also covered. Router configuration is examined, ranging from an introduction to router configuration to configuring multiple routing protocols for intranet and Internet data traffic. Routing protocols key to basic network operations are examined, including static, RIP, IGRP, OSPF, EIGRP, and BGP. The discussions on routing protocols are accompanied with in-depth steps for configuring the router to run the protocol, verify operation, and troubleshoot the router. \n ","torrent":{"xt":"urn:btih:3d52daffcc51d88a69cfcdd8cf3be11103e8a5f0","amp;dn":"Networking+%28Prentice+Hall+2nd+Edition+2008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d52daffcc51d88a69cfcdd8cf3be11103e8a5f0","infoHashBuffer":{"type":"Buffer","data":[61,82,218,255,204,81,216,138,105,207,205,216,207,59,225,17,3,232,165,240]},"announce":[],"urlList":[]}}