{"title":"AfterFocus Pro v1.3.3","uid":9090968,"size":6025143,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:3d5ef91af807b1231de262730a80435af8612e59&amp;dn=AfterFocus+Pro+v1.3.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1382594741,"description":"\nWith AfterFocus, you can create DSLR-style background blurred photo by simply selecting focus area. \n\nAlso, various filter effects offer you to create the most natural and realistic photo.\nSelecting a focus area more precisely, you can achieve more natural and professional image.\n\nJust mark the areas you want, AfterFocus automatically recognizes the focus area precisely even for an object with complex shapes.\nThis auto function allows you to work faster on smart phones with small screen. \nAlso, background blur effect of AfterFocus gives a photo the realistic look between the edge of the background and the focus area.\n\nWith our realistic filter effects, you will enjoy photographing and photo editing even more, and share them on SNS easily.\n\n1. Smart focus area selection \nSimply draw some lines inside a focus area and the background, then AfterFocus will automatically recognize the focus area. You can also select the area with traditional finger painting.\n\n2. Background Blur effect \nYou can create the most realistic blur effect with various aperture styles just like DSLR camera. \nTo emphasize that certain things move, Motion blur effect is also available.\n\n3. Filter effect \nAfterFocus offers from basic effects to professional effects like Cross Process without looking artificial. \nAlso, you can emphasize the spot light on the background using Bokeh effect.\n\n4. Double photo\nTake a picture of one object and move slightly to the right to take another picture of the same object, and it will analyze the images and recognize the nearest object, so there is no need to draw the focus area. \n(Make sure that the background and the distance of the object are far enough and have clear texture to get a great result.)\n\n5. Easy share \nYou can share through e-mails and SNS easily and simply.\n\nWhat's New:\n\n1. Increase preview resolution for hi-res device\n2. Enhance final result image detail for large source image\n3. More filters\n4. Fix some license checking problems\n5. Improve overall performance\n6. Fix bugs while opening an image in Picasa Album\n7. Add Contrast Enhancement filter\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.motionone.afterfocus_pro&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.motionone.afterfocus_pro&lt;/a&gt;\n","torrent":{"xt":"urn:btih:3d5ef91af807b1231de262730a80435af8612e59","amp;dn":"AfterFocus+Pro+v1.3.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d5ef91af807b1231de262730a80435af8612e59","infoHashBuffer":{"type":"Buffer","data":[61,94,249,26,248,7,177,35,29,226,98,115,10,128,67,90,248,97,46,89]},"announce":[],"urlList":[]}}