{"title":"SuperHeavy - Miracle Worker(1)-a.mp3","uid":7300768,"size":4567631,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3d87db50fd3112ac9b51dea6d233169b8b2ffd39&amp;dn=SuperHeavy+-+Miracle+Worker%281%29-a.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"princerajgor","files":1,"time":1338032799,"description":"SuperHeavy is a supergroup consisting of Mick Jagger, \nJoss Stone, Dave Stewart, A. R. Rahman, and Damian Marley.\n\n\n\n\n&quot;Miracle Worker&quot;\nis the debut single by rock supergroup SuperHeavy from their self-titled debut studio album. It is a reggae/rock song performed by Damian Marley, Joss Stone, and Mick Jagger. It was released on 7 July 2011 as a digital download in the United Kingdom. The song peaked to number 136 on the UK Singles Chart but it was a big hit in Japan peaking at number 9...\n\nlyrics\n\n\n&quot;Miracle Worker&quot;\n\nNow this one reaching out to all the lovers who might be thinking of\nBreaking up... huh!\nOr maybe, making up... check it!\nI missed a part of you I can't get back.\nDon't be a Silly Nilly.\nI'm always here for you,\nThrough the thick and thin not just because we argue.\n\nSee I wanted to be true, but I can't do that.\nWhy not, what's stopping you? Don't be preposterous.\nI've got a lot of love, not just a lot of lust.\nIf I only wasn't a fool, I'd be loving.\nWell that's your own opinion, and you're entitled to it.\nI'll be lost in oblivion, if we don't continue through it.\n\nThere's nothing wrong with you I can't fix\nI come a runnin' with my little bag o' tricks.\nIn an emergency I'm very well prepared.\nMy scalpel, mask and gloves; don't ever get too scared\n\nOohooo, you're a Miracle Worker.\nOohooo, you're a surgeon of love. (you have a medical condition)\nOohooo, can't wait to fix me up.\nAnd I promise I'll be back again, if you work your miracles on me.\n\nYour mentality was fresh, it touched my soul.\nInvigorating and refreshing, and interesting, and it feels right.\nMy heart was drowning in stress, but you brought out the best in me\nLove has a tendency, so I've been told, and so it seems like.\n\nMy love and laser will regenerate your heart.\nNo need for anesthetics, I'll go check your charts.\nI will reshape you, recast you from the mold.\nA brand new beautiful woman will blossom from the old\n\nOohooo, you're a Miracle Worker.\nOohooo, you're a surgeon of love. (you have a medical condition)\nOohooo, can't wait to fix me up.\nAnd I promise I'll be back again\nIf you work your miracles on me.\n\nOohooo, you're a Miracle Worker.\nOohooo, you're a surgeon of love. (you have a medical condition)\nOohooo, can't wait to fix me up.\nAnd I promise I'll be back again\nIf you work your miracles on me.\n\n\n\nthanksssss","torrent":{"xt":"urn:btih:3d87db50fd3112ac9b51dea6d233169b8b2ffd39","amp;dn":"SuperHeavy+-+Miracle+Worker%281%29-a.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d87db50fd3112ac9b51dea6d233169b8b2ffd39","infoHashBuffer":{"type":"Buffer","data":[61,135,219,80,253,49,18,172,155,81,222,166,210,51,22,155,139,47,253,57]},"announce":[],"urlList":[]}}