{"title":"Finding Nemo Espanol-Spanish Only","uid":4177306,"size":782906630,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3e0b2bb4f819da5639555539535f8b28e41e16a3&amp;dn=Finding+Nemo+Espanol-Spanish+Only&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheLabMan","files":1,"time":1210201454,"description":"Marlin (a clown fish) is a widower who only has his son Nemo left of his family after a predator attack. Years later, on Nemo&amp;#039;s first day of school, he&amp;#039;s captured by a scuba diver and taken to live in a dentist office&amp;#039;s fish tank. Marlin and his new absent-minded friend Dory set off across the ocean to find Nemo, while Nemo and his tankmates scheme on how to get out of the tank before he becomes the dentist&amp;#039;s niece&amp;#039;s new pet.  Written by TonyB\n\nA clown fish named Marlin living in the Great Barrier Reef loses his son, Nemo, after he ventures into the open sea, despite his father&amp;#039;s constant warnings about many of the ocean&amp;#039;s dangers. Nemo is abducted by a boat and netted up and sent to a dentist&amp;#039;s office in Sydney. So, while Marlin ventures off to try to retrieve Nemo, Marlin meets a fish named Dory, a blue tang suffering from short-term memory loss. The companions travel a great distance, encountering various dangerous sea creatures such as sharks, anglerfish and jellyfish, in order to rescue Nemo from the dentist&amp;#039;s office, which is situated by Sydney Harbor. While the two are doing this, Nemo and the other sea animals in the dentist&amp;#039;s fish tank plot a way to return to Sydney Harbor to live their lives free again. Written by Anonymous\n\nA tale which follows the comedic and eventful journeys of two fish, the fretful Marlin and his young son Nemo, who are separated from each other in the Great Barrier Reef when Nemo is unexpectedly taken from his home and thrust into a fish tank in a dentist&amp;#039;s office overlooking Sydney Harbor. Buoyed by the companionship of a friendly but forgetful fish named Dory, the overly cautious Marlin embarks on a dangerous trek and finds himself the unlikely hero of an epic journey to rescue his son. Meanwhile, the young Nemo hatches a few daring plans of his own to return home safely. Written by Sujit R. Varma\n\nA father-son underwater adventure about a fish and his son Nemo, a boy clown fish, who is stolen from his home in the Great Barrier Reef, Australia, and taken to a fish tank in a dentist&amp;#039;s office in Sydney. His timid father and a blue tang fish named Dory with short-term memory loss must follow the East Australian current in order to get to Sydney and take Nemo home. Written by Anonymous ","torrent":{"xt":"urn:btih:3e0b2bb4f819da5639555539535f8b28e41e16a3","amp;dn":"Finding+Nemo+Espanol-Spanish+Only","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e0b2bb4f819da5639555539535f8b28e41e16a3","infoHashBuffer":{"type":"Buffer","data":[62,11,43,180,248,25,218,86,57,85,85,57,83,95,139,40,228,30,22,163]},"announce":[],"urlList":[]}}