{"title":"Herbie Mann - Sultry Serenade (1957) [Jazz][mp3 224][h33t][schon","uid":4858264,"size":66492908,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3e5f6ab4b07ddc133992881ff928e5411aaa7f38&amp;dn=Herbie+Mann+-+Sultry+Serenade+%281957%29+%5BJazz%5D%5Bmp3+224%5D%5Bh33t%5D%5Bschon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":13,"time":1240154756,"description":"Herbie Mann - Sultry Serenade\nVinyl\nOriginal Release Date: April 1, 1957 \nThe album was rereleased on a Cd in 1997\nBitrate: 224 kbps\n\nI write only to echo the sentiments of T. Ross, and dispel the notion inidcated by a 'music fan' that this album stinks. It's just about as entertaining as anything I've heard from the late, great Herbie Mann, with exciting instrumentation (extra reeds) and the stylish guitar work of the seriously underrated Joe Puma. \nI realize that reviews are subjective in nature, but there should be some objective considerations too. So don't give something 1 star because you feel it's out of date or it's not up your alley - not liking a certain type of music does not mean that an album objectively stinks. Such ratings do not help to inform listeners interested in jazz as to the true quality of the music being reviewed. ~ Benjamin I. Smith\n\nNotwithstanding the ridiculously low and unjustified rating the previous reviewer gave, this is a fine album. As Michael G. Nastos, All Music Guide, would have it: &quot;This date should not be forgotten as one of Herbie Mann's best.&quot; I'm inclined to side with Mr. Nastos; and listeners interested in learning more about the album should consult his review (and ignore the idiosyncratic and highly imaginative one-star review). \nWhile this album might not pack the dynamite of other Mann offerings, it needs to be in the collection of anyone interested in his work. Mann on the bass clarinet and Nimitz on the baritone sax offer what must be the definitive version of Carmichael's &quot;Lazy Bones&quot;. It is simply unparalleled in pathos conveyed. This is by no means the only excellent cut on the album, but I will defer to Nastos for the detailed review. This album has excellent musicianship and is a worthy showcase for Mann's lyricism.\n\nSultry Serenade may not justify full five stars, but I am going to rate on high-end (given the bum rap the album has been given). Sample the album yourself. You be the judge. ~ T.Ross\n\nHerbie Mann - Sultry Serenade Tracks:\n01  Let Me Tell You ( 4:28 )\n02  When The Sun Comes Out ( 4:58 )\n03  Professor (3:46)\n04  Lazy Bones (7:06)\n05  Sultry Serenade (5:03)\n06  Little Man You've Had A Busy Day (5:11)\n07  One Morning In May (4:05)\n08  Swing Till The Girls Come Home (4:52)\n\n","torrent":{"xt":"urn:btih:3e5f6ab4b07ddc133992881ff928e5411aaa7f38","amp;dn":"Herbie+Mann+-+Sultry+Serenade+%281957%29+%5BJazz%5D%5Bmp3+224%5D%5Bh33t%5D%5Bschon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e5f6ab4b07ddc133992881ff928e5411aaa7f38","infoHashBuffer":{"type":"Buffer","data":[62,95,106,180,176,125,220,19,57,146,136,31,249,40,229,65,26,170,127,56]},"announce":[],"urlList":[]}}