{"title":"Bostons.Finest.S01E03.HDTV.x264-EVOLVE","uid":8254618,"size":298517481,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:40738987d3dfc85d0ef3ef18bcce8fce95817fce&amp;dn=Bostons.Finest.S01E03.HDTV.x264-EVOLVE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Thhaque","files":1,"time":1363236996,"description":"Boston's Finest\n\nGenre: Reality-TV, Action, Crime, Drama, Family\nYear: 2013\nCountry: USA\nRuntime: 42 min\nProducer: N/A\nCast: N/A\n\n.: Plot :.\nWhen a committed young Boston detective stumbles upon a corruption ring within her own police department, she joins forces with a rogue ex-cop to expose the truth. These unlikely partners will work together to solve new crimes while slowly investigating the truth behind the crime ring. Promising young detective Julia Scott is nearly killed in the line of duty, but at the last minute, a mysterious stranger saves her life. The stranger turns out to be the last person Julia ever expected. Angus Martin is a legend in the Boston police department. A decorated cop, Angus was exposed as a crook and &quot;died&quot; attempting to escape justice. Apparently, he's not as dead as everyone thinks. How do you separate fact from fiction when someone who's supposed to be a brutal killer just saved your life?? At first, Julia is reluctant to believe Angus' story that he was framed and faked his own murder after discovering a major corruption ring in the Boston police department. But the more Julia looks into Angus' case, the more she begins to see that he was onto something. This rich, atmospheric new thriller from Richard Hatem (Supernatural) explores the intersection between right and wrong. Sometimes, when the truth is hidden in plain sight, you need to look at it from a new perspective. To expose the corruption ring, Julia and Angus will have to combine her access to the police with his connections to Boston's criminal underworld. Each week, they will solve new cases together, but can they uncover the truth behind the conspiracy that keeps them apart?\n","torrent":{"xt":"urn:btih:40738987d3dfc85d0ef3ef18bcce8fce95817fce","amp;dn":"Bostons.Finest.S01E03.HDTV.x264-EVOLVE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40738987d3dfc85d0ef3ef18bcce8fce95817fce","infoHashBuffer":{"type":"Buffer","data":[64,115,137,135,211,223,200,93,14,243,239,24,188,206,143,206,149,129,127,206]},"announce":[],"urlList":[]}}