{"title":"Andy Pratt - Same (1973) MP3@320","uid":9639834,"size":96714558,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:421c1d38ea96ae0cd8fe88005a1838e9604c8af6&amp;dn=Andy+Pratt+-+Same+%281973%29+MP3%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AaronVincent","files":13,"time":1392904289,"description":"Andy Pratt's self-titled album is a very quirky, idiosyncratic album that definitely establishes Pratt as a major force in the singer-songwriter arena. He also sounds very depressed as many of the song titles indicate (e.g. &quot;Inside Me Wants Out,&quot; &quot;So Fine, (It's Frightening)&quot;). However, this doesn't diminish the album's power or the particular style that is very much Pratt's own. The highlight of the album is the near-hit &quot;Avenging Annie.&quot; Sung mostly in Pratt's falsetto voice, it is a tale of a mythical heroine told from the woman's point of view. The fast piano technique is impressive, as are some other production touches (such as the cat sounds and descending guitar line). The song deserves its classic status hands down. The next number, &quot;Inside Me Wants Out,&quot; is in the running as one of the most dismal songs ever recorded, and could seriously be used as a study tool for a psychology class -- Sigmund Freud would have a field day with it. It also has a strong hook, and is another top-notch cut on the album. There is a strong jazz element in several of the songs, particularly &quot;Sittin' Down In The Twilight,&quot; with its almost funky trombone solo. Pratt's falsetto voice is also a strongly felt presence, though its sometimes shrill quality may not be to the liking of all. Though this album is not nearly as polished as Pratt's &quot;Resolution,&quot; and has a very different, more home-made feel, it is nearly as powerful.","torrent":{"xt":"urn:btih:421c1d38ea96ae0cd8fe88005a1838e9604c8af6","amp;dn":"Andy+Pratt+-+Same+%281973%29+MP3%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"421c1d38ea96ae0cd8fe88005a1838e9604c8af6","infoHashBuffer":{"type":"Buffer","data":[66,28,29,56,234,150,174,12,216,254,136,0,90,24,56,233,96,76,138,246]},"announce":[],"urlList":[]}}