{"title":"Lynda - Creative Inspirations: Bert Monroy, Digital Painter and ","uid":10953886,"size":813307839,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:430676efeb4c326578a23affda2081d97be73a62&amp;dn=Lynda+-+Creative+Inspirations%3A+Bert+Monroy%2C+Digital+Painter+and+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2boweb","files":14,"time":1409617027,"description":"Lynda.com - Creative Inspirations: Bert Monroy, Digital Painter and Illustrator\n53m 6s Appropriate for all Uploaded in Sept 2nd, 2014 via Webcentara\n\n\n\nRenowned artist Bert Monroy is known for his hyperrealistic style of extremely large format Photoshop illustrations. As an early adopter of digital imaging tools, he has been working with Photoshop since before it was released as a product by Adobe. He is the author of several books that showcase his illustrations and digital paintings, co-authored the very first book about Photoshop, and has authored numerous courses on photorealism for lynda.com. He is the former host of the long-running podcast Pixel Perfect with Bert Monroy, and an inductee of the Photoshop Hall of Fame. This installment of Creative Inspirations takes viewers inside the home studio and the personal world of this modern-day master. Watch as Bert adds the finishing touches to his largest digital image yet, a 25-foot wide digital illustration of New York's Times Square.\n\nIn Bonus Features, Bert talks about the differences between digital and traditional art and how he chooses reference material for his paintings.","torrent":{"xt":"urn:btih:430676efeb4c326578a23affda2081d97be73a62","amp;dn":"Lynda+-+Creative+Inspirations%3A+Bert+Monroy%2C+Digital+Painter+and+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"430676efeb4c326578a23affda2081d97be73a62","infoHashBuffer":{"type":"Buffer","data":[67,6,118,239,235,76,50,101,120,162,58,255,218,32,129,217,123,231,58,98]},"announce":[],"urlList":[]}}