{"title":"Charles Dickens - David Copperfield (Unabridged)","uid":4509082,"size":552237944,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:431bc7376872aa5d48f4f9e5b5bf62969e626b2d&amp;dn=Charles+Dickens+-+David+Copperfield+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dougietrotter","files":54,"time":1226702601,"description":"&quot;I have in my heart of hearts a favorite child. And his name is David Copperfield.&quot; Dickens's tender words about his 1850 novel invite us to enter into the world of David Copperfield, a young boy on a hero's journey. David's widowed mother marries a cruel man, and his wicked stepfather sends the child to a terrible boarding school. When his mother dies, David is dragged back home and forced into hard factory work. But, against all odds, David escapes the drudgery and danger of the factory and manages to find a home with his only relative, Aunt Betsy. True friends, comic misadventures, poignant losses, and encounters with one of Dickens's most famous villains (the dastardly Uriah Heep) await David as he grows up. A story full of moving scenes of childhood hardship that echo many of Dickens's own experiences, David Copperfield is the story of a young man who must learn to overcome tragedy and trust that real love and happiness may yet be his.\n\n\nCharles Dickens (1812-1870) was uniquely successful as a writer during his lifetime, enjoying huge followings from readers and audiences in England and America. When, early in life, sudden misfortune sent his family into extreme poverty, the young Charles was sent to work in a factory. Never forgetting this childhood misery, Dickens wrote often in later life about the plights of the working poor. As a young man he became a law clerk and stenographer, moving into journalism in the 1830s. Dickens's early journalistic sketches formed the basis for his first literary works. With the 1836 serialized publication of The Pickwick Papers, his unparalleled success as an author began. Dickens went on to write such famous novels as David Copperfield, Great Expectations, Barnaby Rudge, Hard Times, and Bleak House, with all of his works remaining in print to this day.\n\n\n","torrent":{"xt":"urn:btih:431bc7376872aa5d48f4f9e5b5bf62969e626b2d","amp;dn":"Charles+Dickens+-+David+Copperfield+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"431bc7376872aa5d48f4f9e5b5bf62969e626b2d","infoHashBuffer":{"type":"Buffer","data":[67,27,199,55,104,114,170,93,72,244,249,229,181,191,98,150,158,98,107,45]},"announce":[],"urlList":[]}}