{"title":"Love Sculpture (Dave Edmunds) - 2 Albums 1968-69","uid":3395484,"size":115146590,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:43e3851b4a03437025b811caf4360014f7023216&amp;dn=Love+Sculpture+%28Dave+Edmunds%29+-+2+Albums+1968-69&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"buzzard","files":21,"time":1129078336,"description":"Love Sculpture - 2 Albums 1968-69\n\nA British blues-rock band of the late '60s that, despite being very good, would normally be relegated to footnote status if it were not for the fact that the lead guitarist of this trio was the soon-to-be-famous Dave Edmunds. Like many similar bands of the times, Love Sculpture was really a showpiece for Edmunds' guitar-playing talents (which on the first LP are considerable), and little else. The covers are well-chosen, slightly revved-up, but mostly reverent versions of blues classics. They had a fluke hit in 1968 with a cover of the classical piece &quot;Sabre Dance,&quot; rearranged for guitar. After two LPs, Love Sculpture split up in 1970. Edmunds went on to solo success (&quot;I Hear You Knockin'&quot;) and a long, sometimes contentious relationship with ex-Brinsley Schwarz bassist Nick Lowe, which culminated in the great band Rockpile. Still, Love Sculpture, though slightly dated, is a hoot to listen. And Edmunds, full of youthful bravado and dazzling technique, certainly knows his way up and down a fret board.\n\nsize:      109 mb\nbitrate:   192\n\nBlues Helping 1968\nAbsolutely stunning album by Dave Edmunds and friends. Asked by the record company to record a blues album, Edmunds, who never played blues before, totally immersed himself in blues records &amp; came out with this amazing piece of work. Sounds like he'd been playing the blues his whole life. If you love the blues, it would be worthwhile to seek this out!\n\n1. The Stumble\n2. 3 O'Clock Blues\n3. I Believe To My Soul\n4. So Unkind\n5. Summertime\n6. On The Road Again\n7. Don't Answer The Door\n8. Wang Dang Doodle\n9. Come Back Baby\n10. Shake Your Hips\n11. Blues Helping\n\nForms And Feelings 1969\nThere is no doubt that Mr. Edmunds is a great guitar player, you just need to listen to the covers of classical music that he made: &quot;Farandole&quot; of Bizet &quot;Mars&quot; of Holst and &quot;Sabre Dance&quot; of Khachaturian. And when he decides to deal with blues, which is his natural style, is also very successful, like he does in Chuck Berry's &quot;You Can't Catch Me&quot;.\nIn the rest of the album Dave Edmunds uses effectively known resources to include in his songs. So you will find lots of Beatles musical phrases, vocal arrangements and recording techniques distributed along the tracks. Just an example: pay attention to the similitude in the beginning of &quot;Why (How Now)&quot; with &quot;I Want To Tell You&quot;, and the use of delayed tapes in the same track.\n\n1. In The Land Of The Few\n2. Seagull\n3. Nobody's Talking\n4. Why\n5. Farandole\n6. You Can't Catch Me\n7. People People\n8. Mars\n9. Sabre Dance","torrent":{"xt":"urn:btih:43e3851b4a03437025b811caf4360014f7023216","amp;dn":"Love+Sculpture+%28Dave+Edmunds%29+-+2+Albums+1968-69","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43e3851b4a03437025b811caf4360014f7023216","infoHashBuffer":{"type":"Buffer","data":[67,227,133,27,74,3,67,112,37,184,17,202,244,54,0,20,247,2,50,22]},"announce":[],"urlList":[]}}