{"title":"Between Good and Evil by Roger L. Depue.epub","uid":8890780,"size":276151,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:43e457f77cdc94ec4f7e48a489546a483678da48&amp;dn=Between+Good+and+Evil+by+Roger+L.+Depue.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":1,"time":1378578922,"description":"Between Good and Evil: A Master Profiler's Hunt for Society's Most Violent Predators\n\nBy Roger L. Depue, Susan Schindehette\nPublished by Grand Central Publishing in 2013\nTags: nonfiction\nEPUB, Retail, 527 pages, English (0446586544)\n\nHe was a pioneer in modern law enforcement, a trailblazing leader in the hunt for serial killers. But after decades of staring deep into the darkness, he entered a seminary to search for the good... BETWEEN GOOD AND EVIL No one gets closer to evil than a criminal profiler, trained to penetrate the hearts and minds of society's most vicious psychopaths. And no one is a more towering figure in the world of criminal profilers than Roger L. Depue. Chief of the FBI Behavioral Science Unit at a time when its innovative work first came to prominence, he headed a renowned team of mind hunters that included John Douglas, Robert Ressler, and Roy Hazelwood. In a subbasement sixty feet under the Academy gun vault in Quantico, he broke new ground with analytical techniques and training programs that are still used today. After retiring from the FBI, he founded an elite forensics group that consulted on high-profile cases, including the Martha Moxley and JonBenet Ramsey murders, and the Columbine school shootings. But coming face-to-face with the darkest deeds human beings are capable of took a horrific toll. After suffering a devastating personal loss, Depue, on the brink of despair, walked away from the outside world and joined a seminary. For three years this was his safe haven, a place where he exorcised personal demons and found a refuge from terrifying memories of real-life monsters. And it was there, while counseling maximum security inmates, that he rediscovered the capacity for goodness in people, and made the decision to return to the world to resume his work. Here is Depue's extraordinary personal account, from growing up as a police officer's son to tracking down some of today's most brutal murderers. With its harrowing descriptions of human depravity and passionate call to fight against evil, BETWEEN GOOD AND EVIL is both a riveting dispatch from the front lines of a war against human predators...and the powerful story of one man's journey between darkness and redemption.","torrent":{"xt":"urn:btih:43e457f77cdc94ec4f7e48a489546a483678da48","amp;dn":"Between+Good+and+Evil+by+Roger+L.+Depue.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43e457f77cdc94ec4f7e48a489546a483678da48","infoHashBuffer":{"type":"Buffer","data":[67,228,87,247,124,220,148,236,79,126,72,164,137,84,106,72,54,120,218,72]},"announce":[],"urlList":[]}}