{"title":"Blue.Thunder.1983.Dvd5.NLsub+Multisub","uid":10389917,"size":4688520527,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:440415fce67dff47c303ed9daec5f79076a8dd71&amp;dn=Blue.Thunder.1983.Dvd5.NLsub%2BMultisub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"hendriknld","files":17,"time":1403185345,"description":"Blue Thunder  is een special ontwikkelde helikopter. Hij wordt gebruikt voor politiewerk, maar is gewapend en ontworpen om objecten met precisie te volgen. De maker wil laten zien wat de heli kan, maar moet een LAPD-agent trainen om te vliegen en er zo voor te zorgen dat de politie met de heli kan opereren in de stad. Al gauw ontdekt de maker dat ze veel meer met de heli van plan zijn.\n\nBlue Thunder is a 1983 action thriller film that features a high-tech helicopter of the same name. The movie was directed by John Badham and stars Roy Scheider.  A spin-off television series also called Blue Thunder lasted 11 episodes in 1984 \n\nFrancis McNeil &quot;Frank&quot; Murphy (Roy Scheider) is a Los Angeles Police Department (LAPD) helicopter-pilot-officer and troubled Vietnam War veteran with Post Traumatic Stress Disorder (PTSD). His newly assigned field partner is Richard Lymangood (Daniel Stern). The two patrol Los Angeles at night and give assistance to police forces on the ground.\nMurphy is selected to pilot the world's most advanced helicopter, nicknamed &quot;Blue Thunder&quot;, a military-style combat helicopter intended for police use in surveillance and against large-scale civic disobedience. With powerful armament, stealth technology that allows it to fly virtually undetected, and other accoutrements (such as infrared scanners, powerful microphones and cameras, and a U-Matic VCR), Blue Thunder appears to be a formidable tool in the war on crime.\nBut when the death of city councilwoman Diane McNeely turns out to be more than just a random murder, Murphy begins his own covert investigation. He discovers that a subversive action group is intending instead to use Blue Thunder in a military role to quell disorder under the project codename THOR (for &quot;Tactical Helicopter Offensive Response&quot;), and is secretly eliminating political opponents to advance their agenda.\nMurphy suspects the involvement of his old wartime nemesis, former United States Army Colonel F.E. Cochrane (Malcolm McDowell), the primary test pilot for Blue Thunder. Murphy and Lymangood use Blue Thunder to record a meeting between Cochrane and the other government officials which would implicate them in the conspiracy. After landing, Lymangood secures the tape and hides it, but is captured upon returning to his home, interrogated, and killed while trying to escape. Murphy steals Blue Thunder and arranges to have his girlfriend Kate (Candy Clark) retrieve the tape and deliver it to the local news station, using the helicopter to thwart her pursuers.\nTwo Air National Guard F-16 fighters are released to deal with Murphy, but he manages to shoot one down and evade the other until the operation is suspended. Cochrane, disobeying orders to stand down, confronts Blue Thunder in a heavily armed Hughes 500 helicopter, and after a tense battle, Murphy is able to shoot him down by executing a spectacular 360Â° loop through use of Blue Thunder's turbine boost function. Murphy then destroys Blue Thunder by landing it in front of an approaching freight train, having deemed the tactical helicopter too dangerous to be used by anyone else.\n","torrent":{"xt":"urn:btih:440415fce67dff47c303ed9daec5f79076a8dd71","amp;dn":"Blue.Thunder.1983.Dvd5.NLsub%2BMultisub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"440415fce67dff47c303ed9daec5f79076a8dd71","infoHashBuffer":{"type":"Buffer","data":[68,4,21,252,230,125,255,71,195,3,237,157,174,197,247,144,118,168,221,113]},"announce":[],"urlList":[]}}