{"title":"Muonium-antimuonium Oscillations - (Malestrom)","uid":6376601,"size":764769,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:45025547f883377b0d801ba84b5b93faac51ad33&amp;dn=Muonium-antimuonium+Oscillations+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"malestrom_HH","files":-1,"time":1304878684,"description":"Muonium-antimuonium Oscillations in an Extended Minimal Supersymmetric Standard Model\n1st Edition. edition (March 1, 2011) | ISBN: 1441983295 | 67 pages | PDF \n\nThis innovative work investigated two models where the muonium-antimuonium oscillation process was mediated by massive Majorana neutrinos and sneutrinos. First, we modified the Standard Model only by the inclusion of singlet right-handed neutrinos and allowing for general renormalizable interactions producing neutrino masses and mixing. The see-saw mechanism was employed to explain the smallness of the observed neutrino masses. A lower bound on the righthanded neutrino mass was constructed using the experimental limits set by the nonobservation of the muonium-antimuonium oscillation process. Second, we modified the Minimal Supersymmetric Standard Model by the inclusion of three right-handed neutrino superfields. The experimental result of the muonium-antimuonium oscillation process generated a lower bound on the ratio of the two Higgs field VEVs. This work helps to set up relationships between the experimental result of the muonium-antimuonium oscillation process and the model parameters in two specific models. Further improvement of the experiment in the future can generate more stringent bounds on the model parameters using the procedure developed by this work.","torrent":{"xt":"urn:btih:45025547f883377b0d801ba84b5b93faac51ad33","amp;dn":"Muonium-antimuonium+Oscillations+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45025547f883377b0d801ba84b5b93faac51ad33","infoHashBuffer":{"type":"Buffer","data":[69,2,85,71,248,131,55,123,13,128,27,168,75,91,147,250,172,81,173,51]},"announce":[],"urlList":[]}}