{"title":"THREE CLASSIC  BRITISH FILMS  3","uid":6422423,"size":1994343322,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4638eb7a74f86351459860137bc9d7b32cff5fc2&amp;dn=THREE+CLASSIC++BRITISH+FILMS++3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"OLDLIMEY4","files":3,"time":1306344716,"description":"I have not been in England for 49yrs. I have been collecting Films for years and now I want to share. Enjoy and don,t forget to SEED. SEED SEED. Thank you.\n\n\nGenevieve is a 1953 British comedy film produced and directed by Henry Cornelius and written by William Rose. It starred John Gregson, Dinah Sheridan, Kenneth More and Kay Kendall as two couples comedically involved in a vintage automobile rally. The musical score was composed and performed by Larry Adler with dance numbers by Eric Rogers.\n\nPassport to Pimlico is a 1949 British comedy film made by Ealing Studios and starred Stanley Holloway, Margaret Rutherford, and Hermione Baddeley. It was directed by Henry Cornelius.\n\nThe Lavender Hill Mob is a 1951 comedy film from Ealing Studios, written by T.E.B. Clarke, directed by Charles Crichton, starring Alec Guinness and Stanley Holloway and featuring Sid James and Alfie Bass. The title refers to Lavender Hill, a street in Battersea, a district of South London, in the postcode district SW11, near to Clapham Junction railway station.","torrent":{"xt":"urn:btih:4638eb7a74f86351459860137bc9d7b32cff5fc2","amp;dn":"THREE+CLASSIC++BRITISH+FILMS++3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4638eb7a74f86351459860137bc9d7b32cff5fc2","infoHashBuffer":{"type":"Buffer","data":[70,56,235,122,116,248,99,81,69,152,96,19,123,201,215,179,44,255,95,194]},"announce":[],"urlList":[]}}