{"title":"Gov't Mule - Live with a Little Help from Our Friends (Atlant","uid":4736152,"size":356216320,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:46a5115cca130d052343c6f61fb8d7a90cc11823&amp;dn=Gov%5C%27t+Mule+-+Live+with+a+Little+Help+from+Our+Friends+%28Atlant&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"chadathan","files":21,"time":1235299123,"description":"\nGov't Mule's arsenal of endless jams that somehow perpetually build in intensity make it natural that this Southern power trio has so quickly returned to the live-record format. The Mule's second concert recording in four years is as virile as the title is impotent. Recorded in Atlanta on New Year's Eve, 1998, this four-disc collector's edition will please fans who weren't satiated by the original 145-minute two-CD set. With a Little Help serves as a road map through their array of influences, as the band wends its way through Black Sabbath, Humble Pie, Free, Elmore James, Traffic, and Neil Young &amp; Crazy Horse before settling in for the night at the John Coltrane Inn for a half-hour of &quot;Afro Blue.&quot; Despite all this prime cover material, the highlight may still be Warren Haynes's original &quot;Soulshine&quot; (first recorded while Haynes and bassist Allen Woody were with the Allman Brothers), a gritty and spiritual Muscle Shoals soul number that finds Haynes bouncing guitar licks off young Derek Trucks while the unlikely keyboard tandem of Bernie Worrell and Chuck Leavell dig in behind them. The steady stream of guests--including former Black Crowes guitarist Marc Ford, former ARU guitarist Jimmy Herring, and reed man Randall Bramblett--keeps things moving along, but in truth, Haynes, Woody, and drummer Matt Abts hardly need any help generating incendiary, densely packed music. This powder keg is a mission statement and a mission accomplished all in one wrapper.","torrent":{"xt":"urn:btih:46a5115cca130d052343c6f61fb8d7a90cc11823","amp;dn":"Gov%5C%27t+Mule+-+Live+with+a+Little+Help+from+Our+Friends+%28Atlant","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46a5115cca130d052343c6f61fb8d7a90cc11823","infoHashBuffer":{"type":"Buffer","data":[70,165,17,92,202,19,13,5,35,67,198,246,31,184,215,169,12,193,24,35]},"announce":[],"urlList":[]}}