{"title":"Delinquent_Habits-Freedom_Band_(Retail)-2003-0MNi","uid":8491160,"size":83890978,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:46cc81a09161f016758cd525034d438d3d1a865c&amp;dn=Delinquent_Habits-Freedom_Band_%28Retail%29-2003-0MNi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":17,"time":1369005795,"description":"The fourth album from this Latin rap band is definitely a party album. Starting with &quot;Straight Up,&quot; the group mixes a contemporary sound with traces of Latin horns and guitars. It brings to mind what Gerardo could have evolved into, but also brings to mind Oh Carolina by Shaggy. The duo of Kemo and Ives complement each other perfectly on the funky title track. It also contains some Arabic vocal samples in the background. The ensuing &quot;Info.&quot; continues with the upbeat and danceable atmosphere, as a basic guitar riff provides the basis for the song. Taking snippets of the Lesley Gore track of the same name, &quot;U Don't Own Me&quot; takes the record down a notch or two in terms of energy. One of the better songs is the midtempo &quot;This Right Here,&quot; which relies on a horn sample to carry the melody. &quot;Nighttime Play&quot; sounds too aimless, though, and suffers as a result. The ability to take different genres and coherently combine them is difficult, but the flamenco guitar on &quot;Everyday&quot; sounds completely logical. The key to the album, though, is the creativity oozing from DJ O.G. Style. Although prominent throughout the album, his &quot;O.G. Scratch&quot; is just a sample of what he is capable of. The Miranda rights are explored through different eyes on the highly addictive &quot;I Can't Forget It,&quot; an ode to street life and the criminal justice system. &quot;Hey Tell 'Em&quot; resorts to a '70s funk rhythm that Average White Band mastered long ago, but it still packs a good sonic punch. Only on &quot;Take It All Away&quot; does Delinquent Habits use a hard yet theatrical backbeat in the vein of Eminem to deliver its message. Concluding with the tango flavor of &quot;The Last Song,&quot; the band will gain more fans from this solid effort. ~ Jason MacNeil Recorded at Sweatshop Studio, Norwalk, California. Recording information: The Sweatshop, Norwalk, CA. Illustrator: Ives. Delinquent Habits: Ives, Kemo (vocals); O.G. Style.","torrent":{"xt":"urn:btih:46cc81a09161f016758cd525034d438d3d1a865c","amp;dn":"Delinquent_Habits-Freedom_Band_%28Retail%29-2003-0MNi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46cc81a09161f016758cd525034d438d3d1a865c","infoHashBuffer":{"type":"Buffer","data":[70,204,129,160,145,97,240,22,117,140,213,37,3,77,67,141,61,26,134,92]},"announce":[],"urlList":[]}}