{"title":"Ubalda, All Naked and Warm  [XviD - Ita Ac3]","uid":4136350,"size":1307668480,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:49241cbc881de4dddaa26acd74e26dae5770c617&amp;dn=Ubalda%2C+All+Naked+and+Warm++%5BXviD+-+Ita+Ac3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"circlensess","files":1,"time":1208285174,"description":"Quel Gran Pezzo Dell&amp;#039;Ubalda Tutta Nuda E Tutta Calda [XviD - Ita Ac3] \n &lt;a href=&quot;\nhttp://img364.imageshack.us/img364/9398/quel20gran20pezzo20dellxd1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img364.imageshack.us/img364/9398/quel20gran20pezzo20dellxd1.jpg&lt;/a&gt;\n\n\nPlot Summary: During the Middle Ages, a clumsy knight returns home where his wife awaits him. Sensuous and beautiful...\n &lt;a href=&quot;\nhttp://imdb.com/title/tt0070583/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imdb.com/title/tt0070583/&lt;/a&gt;\n\nAnother goofy Edwige Fenech sex comedy, 26 March 2007\nAuthor: lazarillo \n\nA sex-starved knight returns from war and gets in a feud with the local miller, which both men try to resolve by attempting to seduce the other&amp;#039;s wife (played respectively by Edwige Fenech and Karin Schubert). They are stopped, partly by a pair of locked steel chastity belts, but mostly by their own stupidity, as these contraptions certainly don&amp;#039;t prevent practically every other man in town--the local stud, the lecherous priest, the horny doctor, and the crafty locksmith--from cuckolding them both repeatedly.\n\nThis period sex comedy was no doubt inspired partly by the German sex comedies lead Edwige Fenech had earlier appeared in, but mostly by &quot;The Decameron&quot; (probably the hit Passolini movie more than the classic Boccacio book). Owing to the &quot;Decameron&quot; influence, it&amp;#039;s more pointed and satirical and thus little better than the moronic German movies--and the version I saw had the benefit of having subtitles instead of being clumsily dubbed into English by the usual gang of idiots. Still it&amp;#039;s pretty tame. There is a lot of nudity, but it&amp;#039;s all above the waist (fortunately, Fenech, Schubert, and their other female co-star Gabriella Giorgelli were all pretty impressive in that department).\n\nStill it&amp;#039;s a pretty slight movie--the most interesting thing about is the extras on the new DVD: There is a bizarre and trippy psychedelic montage of all Fenech&amp;#039;s boob-bouncing nude scenes from the movie (which might save the weasel-milkers out there some time). There&amp;#039;s some Italian trailers from Fenech&amp;#039;s various &quot;Sexy Schoolteacher&quot; movies (which look even dumber than this one). And there is a strange excerpt from a longer interview with the still gorgeous Fenech where she gushes over Quentin Tarantino, which is not only ironic but kind of irrelevant here since this is probably the one genre of films she appeared in that ole Q.T. has not ripped off yet. (Give him time though). This is definitely worth a look for Edwige Fenech stalkers and Bocaccio completists, but for anyone else, well. . .","torrent":{"xt":"urn:btih:49241cbc881de4dddaa26acd74e26dae5770c617","amp;dn":"Ubalda%2C+All+Naked+and+Warm++%5BXviD+-+Ita+Ac3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49241cbc881de4dddaa26acd74e26dae5770c617","infoHashBuffer":{"type":"Buffer","data":[73,36,28,188,136,29,228,221,218,162,106,205,116,226,109,174,87,112,198,23]},"announce":[],"urlList":[]}}