{"title":"The  Protector  SKIDROW","uid":9113499,"size":3476360281,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:49e3fa881cf751d06ac9c35e3caa1339830c63e7&amp;dn=The++Protector++SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"esharoth","files":-1,"time":1382992310,"description":"SKiDROW\nTHE LEADiNG FORCE\nproudly presents\nThe Protector / Gingerbread Studios\n\nRELEASE DATE : 02-07-2009\nGAME TYPE : Shooter\nPROTECTION : Nothing\nDISKS : 1 DVD\n\nRelease Notes:\nOur freedom, our very way of life, hangs in the balance! Scarlet Vengeance, a fanatical terrorist faction is searching for an ancient artifact of devastating power with which to destroy the planet's most historic peace conference and impose its will on mankind. But before the terrorists can find the artifact they must find the one person who knows its whereabouts: beautiful US archeologist Jennifer Guile.\n\nHired to protect Jennifer is elite British mercenary Jonathan Kane. Hunted by Scarlet Vengeance, Kane and Jennifer must combine their skills to stay one step ahead of their enemies and destroy the artifact before it falls into the terrorists hands.\n\nPacked with action, suspense, intrigue, love and betrayal, The Protector is a searing first-person shooter featuring some of the most visceral fire-fights yet seen and stunning stealth interludes. The thrilling plot unravels through eye-popping in-game and cinematic cutscenes that immerse you in a living, breathing world where danger lurks around every corner, where you are the free world's only hope for survival.\n\nOutsmart and outmaneuver your enemies during tense, tactical stealth missions.\n\nUtilize cover as you engage highly trained, heavily armed enemies in some of the most intense and tactical combat yet seen!\n\nBattle your foes in a living, breathing world, which responds to your actions with stunning realism.\n\nInstall Notes:\n1. Unpack release\n2. Mount image or burn it\n3. Install game\n4. Play the game","torrent":{"xt":"urn:btih:49e3fa881cf751d06ac9c35e3caa1339830c63e7","amp;dn":"The++Protector++SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49e3fa881cf751d06ac9c35e3caa1339830c63e7","infoHashBuffer":{"type":"Buffer","data":[73,227,250,136,28,247,81,208,106,201,195,94,60,170,19,57,131,12,99,231]},"announce":[],"urlList":[]}}