{"title":"Category 6 (2004)(dvd5)(Nl subs) RETAIL SAM TBS","uid":8838047,"size":4682054917,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4bf9465a7dc420ebb4adcfb764b9f2ea85ccf81e&amp;dn=Category+6+%282004%29%28dvd5%29%28Nl+subs%29+RETAIL+SAM+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":8,"uploader":"Sammynet","files":-1,"time":1377176668,"description":"Category 6: Day of Destruction (2004)\n\nDutch\nDrie wervelstormen trekken een spoor van verwoesting door Las Vegas. Cyclonen\nteisteren de kust van Florida. Het noordoosten van de VS zucht onder een hittegolf\ndie zijn weerga niet kent. Stormen razen door het zuiden. Bliksemflitsen verlichten\nde hemel en overal breken branden uit. Amy Harkin is een beginnende anchorwoman uit\nChicago die hoopt op haar grote doorbraak. Ze is als de dood voor deze natuurrampen,\nen nog meer voor de onvermijdelijke gevolgen: stroomuitval in het hele land en steeds\nminder capaciteit om de boel weer te herstellen. Overbelasting van het resterende\nstroomnet zou het hele land kunnen lamleggen. De hele bevolking zou dan in het donker\nzitten, afgesloten van de rest van de wereld en blootgesteld aan de vreselijkste gevaren.\n\nEnglisch\nOf all of the ways humankind can destroy the planet, none can hold a candle to the\nawe-inspiring and earth-shattering power of Mother Nature. As chief meteorologist for\nthe National Weather Service's Storm Prediction Center, Andy Goodman (Brian Dennehy)\nhas seen his share of storms. Now, just days shy of his eagerly anticipated retirement,\nGoodman is disturbed to discover three separate storm fronts approaching Chicago: a\ncluster of tornados from the west, a warm storm front from the south, and an Arctic\nsystem from the north. As Goodman enlists the aid of his longtime storm-chasing friend\n&quot;Tornado Tommy&quot; (Randy Quaid) in tracking the storms, ambitious Chicago television\nreporter Amy Harkin (Nancy McKeon) is busy researching the mysterious drought and record\nheat wave that has plagued the city for nearly six weeks. Though the citizens of Chicago\nare warned to reduce their energy consumption by secretary of energy Shirley Abbott\n(Dianne Wiest) the Windy City is thrust into darkness when severe thunderstorms destroy\nthe city's main power-generating plant. With no means to warn the outside world of the\ndangers fast approaching, Harkin and Midwest Electric chief of operations Mitch Benson\n(Thomas Gibson) must race against time to get the word out to citizens and emergency\nworkers before the snowballing blackout causes a complete collapse of the entire North\nAmerican power grid.\n\nSpot Information\nSource............: RETAIL\nFormaat...........: DVD5\nVideo.............: PAL / 16:9\nAudio.............: Dolby Digital 5.1, DTS\nGenre.............: Action / Drama / Sci-Fi\nSubs..............: Dutch\nMenu..............: Yes\njaar uitgave......: 2004\nCover &amp; label.....: Yes\nAudio.............: Englisch\nSpeelduur.........: 175 minutes\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0428144/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0428144/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/30401&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/30401&lt;/a&gt;\n\nSeeden wordt op prijs gesteld, om deze torrent in leven te houden\n\nDon`t quit after you finished the download, but keep seeding.","torrent":{"xt":"urn:btih:4bf9465a7dc420ebb4adcfb764b9f2ea85ccf81e","amp;dn":"Category+6+%282004%29%28dvd5%29%28Nl+subs%29+RETAIL+SAM+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bf9465a7dc420ebb4adcfb764b9f2ea85ccf81e","infoHashBuffer":{"type":"Buffer","data":[75,249,70,90,125,196,32,235,180,173,207,183,100,185,242,234,133,204,248,30]},"announce":[],"urlList":[]}}