{"title":"Cox-Lincoln's Negro Policy(why he freed all black slaves)(193","uid":4549526,"size":282922,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4c45d4cfea29a0448cc4c32b6e29fc491918b264&amp;dn=Cox-Lincoln%5C%27s+Negro+Policy%28why+he+freed+all+black+slaves%29%28193&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":6,"uploader":"red_gonzo","files":1,"time":1228250261,"description":"This is Earnest Sevier Cox&amp;#039;s shocking booklet Lincoln&amp;#039;s Negro Policy (1938) which outlines US President Abraham Lincoln&amp;#039;s support for the &quot;back to Africa&quot; scheme supported by a great number of coloured people in the USA. Lincoln is held up by the Establishment as an icon of racial equality, although he spoke of &quot;inferior&quot; and &quot;superior&quot; races. Few Americans realize that the Statue of Liberty was a gift of friendship from France to the United States, and that the slogan &quot;Give me your tired, your hungry, etc.&quot; was inscribed on the plinth much later. The original statue had nothing to do with immigration as the slogan was added only after Ellis Island became an immigration transit station. Just who exactly freed the slaves and why? Every American will correctly suggest that Abraham Lincoln did it and that the idea was to make American citizens out of the Negroes. As this controversial booklet points out, nothing could be further from the truth. Lincoln only freed the slaves so that they could be repatriated back to Africa. Several times he spoke out against racial integration and vociferously condemned the idea of having Negro American citizens. He is quoted as saying &quot; ....I say....in addition to this that there is a physical difference between the white and black races which I believe will forever forbid the two races living together on terms of social and political equality.&quot; Lincoln&amp;#039;s Negro Policy fills in the gaps the regular history books leave out. Find out what was the true purpose behind much propagandized liberation of all black slaves in America. 145 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:4c45d4cfea29a0448cc4c32b6e29fc491918b264","amp;dn":"Cox-Lincoln%5C%27s+Negro+Policy%28why+he+freed+all+black+slaves%29%28193","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c45d4cfea29a0448cc4c32b6e29fc491918b264","infoHashBuffer":{"type":"Buffer","data":[76,69,212,207,234,41,160,68,140,196,195,43,110,41,252,73,25,24,178,100]},"announce":[],"urlList":[]}}