{"title":"Fallout Tactics DVD with update and no-cd patch","uid":4563102,"size":1952288852,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4c4a6ca516a914b0837bd3e82ef797da18df86f9&amp;dn=Fallout+Tactics+DVD+with+update+and+no-cd+patch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Fox_Almighty","files":5,"time":1228760937,"description":"Fallout Tactics (aka Fallout 2.5)\n\nThis was originally a 3 CD install, I converted it to 1 DVD. I also included the Patch and Crack inside the DVD and outside the DVD for convenience purposes.\n\nNot one thing is missing and not one thing is taken out so don't complain that a file is missing or w/e (example: BOS file). I carefully checked and double checked everything to make sure that the total file size and number of files were the same as the original game cds. If for some messed up reason a file doesn't get copied correctly, then just look for it in the DVD image/drive or try re-downloading this torrent (maybe you had a bad connection and got faulty transfered file pieces).\n\nTested for install while mounted and tested for install while burnt to DVD-R (Nero 6 to make the image and alcohol 120% to burn) (no copy protection found)\n\n\n\n\n- Install game (full)\n- Go in the dvd and look for &quot;0o_PATCH AND CRACK_o0&quot; \n- Install the update patch (version 1.27)\n- Copy-Paste &quot;SERENiTY&quot; in the game directory\n- Install SERENiTY (it's a no-cd/dvd crack)\n- Unmount DVD or take DVD out of the drive\n- PLAY THE GAME\n\nEnjoy\n\n\n\n\nNotes: \n\nIf it don't work, then carefully re-think everything you did cuz you most likely screwed up... especially if you're new at this and think you're a god and don't need to follow instructions. Also make sure to read the comments posted before repeating what has already been said.\n\nSome ppl have said it works on a 64bit OS, let me know if it doesn't.\n\nOne more thing, I've had this copied game for years now and I've never had any problems with it... the only thing I did different recently was converting it to DVD and adding the update and no-cd patch, but like I said, I fully tested and I'm still able to continue my game where I left off.\n\n\nSome ppl might accidently delete a shared .dll file from windows while uninstalling another program and that would prevent the Serenity file from working in windows XP. Here's the solution that 2 ppl confirmed it to solve the issue:\n\nStep 1: go to: http://www.dll-files.com/dllindex/dll-files.shtml?msvcr71\nStep 2: Download the msvcr71.dll\nStep 3: Put the msvcr71.dll in C:WINDOWSsystem directory\nStep 4: Install game with patch\nStep 5: The Serenity crack should work now","torrent":{"xt":"urn:btih:4c4a6ca516a914b0837bd3e82ef797da18df86f9","amp;dn":"Fallout+Tactics+DVD+with+update+and+no-cd+patch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c4a6ca516a914b0837bd3e82ef797da18df86f9","infoHashBuffer":{"type":"Buffer","data":[76,74,108,165,22,169,20,176,131,123,211,232,46,247,151,218,24,223,134,249]},"announce":[],"urlList":[]}}