{"title":"Michael J. Sheehy - No Longer My Concern [2002][EAC,log,cue. FLA","uid":8385432,"size":356525917,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4e1560fe18ffc77e46b90c117e3c15ae8dca4d22&amp;dn=Michael+J.+Sheehy+-+No+Longer+My+Concern+%5B2002%5D%5BEAC%2Clog%2Ccue.+FLA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":14,"time":1366280234,"description":"Artist: Michael J. Sheehy\nRelease: No Longer My Concern\nDiscogs: 838279\nReleased: 2002-07-10\nLabel: Beggars Banquet\nCatalog#: BBQCD 229\nFormat:  FLAC / Lossless / Log (100%) / Cue / CD\nCountry: UK\nStyle: Rock, Blues Rock\n\nTracklisting:\n\n01. Distracting Yourself From The Doom (4:11)\n02. Donkey Ride Straight To Hell (3:54)\n03. Dark Country Moment (4:45)\n04. Mary, Bloody Mary 1 (4:52)\n05. Ballad Of The Pissed Apostle (6:52)\n06. Pigboy (3:08)\n07. Teardrop Time (4:56)\n08. Modest Beauty (4:38)\n09. Mary, Bloody Mary 2 (3:46)\n10. Pretty Little Bouquets (3:46)\n11. Swing Low (4:02)\n12. Twisted Little Man (15:01)\n\n\nTrue to form, Michael J. Sheehy's third solo album isn't a particularly happy affair. If, after Sweet Blue Gene and Ill Gotten Gains, it seemed that things couldn't possibly get any worse for the self-proclaimed &quot;short, bald fella,&quot; No Longer My Concern proves otherwise. Here, he continues down a murky, confessional path, spinning tales of excessive boozing, sordid sex, self-loathing, and all-consuming ennui. As with Sheehy's previous records, stripped-down rock &amp; roll, swamp blues, and some deceptively beautiful ballads provide a soundtrack to the dark night of his tortured soul. This is indeed black mood music and, by Sheehy's own admission, these songs are often personal, but, as usual, his self-deprecating humor and wicked sense of irony save them from becoming maudlin. With its cool, finger-snapping rockabilly beat and sassy female backing vocals, &quot;Donkey Ride Straight to Hell&quot; is a case-in-point, chronicling the experience of being dumped for a better-endowed suitor. Similarly tongue-in-cheek, &quot;Pigboy&quot; simmers with bluesy self-hatred (&quot;When I catch my reflection/I don't like what I see,&quot; complains Sheehy). In Sheehy's quieter moments, his moody melodies and soulful crooning have prompted comparisons with arch miserablists like Tindersticks; such comparisons are borne out by the haunted, slow-burning &quot;Teardrop Time&quot; and the brooding &quot;Dark Country Moment.&quot; Sheehy has always had a flair for acoustic numbers with a distinctly hymnal feel and this album offers further evidence of that talent, especially on &quot;Distracting Yourself From the Doom,&quot; with its lilting piano and standup bass. While No Longer My Concern doesn't diminish Sheehy's reputation as a singer/songwriter with a distinctive noir sound and vision, it could be argued that his routine is wearing a little thin. Still, this is the last album in a trilogy and, hopefully, subsequent projects will see him expand his repertoire a little. \nAMG","torrent":{"xt":"urn:btih:4e1560fe18ffc77e46b90c117e3c15ae8dca4d22","amp;dn":"Michael+J.+Sheehy+-+No+Longer+My+Concern+%5B2002%5D%5BEAC%2Clog%2Ccue.+FLA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e1560fe18ffc77e46b90c117e3c15ae8dca4d22","infoHashBuffer":{"type":"Buffer","data":[78,21,96,254,24,255,199,126,70,185,12,17,126,60,21,174,141,202,77,34]},"announce":[],"urlList":[]}}