{"title":"InTheCrack E377 Sasha Rose Full HD 1080p","uid":12283552,"size":2051113650,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:4f44ca39aa2c07879803bec30d30c3f65f1bf539&amp;dn=InTheCrack+E377+Sasha+Rose+Full+HD+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"pornboy89","files":4,"time":1440447494,"description":"..:::ScreenShots:::..\n &lt;a href=&quot;\nhttp://imgnemo.com/?g=996164&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgnemo.com/?g=996164&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgnemo.com/?v=951733&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgnemo.com/?v=951733&lt;/a&gt;\n\nAudio: wmav2, 44100 Hz, stereo, 128 kb/s\nVideo: wmv3, yuv420p, 1920x1080, 8000 kb/s, 29.97 fps\n\n\nSasha Nice Little Ass. 7:52\nTiny teen Sasha Rose strikes a few poses while standing naked outside of the bathtub. The majority of this features a lot of low angle views looking up her spread pussy and ass. Her hands perform a lot of butt massaging motions giving you a non stop ogle up her spread bits as they open up.\n\n\nOne Size fits Small. ITC Favorite 8:44\nSize perspectives don't add up in this clip as tiny Sasha buries our biggest dildo deep in her pussy with relative ease. The toy is literally bigger than her arm. She pumps it in her pussy as if it were nothing and often pulls it all the way out between strokes. The lighting and clarity are excellent with every pore seen with perfect detail. She works it up to a fairly noisy and enthusiastic climax with traces of pussy juice foam gathering around the outside of her pussy. After she's done with the dildo there's a very nice pussy spread and then she looks super cute just sitting in the tub with her pussy held open at the end of this clip.\n\n\nIt's Half Bath Sex in the Mooning. ITC Favorite 14:09\nNow with the bath half full of water Sasha poses and plays around with the soapy suds and pours water all over herself with a glass jug. If you like the look of soap and water pouring over a girl's pussy and ass you will certainly get your fill of it here. Outside of the first few minutes Sasha poses bending over with her ass in the air with liquid soap and water pouring down her crack for the remainder of the clip. Sasha's wet skin glistens with brilliant clarity and her undercarriage looks totally gorgeous in this bend over position.\n\n\nKing Dong was Here. 2:44\nYou see Sasha leaning back on the edge of the bathtub with a speculum gaping her pussy wide open. There's just one position here with full body views on either side of a close up inside view","torrent":{"xt":"urn:btih:4f44ca39aa2c07879803bec30d30c3f65f1bf539","amp;dn":"InTheCrack+E377+Sasha+Rose+Full+HD+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f44ca39aa2c07879803bec30d30c3f65f1bf539","infoHashBuffer":{"type":"Buffer","data":[79,68,202,57,170,44,7,135,152,3,190,195,13,48,195,246,95,27,245,57]},"announce":[],"urlList":[]}}