{"title":"Everything Explained That Is Explainable - (2016).epub Gooner","uid":15011227,"size":67928927,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f903dc09b39aabd924681672f58dfffe5e333db&amp;dn=Everything+Explained+That+Is+Explainable+-+%282016%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1466430078,"description":"Everything Explained That Is Explainable - On the Creation of the Encyclopedia Britannica's Celebrated Eleventh Edition, 1910-1911 (2016).epub Gooner\r\n\r\nPublisher: Knopf Publishing Group (7 Jun. 2016)\r\nLanguage: English\r\nISBN-10: 0307269175\r\nISBN-13: 978-0307269171\r\n\r\nThe publication of the Eleventh Edition of the &quot;Encyclopedia Britannica&quot; in 1911 marked the last stand of the Enlightenment and a turbulent end to an era. The Eleventh Edition summed up the high point of optimism and belief in human progress that dominated Anglo-Saxon thought from the time of the Enlightenment. \r\n\r\nEagerly embraced by hundreds of thousands of middle-class Americans, the Eleventh Edition was read as a twenty-nine-volume anthology of some of the best essays written in English. Among the names of those who contributed to it's volumes: T. H. Huxley, Algernon Swinburne, Bertrand Russell; it was the work of 1,500 eminent contributors and was edited by Hugh Chisholm, charismatic star editor. \r\n\r\nThe &quot;Britannica&quot; combined scholarship and readability in a way no previous encyclopedia had or ever has again. Within less than a decade after it's publication, the Edwardian worldview was at an end: the unsinkable White Star &quot;Titanic&quot; had sunk on its maiden voyage; Archduke Franz Ferdinand was assassinated and the Great War had begun. \r\nIn &quot;Everything Explained That Is Explainable, &quot; Denis Boyles tells the audacious, improbable story of twentieth-century American hucksterism and vision that resurrected a dying &quot;Encyclopedia Britannica&quot; by means of a floundering London&quot; Times,&quot; and writes of how it's astonishing success changed publishing and produced the &quot;Britannica's&quot; Eleventh Edition, still the most revered all 44 million words of English-language encyclopedias, considered by many to be the last great work of the age of reason.\r\n\r\nThe author writes of the man whose inspiration it was: Horace Everett Hooper, American entrepreneur who stumbled into the book business at sixteen on a hunch that he could make money selling inexpensive editions of classics by direct mail to isolated settlers scattered across the American West. Hooper found an outdated set of reference books gathering dust in a warehouse, bought them for almost nothing, repackaged them, and sold them on credit as one-shelf libraries to farmers concerned about their children s education in frontier schools; his Western Book and Stationery Company became one of the largest publishers in the Midwest, sending books directly to readers, bypassing traditional booksellers, and inventing a model that was forever after emulated . . . \r\n\r\nBoyles writes that Hooper and his partner, Henry Haxton, a former Hearst reporter and ingenious adman, came across the &quot;Encyclopedia Britannica,&quot; published by Adam &amp; Charles Black, whose Ninth Edition's final volume, published in 1890, was seen by many as the height of English intellectual achievement. The Ninth had everything an encyclopedia needed. Except readers. \r\n\r\nHooper and Haxton came up with a new market for the encyclopedia's next two editions, which they planned to produce, and approached the then-struggling London &quot;Times, &quot; which became their publishing partner. \r\n\r\nBoyles tells the outlandish, bumpy tale of the making of the Eleventh; of the young staff of university graduates working with fanatical conviction (40,000 entries by 1,500-odd contributors), scattered around the globe . . . more than 200 members of the Royal Society or fellows of the British Academy; diplomats; government officials; officers of learned societies . . . contributions by the most admired writers, thinkers, and scientists of the day; of their scheme to sell the Eleventh Edition and of the storm that erupted around its publication and after. \r\n\r\n&quot;An extraordinary tale of American know-how, enterprise, and spirit.&quot;","torrent":{"xt":"urn:btih:4f903dc09b39aabd924681672f58dfffe5e333db","amp;dn":"Everything+Explained+That+Is+Explainable+-+%282016%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f903dc09b39aabd924681672f58dfffe5e333db","infoHashBuffer":{"type":"Buffer","data":[79,144,61,192,155,57,170,189,146,70,129,103,47,88,223,255,229,227,51,219]},"announce":[],"urlList":[]}}