{"title":"1913: The Year Before the Storm (2013) Florian Illies (multi)","uid":9421975,"size":11526740,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:50085b502719668ace74f4672c8fe92e9455c573&amp;dn=1913%3A+The+Year+Before+the+Storm+%282013%29+Florian+Illies+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":-1,"time":1388606203,"description":"1913: The Year Before the Storm by Florian Illies*\n\n\n*Translated from German by Shaun Whiteside and Jamie Lee Searle.\n\nFormat: mobi/epub/azw3\nLength: 304 pages\nGenre: History\nDate: 29 October 2013\n\nA witty yet moving narrative worked up from sketched documentary traces and biographical fragments, 1913 is an intimate cultural portrait of a world that is about to change forever.\n\nThe stuffy conventions of the nineteenth century are receding into the past, and 1913 heralds a new age of unlimited possibility. Kafka falls in love; Louis Armstrong learns to play the trumpet; a young seamstress called Coco Chanel opens her first boutique; Charlie Chaplin signs his first movie contract; and new drugs like cocaine usher in an age of decadence. In a Munich hotel lobby, Rilke and Freud discuss beauty and transience; Proust sets out in search of lost time; and while Stravinsky celebrates the Rite of Spring with industrial cacophony, in Munich an Austrian postcard painter by the name of Adolf Hitler sells his conventional cityscapes.\n\nYet everywhere there is the premonition of ruin - the number 13 is omnipresent, and in London, Paris, Vienna, Berlin, Trieste, artists take the omen and act as if there were no tomorrow, their brief coincidences of existence telling of a darker future.\n\nTold with Illies's characteristic mixture of poignant evocation and laconic irony, 1913 is the story of the year that shaped the last century.\n\nAuthor:\n\nFlorian Illies is a German journalist who has worked for major European newspapers and magazines and cofounded the art magazine Monopol. He is the author of four previous bestselling books, which have sold more than 1 million copies. 1913 is his first book to be translated into English.\n","torrent":{"xt":"urn:btih:50085b502719668ace74f4672c8fe92e9455c573","amp;dn":"1913%3A+The+Year+Before+the+Storm+%282013%29+Florian+Illies+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50085b502719668ace74f4672c8fe92e9455c573","infoHashBuffer":{"type":"Buffer","data":[80,8,91,80,39,25,102,138,206,116,244,103,44,143,233,46,148,85,197,115]},"announce":[],"urlList":[]}}