{"title":"StepSiblingsCaught - Angel Smalls The High Life 28-December-2015","uid":13108383,"size":266918741,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:5026413a867c132b252c3d538e7d20c5daf58ada&amp;dn=StepSiblingsCaught+-+Angel+Smalls+The+High+Life+28-December-2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SudoSu","files":1,"time":1451410225,"description":"\nhttp://youpornbook.com\r\n------------------------------------------------------------\r\n             ....... : Screenshots : .......    \r\n------------------------------------------------------------ \nhttp://imgpremium.com/album/9x\r\n\r\n------------------------------------------------------------\r\n                ....... : Info : .......    \r\n------------------------------------------------------------\r\nThe name of the actress: Angel Smalls\r\nName movie: The High Life\r\nNPP site and the site: StepSiblingsCaught.com / NubilesNetwork.com\r\n\r\nYear: 2015\r\nGenre: Small Boobs, Shaved Pussy, Short Girls, Blonde, Long hair, Bras, Hardcore, Petite, Girl-Boy, Blowjob, Deep Throat, Girls Finishing the Job\r\nDuration: 00:26:45\r\n\r\nVan Wylde has snuck into Angel Smalls' bedroom to acquire video evidence of his stepsister getting high. When she asks what she can do to keep Van from ratting her out, he asks her to make a sexy video telling a friend of theirs that she likes him. She kicks Van out, but he spies on her as she strips down and makes her sexy video. It's so hot that Van can not help but whip it out and masturbate.\r\n\r\nWhen Angel catches Van jerking it to her, she flips out. Van claims that now that only way to keep him from telling is for her to take care of his stiffie. She protests at first, but eventually agrees to go through with it. After starting out with a blowjob, Angel lays back on the bed and spreads her legs so that he can slam into her petite body.\r\n\r\nDriving his stepsister to one climax is not enough for Van. He orders Angel up onto her hands and knees, and the blonde happily obliges. Pushing her rump backwards, she impales herself on Van's cock and then takes her turn doing all the work pumping him in and out of her while he stands still and lets her set the pace. When Angel gradually falls to the bed, Van finally starts thrusting his hips to keep her pussy pulsing.\r\n\r\nClimbing onto the bed, Van gets on his back so that Angel can once again take the lead by delivering a booty-bouncing fuck. He could watch her tender ass quiver forever as she works her hips up and down in deep long strokes, and Angel obliges by giving him one hell of a show. When she turns around to continue her stiffie ride in cowgirl style, Van gets an equally tantalizing chance to watch her small boobs bounce.\r\n\r\nWith Angel's final orgasm in the books, it's her turn to get Van off. She makes it happen with her soft hands until he loses his load all over her bald twat. Angel's afterglow is cut short when Van slaps his cock on her puss, an act that she finds so heinous that she kicks him out of the bedroom.\r\n\r\nVideo Quality: SiteRip\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 640x360 29.97fps 1240kbps\r\nAudio: AAC 44100Hz stereo 82kbps","torrent":{"xt":"urn:btih:5026413a867c132b252c3d538e7d20c5daf58ada","amp;dn":"StepSiblingsCaught+-+Angel+Smalls+The+High+Life+28-December-2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5026413a867c132b252c3d538e7d20c5daf58ada","infoHashBuffer":{"type":"Buffer","data":[80,38,65,58,134,124,19,43,37,44,61,83,142,125,32,197,218,245,138,218]},"announce":[],"urlList":[]}}