{"title":"The.Great.British.Bake.Off-S06E09-Chocolate-360p","uid":12514717,"size":353846598,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:504e0345f58636390934aaba38c751702307464e&amp;dn=The.Great.British.Bake.Off-S06E09-Chocolate-360p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"uggauga","files":2,"time":1443652500,"description":"With subtitles - enjoy the semi-finals !!!\r\n_______________________________________________________\r\n\r\nChocolate\r\nThe Great British Bake Off, Series 6 Episode 9 of 11\r\n\r\nWeek Nine, and that can only mean one thing - it's the semi-finals. The pressure is on as the remaining bakers must get to grips with the one of the most difficult ingredients - chocolate.\r\n\r\nFirst up is the signature challenge, where the bakers must revisit their old friend pastry - only this time it has to be chocolate pastry for a chocolate tart. Mirror glazes, tempered chocolate and peanuts abound as Paul and Mary work their way through ganaches, mousse, caramel and the occasional fruit flavouring.\r\n\r\nIf the pressure of the semi-finals wasn't enough, Mary adds to it by setting a technical challenge that's so quick it needs a staggered start, which puts all the bakers on edge. Perplexed and confused, they find that matters get no better when they discover they have to make a chocolate souffle. As the tension mounts, who can keep a cool head and deliver a well-risen and beautifully light souffle?\r\n\r\nAnimals and architecture take centre stage as the bakers get artistic and create spectacular chocolate centrepieces for their showstopper. The judges want something that not only looks good, but tastes good too. With a place in the final at stake, there's no room for error. Who will make it through, and who will fall at the last hurdle?","torrent":{"xt":"urn:btih:504e0345f58636390934aaba38c751702307464e","amp;dn":"The.Great.British.Bake.Off-S06E09-Chocolate-360p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"504e0345f58636390934aaba38c751702307464e","infoHashBuffer":{"type":"Buffer","data":[80,78,3,69,245,134,54,57,9,52,170,186,56,199,81,112,35,7,70,78]},"announce":[],"urlList":[]}}