{"title":"The Britannica Guide to Baseball, Basketball, Football [Gooner]","uid":12074912,"size":50517336,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:50a09ef36bb747d98d0f9e33f46036e0949f0761&amp;dn=The+Britannica+Guide+to+Baseball%2C+Basketball%2C+Football+%5BGooner%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":4,"time":1435613568,"description":"Publisher: Rosen Education Service (August 15, 2011)\nLanguage: English\nISBN-10: 1615305211\nISBN-13: 978-1615305216\n\nIntegral to the consciousness of the American people, the sport of baseball has become a steadfast institution in a nation whose identity is constantly evolving. Although the game has undergone its own share of changes since it first took center stage, baseball has maintained an unwavering devotion among fans and players alike. This comprehensive volume details the rules of baseball, introduces some of its key personalities, and examines the historical role of the game as it changed both the recreational and social landscapes of the country.\n\n**************************************************\n\nPublisher: Rosen Education Service (August 15, 2011)\nLanguage: English\nISBN-10: 1615305289\nISBN-13: 978-1615305285\n\nDespite its American origins, the fast-paced and often acrobatic game of basketball commands the attention of audiences around the world. The sports seeming simplicity put the ball in the basketis delightfully offset by the complexity of the athleticism and strategy required to be successful at the game. Recounting the evolution of basketball and profiling greats from George Mikan to Larry Bird, Michael Jordan, and beyond, this gripping volume examines the story of a game that continues to dazzle American and global audiences alike.\n\n**************************************************\n\nPublisher: Rosen Education Service (August 15, 2011)\nLanguage: English\nISBN-10: 1615305246\nISBN-13: 978-1615305247\n\nFrom Europes rugby and soccer evolved a truly American sport. Played across the United States at parks, schools, universities, and in stadiums, football is as much a part of Americas iconographic experience as apple pie. Emerging from college campuses, it has blossomed to become a popular form of recreation throughout the country, as well as a professional-sports juggernaut. This detailed narrative examines the history of gridiron football, including the teams and players that have helped make it a national obsession","torrent":{"xt":"urn:btih:50a09ef36bb747d98d0f9e33f46036e0949f0761","amp;dn":"The+Britannica+Guide+to+Baseball%2C+Basketball%2C+Football+%5BGooner%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50a09ef36bb747d98d0f9e33f46036e0949f0761","infoHashBuffer":{"type":"Buffer","data":[80,160,158,243,107,183,71,217,141,15,158,51,244,96,54,224,148,159,7,97]},"announce":[],"urlList":[]}}