{"title":"Frank Zappa - You Can't Do That On The Stage Anymore, Vol.2 T","uid":5157270,"size":761015839,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:50bee8885a369b66c8479842740a455ba5d7d2de&amp;dn=Frank+Zappa+-+You+Can%5C%27t+Do+That+On+The+Stage+Anymore%2C+Vol.2+T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zootallure","files":41,"time":1257931017,"description":"In his contract with Ryko, Frank Zappa had to put together 12 CDs worth of live material for the series You Can't Do That on Stage Anymore. The fact that he decided to devote two of them (all of Vol. 2) to a Helsinki concert from 1974 illustrates how good and representative he thought it was -- and he was right. This two-CD set features the 1973-1974 band (Napoleon Murphy Brock, George Duke, Ruth Underwood, Tom Fowler, Chester Thompson) near the end of their tour, in a concert in faraway Finland on September 22, 1974 (there were actually two concerts performed that day and, as usual, Zappa edited the best moments together). The set list comes mostly from the Roxy &amp; Elsewhere repertoire, except that here the songs are taken at a faster tempo and free of the overdubs found on the original album. &quot;Echidna's Arf (Of You)&quot; and &quot;Don't You Ever Wash That Thing?&quot; are very exciting, but without the vocal overdubs &quot;Cheepnis&quot; feels empty. But the treats lie elsewhere, as in the playful &quot;Inca Roads&quot; (Zappa used the guitar solo from this concert for the One Size Fits All version); &quot;RDNZL,&quot; still a work-in-progress at the time; the unreleased &quot;Approximate&quot; (including hilarious stage craziness); and &quot;T'Mershi Duween.&quot; The band is in great shape, Zappa being particularly witty and good-humored. When a member of the audience requests the Allman Brothers song &quot;Whipping Post,&quot; he spontaneously rewrites the lyrics to &quot;Montana&quot; -- and backup vocalists Brock and Duke have to adapt! For fans of the man's complex, progressive rock-tinged music of the mid-'70s, this is a must-have, even though it also contains very average moments (&quot;Dupree's Paradise,&quot; for instance). Sound quality is very good, superior to any bootleg from this period.\n\n\n\n\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:                            &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)\t","torrent":{"xt":"urn:btih:50bee8885a369b66c8479842740a455ba5d7d2de","amp;dn":"Frank+Zappa+-+You+Can%5C%27t+Do+That+On+The+Stage+Anymore%2C+Vol.2+T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50bee8885a369b66c8479842740a455ba5d7d2de","infoHashBuffer":{"type":"Buffer","data":[80,190,232,136,90,54,155,102,200,71,152,66,116,10,69,91,165,215,210,222]},"announce":[],"urlList":[]}}