{"title":"Savants maudits, chercheurs exclus - Volume 4","uid":13566111,"size":1032429,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:50ecc3ba63611b67a844f46a81f6af35439270f0&amp;dn=Savants+maudits%2C+chercheurs+exclus+-+Volume+4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"asperge","files":2,"time":1455624345,"description":"Pierre Lance, &quot;Savants maudits, chercheurs exclus&quot;- Vol. 4\r\nPublisher : Guy trédaniel | 2010 | ISBN : 2813201391 | French | EPUB | 318 pages | 1 Mb\r\n\r\nAu sommaire de Savants maudits Chercheurs exclus Tome 4 :\r\n\r\nViktor Schauberger - Naturaliste autrichien qui découvrit dans les années trente comment produire une énergie égalant 127 fois celle obtenue par les moyens classiques. Aujourd’hui méconnu.\r\n\r\nEmilia Masson - Archéologue française qui découvrit dans le massif du Mercantour les traces d’un très antique culte religieux. On dégrada le site pour la discréditer.\r\n\r\nAndré Berthier - Archéologue français qui trouva à La Chaux-des-Crotenoy le site authentique de la bataille d’Alésia. Il mourut sans avoir réussi à faire triompher la vérité historique.\r\n\r\nJean Elmiger - Médecin homéopathe suisse qui mit au point la méthode «homéopathie séquentielle». Malgré l’accumulation des preuves de validité, il se heurte à l’hostilité du corps médical.\r\n\r\nJean Laigret - Médecin et bactériologiste français qui parvint à fabriquer du pétrole à partir de cultures bactériennes. Son invention est demeurée inexploitée à ce jour.\r\n\r\nYvette Parès - Docteur en sciences et en médecine qui devint praticienne des thérapies traditionnelles africaines et prouva leur efficacité contre la lèpre, le paludisme et le sida. En vain.\r\n\r\nMarcel Violet - Ingénieur français inventeur d’un traitement électrovibratoire de l’eau dynamisant l’agriculture ou la santé humaine. ? Jamais reconnu par la science «officielle».\r\n\r\nRaoul Estripeaut - Professeur français d’anthropologie pathologique qui inventa un remède anticancéreux très efficace à base d’enzymes pancréatiques, méprisé par les cancérologues.\r\n\r\nArthur Vernes - Médecin français vainqueur de la syphilis qui créa en 1920 un des meilleurs tests de dépistage précoce du cancer, ainsi qu’un traitement efficace, tous deux oubliés.\r\n\r\nMatthias Rath - Médecin allemand créateur du concept de médecine cellulaire et spécialiste de la vitaminothérapie. Bête noire de la « nomenklatura » médicale qu’il défie sur Internet.\r\n\r\nFélix d’Hérelle - Médecin québécois qui fit carrière en France et inventa un excellent traitement des maladies infectieuses par des virus bactériophages. Mondialement connu puis oublié.\r\n\r\nHulda Clark - Doctoresse canadienne spécialiste en physiologie cellulaire, qui a traité plus de 2000 cancers et accompli six mois de prison aux États-Unis avant d’être libérée sur un non-lieu","torrent":{"xt":"urn:btih:50ecc3ba63611b67a844f46a81f6af35439270f0","amp;dn":"Savants+maudits%2C+chercheurs+exclus+-+Volume+4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50ecc3ba63611b67a844f46a81f6af35439270f0","infoHashBuffer":{"type":"Buffer","data":[80,236,195,186,99,97,27,103,168,68,244,106,129,246,175,53,67,146,112,240]},"announce":[],"urlList":[]}}