{"title":"Caroline's Spine - Monsoon [1997][EAC,log,cue. FLAC]","uid":9096342,"size":377348177,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:524ab006d3a4ad5d9eaecc798fce5a6874fbd641&amp;dn=Caroline%27s+Spine+-+Monsoon+%5B1997%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":16,"time":1382686334,"description":"Artist:Caroline's Spine\nRelease: Monsoon\nReleased: 1997\nLabel: Hollywood\nCatalog#: 162087\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry:USA\nStyle: rock\n\n1.\tKing for a Day (3:18)\n2.\tYou and Me (4:22)\n3.\tSullivan (4:05)\n4.\tWallflower (4:57)\n5.\tMonsoon (4:34)\n6.\tUnglued (2:59)\n7.\tTrio' Pain (2:50)\n8.\tPsycho (3:19)\n9.\tNecro (3:08)\n10.\tSo Good Afternoon (5:32)\n11.\tSay It to You (3:23)\n12.\tSweet &amp; Sour (3:09)\n13.\tHippie Boy (4:30)\n\nCarolines Spines first album is pretty much what it intended to be a post grunge/punk breakthrough debut that ended up on a major label and doesnt really suffer for it at all. If anything it?s because bandleader Jimmy Newquist is a pretty good judge of his bands skills as a producer and in combination with engineer Don Calderone made sure they played to it. Theres grunges thick flow of sound, post-adolescent questioning about love and life and above all even amidst lyrical declarations of sorrow and confusion the music shifts up gears to peppy energy easily enough. Newquists singing has a fair amount of the early nineties ready tendency to equate anguished and slightly strained vocals with automatic depth, admittedly, but compared to the self-loving idiocy of early Stone Temple Pilots theres no contest. Admittedly a few of the lyrics are vague imagery without much in the way of impact, thus the title track, but thats made up for by the sharp self-character study So Good Afternoon. Much of what works about Monsoon comes in sudden moments that aren?t breathtakingly original but work perfectly in context the drop in of acoustic guitars in You and Me after the feedback has kicked in, the lush extra guitar and suddenly distorted vocals on Unglued, the sly semi-thrash parody Necro. The best song, Sullivan, is a surprisingly affecting reworking of the story of the family who lost all five of its sons in a World War II naval attack. Newquists voice is both affecting and yearning, and the abrupt lead guitar figure is downright beautiful if the band deserves to be remembered for anything, it?s this great radio-ready history lesson that connects rather than patronizes.","torrent":{"xt":"urn:btih:524ab006d3a4ad5d9eaecc798fce5a6874fbd641","amp;dn":"Caroline%27s+Spine+-+Monsoon+%5B1997%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"524ab006d3a4ad5d9eaecc798fce5a6874fbd641","infoHashBuffer":{"type":"Buffer","data":[82,74,176,6,211,164,173,93,158,174,204,121,143,206,90,104,116,251,214,65]},"announce":[],"urlList":[]}}