{"title":"BitDefender Antivirus Plus 2012 Build 15.0.27.312+TILL 2045{fies","uid":6604185,"size":205590776,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:529c271ca296fe968bb2a63d9db2381ff23776cf&amp;dn=BitDefender+Antivirus+Plus+2012+Build+15.0.27.312%2BTILL+2045%7Bfies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"AUDI-A4","files":1,"time":1313334729,"description":"BitDefender Antivirus Plus 2012 description\nSilent Security against viruses, spyware and phising attempts.\n\nNote: a &quot;3PC 2 year license for the price of 1 year&quot; deal is available. Click here to order!\n\nBitDefender Antivirus Plus will give your PC fast, proactive protection against the latest viruses, spyware, and identity theft attacks, all in a friendly and customizable dashboard.\n\nUNPARALLELED SECURITY\n\nActive Virus Control:\nÃ‚Â· Monitors processes behavior while they are running to detect new &amp; unknown viruses\n\nRescue mode:\nÃ‚Â· Reboots your computer in a trusted environment, which is used for cleanup and restoration\n\nVirtualized Browser:\nÃ‚Â· Isolates the browser from the operating system in a Bitdefender-provided environment to block web-based threats\n\nVulnerability Scanner:\nÃ‚Â· Checks for missing or outdated security software as well as potentially unsafe system settings\n\nABSOLUTE SILENCE\n\nAutopilot:\nÃ‚Â· Provides a hassle-free experience by making optimal security-related decisions without input from you\n\nWORRY-FREE SOCIALIZING\n\nSocial Network Protection:\nÃ‚Â· Filters the links you receive from your Facebook and Twitter friends and monitors your privacy settings\n\nSearch Advisor:\nÃ‚Â· Gives advance warning of risky websites right in your Google and Bing search results\n\nTOTAL PRIVACY\n\nPersonal Data Filter:\nÃ‚Â· Prevents critical data, such as your social security number, from ever leaving your computer\n\nAntiphising:\nÃ‚Â· Blocks websites supporting various scams or credit card phishing attempts\n\nChat Encryption:\nÃ‚Â· Keeps your conversations private on Yahoo Messenger\n\nFULL SPEED\n\nScan Dispatcher:\nÃ‚Â· Triggers system scans when resource usage falls below a certain threshold to avoid any impact on your system's performance\n\nHere are some key features of &quot;BitDefender Antivirus Plus 2012&quot;:\n\nStop Viruses and Spyware Cold:\nÃ‚Â· Proactive protection stops new viruses and malware that other products miss.\n\nPlay and Work Seamlessly:\nÃ‚Â· Automatically activate Game, Laptop, or Silent Mode to minimize interruptions, prolong battery life, or reduce system load to ensure seamless and secure gameplay.\n\nSafeguard your Privacy:\nÃ‚Â· Eliminate the chances your data and conversations are leaked to others over email, Facebook, IM, or websites that track your online activities.\n\nChoose your View:\nÃ‚Â· Match the interface to your level of comfort by selecting between Basic, Intermediate, or Expert settings - and quickly create shortcuts to frequently used controls.\n\nSurf Safely:\nÃ‚Â· Automatically get warnings about unsafe pages displayed in search results.\n\nSmart Tips:\nÃ‚Â· When online explorations take you into dangerous terrain, BitDefender prompts you with a series of suggested privacy safeguards, relevant to your most recent activity.\n\nFind Support Fast:\nÃ‚Â· Troubleshoot issues with the new video library or call for free tech assistance for the duration of your software license. Search relevant results from the Knowledge Base, Help file, Troubleshooting and Video Tutorials.\n\nVideo Library:\nÃ‚Â· A new collection of step-by-step videos helps you navigate through common security challenges.\n\nRequirements:\n\nÃ‚Â· Available free hard disk space: 600 MB free space\nÃ‚Â· Intel CORE Duo (1.66 GHz) or equivalent processor\nÃ‚Â· RAM: 1GB (Windows XP and Windows 7), 1.5 GB (Windows Vista)\nÃ‚Â· 600 MB available hard disk space\nÃ‚Â· Internet Explorer 7","torrent":{"xt":"urn:btih:529c271ca296fe968bb2a63d9db2381ff23776cf","amp;dn":"BitDefender+Antivirus+Plus+2012+Build+15.0.27.312%2BTILL+2045%7Bfies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"529c271ca296fe968bb2a63d9db2381ff23776cf","infoHashBuffer":{"type":"Buffer","data":[82,156,39,28,162,150,254,150,139,178,166,61,157,178,56,31,242,55,118,207]},"announce":[],"urlList":[]}}