{"title":"Ssion - Fools Gold","uid":4922007,"size":68415127,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5397cad764a8c6258e39163e99ebdd428c9e16d0&amp;dn=Ssion+-+Fools+Gold&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BZin","files":10,"time":1243702597,"description":"01 - Clown\n02 - Bullshit\n03 - Street Jizz\n04 - Fear Us\n05 - The Woman\n06 - Dayjob\n07 - Warm Glove\n08 - A Wolves Eye\n09 - Ah-Ma\n10 - Heaven\n\n\nAppropriately for music that makes smut sound so enticing, Fool's Gold vacillates between glossy disco and squalid electro-punk. Between the kinky &quot;Warm Glove&quot;, the petulant screamalong &quot;Dayjob&quot;, and &quot;Bullshit&quot;, Critcheloe's voice, buffered by plenty of fuzz and the occasional sax squonk, finds a middle-ground between the late-1990s incarnation of Royal Trux's Neil Hagerty and a spit-shined Darby Crash. Despite the textural shifts, the optimistic sentiment stays the same throughout: like CSS' &quot;Fuckoff is Not the Only Thing You Have to Show&quot;, or Scissor Sisters' &quot;Mary&quot;, Critcheloe keeps his advice blissfully simple: &quot;Don't let the bullshit get you down.&quot;\n\nSsion's tendency to weave sympathy and encouragement through the naughty bits-- erasing the boring distinctions between partying, sex, music, and boundless, delirious dreaming-- clearly aligns them with CSS, Scissor Sisters, and Junior Senior, their fellow purveyors of devilishly simple, self-reflexive, and undeniably catchy dance-pop. Fool's Gold kicks off with &quot;Clown&quot;, a sinuously funky piano-driven disco jam that extols the virtues of using the club to take (not lose) control. It's impossible not to hear the refrain &quot;pride, faith, heart and soul&quot; as anything other than a statement of purpose, and in this context, the decision between living in the &quot;trenches,&quot; or in a &quot;house with picket fences&quot; shouldn't take very long to make.","torrent":{"xt":"urn:btih:5397cad764a8c6258e39163e99ebdd428c9e16d0","amp;dn":"Ssion+-+Fools+Gold","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5397cad764a8c6258e39163e99ebdd428c9e16d0","infoHashBuffer":{"type":"Buffer","data":[83,151,202,215,100,168,198,37,142,57,22,62,153,235,221,66,140,158,22,208]},"announce":[],"urlList":[]}}