{"title":"Saving Nelson Mandela - Kenneth S. Broun.epub","uid":9362590,"size":3437850,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:53ff80694e2eb87a17d0122042847b50f38dc5fe&amp;dn=Saving+Nelson+Mandela+-+Kenneth+S.+Broun.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1387349442,"description":"When South Africa's apartheid government charged Nelson Mandela with planning its overthrow in 1963, most observers feared that he would be sentenced to death. But the support he and his fellow activists in the African National Congress received during his trial not only saved his life, but also enabled him to save his country.\nIn Saving Nelson Mandela, South African law expert Kenneth S. Broun recreates the trial--called the &quot;Rivonia&quot; Trial after the Johannesburg suburb where police seized Mandela. Based upon interviews with many of the case's primary figures and portions of the trial transcript, Broun situates readers inside the courtroom at the imposing Palace of Justice in Pretoria. Here, the trial unfolds through a dramatic narrative that captures the courage of the accused and their defense team, as well as the personal prejudices that colored the entire trial. The Rivonia trial had no jury and only a superficial aura of due process, combined with heavy security that symbolized the apartheid government's system of repression. Broun shows how outstanding advocacy, combined with widespread public support, in fact backfired on apartheid leaders, who sealed their own fate.\nDespite his 27-year incarceration, Mandela's ultimate release helped move his country from the racial tyranny of apartheid toward democracy. As documented in this inspirational book, the Rivonia trial was a critical milestone that helped chart the end of Apartheid and the future of a new South Africa.","torrent":{"xt":"urn:btih:53ff80694e2eb87a17d0122042847b50f38dc5fe","amp;dn":"Saving+Nelson+Mandela+-+Kenneth+S.+Broun.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53ff80694e2eb87a17d0122042847b50f38dc5fe","infoHashBuffer":{"type":"Buffer","data":[83,255,128,105,78,46,184,122,23,208,18,32,66,132,123,80,243,141,197,254]},"announce":[],"urlList":[]}}