{"title":"Total DC Comics for 6/11/2014 (darkhomr) [ALL]","uid":10354844,"size":1065076983,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:54288237ecfd473cbbf532fc301ce7684075b641&amp;dn=Total+DC+Comics+for+6%2F11%2F2014+%28darkhomr%29+%5BALL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"dadrkhomr","files":-1,"time":1402713324,"description":"This is the 16th week of a Total DC pack.  Similar to my Total Marvel pack, this gathering of comics will include both DC Universe and non-universe titles.  What will be in here will be Vertigo comics, non-DC Universe titles, and any digital titles released by Friday morning.  This release has 12 DC Universe comics 6 non-Universe titles and 7 digital titles.  \n\nMy release packs are as follows: \n\n \nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Friday, based on scanners release times)\nIndependent Comics (Non-DC Universe and Major Independent comics, released between Sunday and Monday morning) \nTotal DC (all DC comics released for the current week.  Released by Saturday each week.  Does not include digital only releases)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n\n\n\n\n\nAstro City #13 (CBR 6/11/2014)\n\n24 hours. 24 pages. A robot. A bank robber named Gundog. The Hanged Man. Jack-In-The-Box. The eternal, mysterious Dancing Master. And a whole lot of romance. One of ASTRO CITY's most unusual stories, of city-wide turmoil and changing lives, all in a single day. \n\nBatgirl #32 (CBR 6/11/2014)\n\nClandestine meetings, tapped phones, video surveillance - Barbara Gordon is being watched! Who has it in for her, and how can Batgirl investigate without compromising her secret identity? \n\nBatman '66 #36 (CBR 6/11/2014)\n\nThe Minstrel plans a deadly recital for Batman and Robin. But the Dynamic Duo may be late--they can't find their costumes. \n\nBatman Beyond 2.0 #22 (CBR 6/11/2014)\n\nBatman is dead! Or is he? As Commander Grayson transports the body of Terry McGinnis back to JLTF headquarters, something strange happens... \n\nBatman Eternal #10 (CBR 6/11/2014)\n\nBatman and Catwoman - together again! Professor Pyg is back! And we get some answers about Falcone's past, and his motivations! \n\nCoffin Hill #8 (CBR 6/11/2014)\n\nArrested for the murder of a fellow Boston cop, Eve takes a journey into her past and delves into the terrible truth about the night she caught up with the notorious Ice Fisher. Meanwhile, in Coffin Hill, Nate struggles to protect the town's remaining witches from an outside menace, while in Boston, Eve confronts an evil that never left, and realizes that even though she caught the Ice Fisher, the case is far from closed... The second story arc of COFFIN HILL begins here! \n\nBirds Of Prey #32 (CBR 6/11/2014)\n\nIt's time to settle some scores! Amanda Waller may have kept Kurt Lance alive, but she also kept him hidden from Black Canary. Now it's on: Birds of Prey vs. the Suicide Squad! \n\nConstantine #15 (CBR 6/11/2014)\n\nJohn Constantine witnesses the horrifying reach of magic when he meets the world's wealthiest mage - a woman who's been draining all the good luck out of her home city of Hong Kong and benefiting from the suffering of millions! \n\nDetective Comics #32 (CBR 6/11/2014)\n\nThe next great Batman murder-mystery continues to unfold in 'Icarus' part three, brought to you by the acclaimed creative team of THE FLASH! Batman is caught in the clutches of the crime boss known as 'The Squid' as he digs deeper into a whodunit for the ages! \n\nFBP Federal Bureau Of Physics #11 (CBR 6/11/2014)\n\nOne man's reality is another man's machine gun shootout! Adam and Rosa are up against more than they bargained for, but physics could be on their good side for once! The dicey adventures of everyone's favorite FBP agents continue here! \n\nGreen Lantern Corps #32 (CBR 6/11/2014)\n\n'UPRISING!' part 4! The casualties of the uprising against the Green Lantern Corps reach monumental proportions as the Durlans reveal their sinister endgame! John Stewart leads his ragtag team of Lanterns against an army of shape-shifters that can assume any form. Meanwhile, one Lantern must decide if he will make the ultimate sacrifice to give the Corps any hope in this war. \n\nInjustice: Gods Among Us: Year Two #11 (CBR 6/11/2014)\n\nThe Green Lanterns deal with the aftermath of tragedy, while the GCPD plan their strategy against Superman's peacekeeping force. \n\nInfinity Man And The Forever People #1 (CBR 6/11/2014)\n\nFour of the best students from New Genesis arrive on Earth to study and aid in the advancement of humanity - but they soon discover a darker purpose to their mission: a threat so great that it may bring the multiverse itself to its knees! The only thing that stands between them and total destruction is the mysterious entity known as the Infinity Man! Don't miss the start of this new series by Dan DiDio and Keith Giffen, the team that brought you the over-the-top adventures of O.M.A.C.! \n\nJustice League United #2 (CBR 6/11/2014)\n\nIt's all out battle issue as Hawkman has a showdown with Lobo as the League is teleported to Rann to face the shape-changing alien called Byth! This looks like a job for Supergirl! \n\nNew 52 Futures End #6 (CBR 6/11/2014)\n\nRay Palmer, Frankenstein and Amethyst take a dangerous journey into the Phantom Zone! And Batman Beyond's mission could be over before it begins when someone discovers his arrival five years from now! \n\nRoyals Masters Of War #5 (of 6) (CBR 6/11/2014)\n\nAs the Allied forces prepare to invade France, Hitler's V2 rockets decimate London, and King Albert is faced with the knowledge that, despite his best efforts, he could not protect his children from the war. The effects of the Stalingrad mission leave Rose's sanity in tatters, while Henry must battle his morally bankrupt brother, Arthur, to try and convince him to join the Normandy armada. But Arthur left Henry to die once before, and the Nazi's spy in London is about to be revealed...\n\nScooby Doo Where Are You #46 (CBR 6/11/2014)\n\nWhen Shaggy and Scooby dig up a mysterious artifact on the beach, they take it to the local college, where the head of the Marine Archaeology Department claims to have recovered hundreds of similar artifacts - evidence that the lost civilization of Atlantis was real! So when some creatures calling themselves Atlanteans show up to cause trouble, the whole gang has to figure out what's up. \n\nSuperboy #32 (CBR 6/11/2014)\n\nThe return of the son of Superman to the present day means an all-new Superboy for The New 52! Jon Lane Kent takes off for a N.O.W.H.E.R.E. lab and finds Ravagers - and the Superboy clone body captured by Harvest! What comes next changes Jon's life forever! \n\nSuperman Wonder Woman #9 (CBR 6/11/2014)\n\n'SUPERMAN: DOOMED' continues with 'ENEMY OF THE STATE'! As things get more dire on Earth for him, the Man of Steel may have to go into exile in space, but the self-proclaimed protectors of Sector 2814, the Red Lanterns, don't want him there either! Don't miss this deadly face-off between Kal and Kara! \n\nTeen Titans Go! #8 (CBR 6/11/2014)\n\nTired of finishing second, an ultra-competitive Robin comes up with a plan to show the rest of the Teen Titans that he's actually the best. \n\nThe Vampire Diaries #28 (CBR 6/11/2014)\n\nMatt's aiming for a normal life, so he's dating a new co-worker from the Mystic Grill. But when a series of grisly &quot;animal attacks&quot; are uncovered, Damon, Elena, and Caroline follow the new girl to see if there's more to her than it seems. &quot;New in Town&quot; part 1 of 1. \n\nThe Vampire Diaries #29 (CBR 6/11/2014)\n\n&quot;War Effort&quot; part 1 of 2. Stefan Salvatore has a long history with bloodshed, beginning in the American Civil War. So when he joins up for service in World War II, Damon is understandably worried. \n\nWorlds Finest #24 (CBR 6/11/2014)\n\nGet ready for action as Power Girl and Huntress begin their journey back to Earth 2! Plus, Desaad returns! \n\n","torrent":{"xt":"urn:btih:54288237ecfd473cbbf532fc301ce7684075b641","amp;dn":"Total+DC+Comics+for+6%2F11%2F2014+%28darkhomr%29+%5BALL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54288237ecfd473cbbf532fc301ce7684075b641","infoHashBuffer":{"type":"Buffer","data":[84,40,130,55,236,253,71,60,187,245,50,252,48,28,231,104,64,117,182,65]},"announce":[],"urlList":[]}}