{"title":"Dissecting the Hack: The F0rb1dd3n Network,1st Ed {BBS}","uid":6827165,"size":17526342,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:54455b54ae28aa1995d2eeb9b3fcb7ef48c7a479&amp;dn=Dissecting+the+Hack%3A+The+F0rb1dd3n+Network%2C1st+Ed+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1321621412,"description":"Dissecting the Hack is one heck of a ride! Hackers, IT professional, and Infosec aficionados (as well as everyday people interested in security) will find a gripping story that takes the reader on a global trip through the world of computer security exploits. One-half thriller, one-half reference, each provides context for the other. Together they will show you how to see the digital world just below the surface of daily life.\n\nYes, the security threats are real!   In this revised edition the Part 2 content is completely NEW. Read more about the tactics that you see executed throughout the story in the second half of the book where you will learn to recon, scan, explore, exploit, and expunge with the tools and techniques shown in the story.\n\n    * Revised edition includes a completely NEW STAR Section (Part 2)\n    * Utilizes actual hacking and security tools in its story- helps to familiarize a newbie with the many devices and their code\n    * Introduces basic hacking techniques in real life context for ease of learning\n    * Presented in the words of the hacker/security pro, effortlessly envelops the beginner in the language of the hack\n    * Check out the companion site at www.dissectingthehack.com complete with an interactive forum!\n    * Exclusive interviews in this revised edition include thoughtful insights into security issues and hacking culture from industry leaders Dan Kaminsky, Johnny Long, Jeff Moss and Marcus Ranum\n\n\n\nReview\n\n&quot;Welcome to hacker fiction-like sci fi, but you don't get to make the good stuff up.&quot;-Dan Kaminsky, Director of Penetration Testing, IOActive, Inc. &quot;There have been many sensationalist books on hackers, and this isn't one of them. Get a feeling for what it's really about and follow through with the technical details. Fun like Star Trek, but comes with the blueprints.&quot;-FX of Phenoelit Recurity Labs GmbH &quot;A great read, whether you're a geek or not. Hollywood should take notes...a gripping story centered around real tech.&quot;-Johnny Long, Professional Hacker, Best-Selling Author and Founder of Hackers For Charity, Inc. &quot;Dissecting the Hack: the F0rb1dd3n Network is an educational thriller, the reader is thoroughly entertained and yet walks away with an understanding of the importance of information security theory and practice.&quot;-Stephen Northcutt, President, The SANS Technology Institute \n\n\n# Paperback: 360 pages\n# Publisher: Syngress; 1 edition (July 15, 2010)\n# Language: English\n# ISBN-10: 1597495689\n# ISBN-13: 978-1597495684","torrent":{"xt":"urn:btih:54455b54ae28aa1995d2eeb9b3fcb7ef48c7a479","amp;dn":"Dissecting+the+Hack%3A+The+F0rb1dd3n+Network%2C1st+Ed+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54455b54ae28aa1995d2eeb9b3fcb7ef48c7a479","infoHashBuffer":{"type":"Buffer","data":[84,69,91,84,174,40,170,25,149,210,238,185,179,252,183,239,72,199,164,121]},"announce":[],"urlList":[]}}