{"title":"The Doors - Love Me Two Times (Beat Club) (2nafish)","uid":5848985,"size":179175428,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5467c80e923175e0417f8ac5f8263fb72dc2555c&amp;dn=The+Doors+-+Love+Me+Two+Times+%28Beat+Club%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1285305923,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Love Me Two Times&quot; is a song by The Doors. It was written by the band and first appeared on the 1967 album Strange Days. It was released as the second single (after &quot;People Are Strange&quot;) from that album, and reached #25 on the charts in the US. \n\nRay Manzarek played the final version of this song on a clavinet (the modern-day version of a clavichord), not a harpsichord.\n\n&quot;Love Me Two Times&quot; was considered to be somewhat risquÃƒÂ© for radio airplay.\n\nThe lyrics were written by guitarist Robby Krieger. According to band members, the song was about a soldier/sailor on his last day with his girlfriend before shipping out, ostensibly to war (Vietnam).\n\n    * In 1968, the Doors went on a European Tour and recorded the song live. The live version went on the 1983 compilation album Alive, She Cried. This version had an alternate &quot;Key Solo&quot; between the verses that was much less complicated than the initial recording. It also had more organ effects than the original.\n    * In 1972, the Doors played this song live in concerts after Jim Morrison's death. As a trio, Ray Manzarek was on the lead vocals (as well as the organ and the piano bass).\n    * In both versions, the words are slightly altered, as most other songs at Doors concerts and tour did.\n\nStrange Days is the second album released by American rock band The Doors. The album was a commercial success, earning a gold record and reaching No. 3 on the Billboard 200 albums chart. Despite this, the album's producer, Paul Rothchild, considered it a commercial failure, even if it was an artistic triumph: &quot;We all thought it was the best album. Significantly, it was also the one with the weakest sales. We were confident it was going to be bigger than anything The Beatles  had done. But, there was no single. The record died on us.&quot; Nonetheless, the album managed two Top 30 hits, a Top 3 placing on the US charts, and a platinum certification. Furthermore, the album certainly did nothing to derail the overall success of the Doors, as demonstrated the next year by their chart-topping follow-up Waiting for the Sun.\n\nStrange Days consists of songs that were written in 1965-1966 , but did not make it onto their debut album, such as &quot;Moonlight Drive&quot;, which was one of the first songs written by Jim Morrison. The song was recorded in 1965 (demo) and 1966 (intended for their first album). In 1967 a final version was recorded and released on this album. Strange Days contains some of The Doors' most psychedelic songs. It includes songs such as &quot;Strange Days&quot;, &quot;People Are Strange&quot;, &quot;Love Me Two Times&quot; and &quot;When the Music's Over&quot;.\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:5467c80e923175e0417f8ac5f8263fb72dc2555c","amp;dn":"The+Doors+-+Love+Me+Two+Times+%28Beat+Club%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5467c80e923175e0417f8ac5f8263fb72dc2555c","infoHashBuffer":{"type":"Buffer","data":[84,103,200,14,146,49,117,224,65,127,138,197,248,38,63,183,45,194,85,92]},"announce":[],"urlList":[]}}