{"title":"PowerArchiver 2013 14.00.32 RC2+Keygen","uid":8934302,"size":18855425,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5487770e0ddb1f5da294789edf6044f13f29644a&amp;dn=PowerArchiver+2013+14.00.32+RC2%2BKeygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Sunblock.","files":-1,"time":1379527775,"description":"PowerArchiver 2013 14.00.32 RC2 + Keygen\n\nPowerArchiver contains all the basic features you would expect from a compression program / archive utility - you can read and extract from many different formats and you can also create archives in many different formats, including 7-Zip which is one of the best compression formats currently used. What makes PowerArchiver different from many similar utilities is the wealth of advanced features it has. Simply put, PowerArchiver is one of the most innovative utilities of its kind and many features you now take for granted in a compression utility were first offered in PowerArchiver.\n\nKey features\nComplete built-in support (including creating archives and adding files) for ZIP, CAB, LHA (LZH), TAR, TAR.GZ, TAR.BZ2 and BH (BlakHole) files, and built-in support for reading and extracting many other file formats: RAR, ARJ, ARC, ACE, ZOO, GZ and BZIP2\nBuilt-in support for XXE and UUE encoded files\nMany powerful archive operations (including: renaming files in archive, spanning archives, testing archives, viewing and writing comments, installing archives, and checking archives for viruses)\nInternal viewer that supports TXT, RTF, BMP, ICO, WMF, EMF, GIF and JPG (JPEG) files\nSkinnable toolbar\nDrag and Drop from/to Windows Explorer and the Desktop\nTwo ways of viewing archives (Classic - all files in the same listing; Explorer - browsing through an archive like folders in Windows Explorer)\nCreating powerful ZIP, RAR, ARJ, LHA and BH self-extracting archives\nComplete integration with Windows (extracting archives and creating archives directly from Windows Explorer using powerful &quot;Explorer Shell Extensions&quot;)\nViewing files in all view styles, including &quot;as a Web page&quot;\nConverting between file formats (for example: changing a ZIP archive to CAB archive, or LHA archive to ZIP archive)\nTool for repairing corrupted ZIP archives\nTool for extracting multiple archives at once\nTool for creating backup scripts and running automated backups\nAuto Update to automatically download and install new versions of PowerArchiver\nBatch Zip function to create multiple different archives at once\nFavorite Folders to quickly locate archives\nPrinting file list to printer, or exporting file list to HTML or TXT files\nPowerful help in HTML and a tutorial with pictures for beginners\nMany, many other useful and powerful features\n\nWww.powerarchiver.com","torrent":{"xt":"urn:btih:5487770e0ddb1f5da294789edf6044f13f29644a","amp;dn":"PowerArchiver+2013+14.00.32+RC2%2BKeygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5487770e0ddb1f5da294789edf6044f13f29644a","infoHashBuffer":{"type":"Buffer","data":[84,135,119,14,13,219,31,93,162,148,120,158,223,96,68,241,63,41,100,74]},"announce":[],"urlList":[]}}