{"title":"21 &amp; Over.mp4","uid":8928154,"size":787873478,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:54d256ca0b6115394862dfa85ae7abed1ca64f8c&amp;dn=21+%26amp%3B+Over.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hardcore74","files":1,"time":1379406014,"description":"Having been best friends in high school. Casey and Miller, themselves are already 21 or over and want to take Jeff Chang out for his 21st birthday. However, it is on the night before an important medical school interview, so he declines. After Miller threatens to make a lot of noise the whole night if he persists in his refusal he accepts to come along for just one drink.\nIn a bar Jeff accidentally hits a boy named Randy with a dart. Randy gets aggressive and they have to flee, even though Casey was having a nice chat with a girl named Nicole. Jeff gets excited that he is allowed to enter bars now, drinks too much, and becomes unresponsive. Casey and Miller want to take him home, but do not remember where he lives. Since Nicole knows Jeff, they try to find her, because she may know where he lives. They sneak into a sorority house, where they think Nicole lives, but it is the wrong house, where only female Latina students live. They encounter two blindfolded women ready to be paddled as part of their sorority initiation ritual. Miller has the women make out with each other, but these and the other women of the house are furious when they find out about the intrusion. They have to flee the house, and Casey and Miller throw Jeff from a balcony onto the pool cover that bounces him into a rose garden, and worry that they killed him, but he is not injured, except for thorns in his buttocks.","torrent":{"xt":"urn:btih:54d256ca0b6115394862dfa85ae7abed1ca64f8c","amp;dn":"21+%26amp%3B+Over.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54d256ca0b6115394862dfa85ae7abed1ca64f8c","infoHashBuffer":{"type":"Buffer","data":[84,210,86,202,11,97,21,57,72,98,223,168,90,231,171,237,28,166,79,140]},"announce":[],"urlList":[]}}