{"title":"Harry Potter and the Prisoner of Azkaban an 1080p - MultiLang -","uid":6580889,"size":31836283441,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:54df5bbc50be18dd51f561b326a4141ded505b75&amp;dn=Harry+Potter+and+the+Prisoner+of+Azkaban+an+1080p+-+MultiLang+-+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":6,"uploader":"proximun","files":268,"time":1312395974,"description":"PRODUCTION\n\nYear: 2004\nCountry: UK, USA\nAll Genres: Adventure, Family, Fantasy, Mystery\nDirector: Alfonso CuarÃƒÂ³n\nWriting By: J.K. Rowling Steve Kloves\nProduced By: Michael Barnathan Chris Carreras Chris Columbus Paula DuPrÃƒÂ© Pesmen David Heyman Callum McDougall Lorne Orleans Mark Radcliffe Tanya Seghatchian\nMusic: John Williams\n\nHarry Potter and the Prisoner of Azkaban is the third novel in the Harry Potter series written by J. K. Rowling. The book was published on 8 July 1999. The novel won the 1999 Whitbread Book Award, the Bram Stoker Award, the 2000 Locus Award for Best Fantasy Novel, and was short-listed for other awards, including the Hugo. A film based on the novel was released on 31 May 2004, in the United Kingdom and 4 June 2004 in the U.S. and many other countries. This is the only novel in the series that does not feature Lord Voldemort in some form.\n\n\n\nPLOT\n\nHarry and his friends Ron Weasley and Hermione Granger return to Hogwarts School of Witchcraft and Wizardry and find security has been tightened because of notorious mass murderer Sirius Black's escape from Azkaban, the wizarding prison. Harry learns that Black betrayed Harry's parents to the evil Lord Voldemort 12 years ago, leading to their deaths. Black is also known to have murdered the Potters' good friend, Peter Pettigrew.\n\nDespite the disapproval of headmaster Albus Dumbledore, the grounds of Hogwarts are being guarded by Dementors, dark, sinister beings that drain the happiness of anyone nearby and are the appointed guards of Azkaban. The Dementors have a particularly strong effect on Harry, causing him to black out and hear the screams of his dying parents every time they come near him. Professor Remus Lupin, the school's new Defence Against the Dark Arts teacher, befriends Harry and agrees to teach him the Patronus Charm, a difficult spell used to repel Dementors.\n\nHarry is depressed to learn he will not be allowed to visit Hogsmeade, the local wizarding village, with his fellow third-years, because his guardian, Uncle Vernon, has refused to sign the permission form. Harry is also angry with his arch-nemesis Draco Malfoy for ruining gamekeeper Hagrid's first lesson as Care of Magical Creatures teacher. Malfoy's rude behavior during the lesson causes him to be attacked by a Hippogriff named Buckbeak, and Malfoy's father Lucius promises that Buckbeak will be executed in the course of the year.\n\nMeanwhile, Sirius Black manages to break into Hogwarts twice, presumably to reach Harry, but is unsuccessful. Fred and George Weasley give Harry the Marauder's Map, a map that shows the whereabouts of everybody on the grounds of Hogwarts as well as secret passageways that can get him from the castle into Hogsmeade.\n\nRon discovers that Scabbers, his rat, has disappeared and believes he has been eaten by Crookshanks, Hermione's cat, causing a falling-out between him and Hermione. Hermione later finds Scabbers hiding in Hagrid's hut when the three of them visit him before Buckbeak's execution. On their way back from Hagrid's, the three hear the sounds of Buckbeak being executed. Just then, a large, black dog appears and attacks Ron, dragging him and Scabbers into a hidden passage beneath the magical and dangerous Whomping Willow. Harry and Hermione receive a brutal beating from the Whomping Willow before entering the passageway in pursuit of Ron.\n\nHarry and Hermione follow the sounds of Ron's screams and find themselves in an old, boarded-up shack in Hogsmeade, known as the Shrieking Shack. They also discover that the dog is actually Sirius Black, who is an Animagus and able to transform from dog to human at will. While Harry attempts to get revenge on Black for betraying his parents, Professor Lupin suddenly arrives. To the shock of Harry, Ron, and Hermione, Lupin embraces Black like a brother.\n\nHermione confronts Lupin about habits she has observed during her classes with him, accusing him of being a werewolf. Lupin admits to being a werewolf, and begins to explain that he, Sirius, James Potter (Harry's father), and Peter Pettigrew were inseparable friends while at Hogwarts, even writing the Marauder's Map together. To make Lupin's monthly transformations into a wolf more enjoyable, his friends all became Animagi so they could safely interact with him in his animal state.\n\nThe Marauders remained friends after Hogwarts. When they learned that Voldemort was planning to go after the Potters, Sirius agreed to become their Secret-Keeper, the only one to know of their hidden location. Harry interjects that he knows the story: Sirius betrayed the Potters' location to Voldemort, and later killed Pettigrew as well.\n\nHowever, Sirius then reveals that he had secretly switched his duty as Secret-Keeper with Pettigrew, to throw Voldemort off the Potters' trail. Pettigrew was the real betrayer, and faked his own death in order to frame Sirius for the murders. Harry, Ron, and Hermione are skeptical, but Sirius swears that he can prove the truth, as he believes Scabbers to be the Animagus form of Peter Pettigrew.\n\nProfessor Snape suddenly barges in on the scene, and upon seeing Sirius and Lupin together, threatens to turn them over to the Dementors. Harry, Hermione, and Ron, wanting to see if Sirius is telling the truth, all attack Professor Snape, knocking him out. This allows Lupin and Sirius to revert Scabbers back into Pettigrew.\n\nPettigrew admits to the story, but Harry stops Sirius and Lupin from killing him, not wanting his father's best friends to turn into murderers. Instead, Harry persuades them to take Pettigrew back to Hogwarts in order to clear Sirius's name before turning Pettigrew over to the Dementors. As they return to the castle, the full moon emerges and Lupin transforms into a werewolf. Amidst the confusion, Pettigrew transforms back into a rat and escapes across the grounds.\n\nLupin begins to lose control of himself in his wolf form, knocking out Sirius and nearly killing Harry, before a strange howl lures him away into the Forbidden Forest. Harry finds an unconscious Sirius lying by the lake, where Dementors suddenly descend on the pair and nearly kill them. They are saved at the last minute by a strange figure across the lake, who casts the Patronus Charm. Before passing out, Harry believes the figure is his father.\n\nHarry awakes in the hospital wing, only to learn that Sirius has been captured and is being imprisoned in the castle, awaiting his fate. On Dumbledore's quiet suggestion, Harry and Hermione use a Time-Turner (which Hermione has secretly been using all year to take multiple classes at the same time) to travel back in time and try to prevent Sirius's capture.\n\nHarry and Hermione first manage to rescue Buckbeak from his execution. They then watch the scenes of the night unfold while safely hidden from sight, as any interference with their past selves could prove disastrous. When they finally see the Dementors cornering Harry and Sirius at the lake, Harry watches intently for the figure who conjured the Patronus, only to realize at the last moment that it was, in fact, himself. Harry quickly performs the Patronus Charm and watches as Sirius is discovered by Professor Snape and taken up to the castle. Harry and Hermione then fly Buckbeak up to the tower where Sirius is imprisoned, and help him escape on Buckbeak into the dark. Having accomplished what they set out to do, Harry and Hermione rush back to the hospital wing just in time.\n\nLupin, now revealed to all as a werewolf, must resign, even though he was the best professor Harry had ever had at Hogwarts. Harry is worried that Pettigrew, now free, may help Voldemort to return, but Dumbledore says that Harry may be grateful one day that he helped save Pettigrew's life. On the way home on Hogwarts Express, Harry receives a letter from a small owl from Sirius Black, thanking him for saving his life, and that he is in hiding, and also granting him permission to visit Hogsmeade in the coming year. Ron is also given the owl, as a replacement for Scabbers. As the train reaches King's Cross, Harry greets Uncle Vernon, and is whisked back to the Muggle world, looking forward to another enchanting year at Hogwarts.\n\n\nCAST\n\n. Daniel Radcliffe as Harry Potter\n. Richard Griffiths as Uncle Vernon\n. Pam Ferris as Aunt Marge\n. Fiona Shaw as Aunt Petunia\n. Harry Melling as Dudley Dursley\n. Adrian Rawlins as James Potter\n. Geraldine Somerville as Lily Potter\n. Lee Ingleby as Stan Shunpike\n. Lenny Henry as Shrunken Head\n. Jimmy Gardner as Ernie the Bus Driver\n\n\nINFO\n\nDISC INFO:\n\nDisc Title:     Harry.Potter.and.the.Prisoner.of.Azkaban.Ultimate.Edition.2004.1080p.Blu-ray.VC-1.DTS-HD.MA.5.1-INSECTS\nDisc Size:      31,836,283,441 bytes\nProtection:     AACS\nBD-Java:        Yes\nBDInfo:         0.5.6\n\nPLAYLIST REPORT:\n\nName:                   00100.MPLS\nLength:                 2:21:42 (h:m:s)\nSize:                   31,405,971,456 bytes\nTotal Bitrate:          29.55 Mbps\n\n(*) Indicates included stream hidden by this playlist.\n\nVIDEO:\n\nCodec                   Bitrate             Description    \n-----                   -------             -----------    \nVC-1 Video              19299 kbps          1080p / 23.976 fps / 16:9 / Advanced Profile 3\n\n\n\nAUDIO:\n\nCodec                           Language        Bitrate         Description    \n-----                           --------        -------         -----------    \nDTS-HD Master Audio             English         2246 kbps       5.1 / 48 kHz / 2246 kbps / 16-bit (DTS Core: 5.1 / 48 kHz / 1509 kbps / 16-bit)\nDolby Digital Audio             Catalan         448 kbps        5.1 / 48 kHz / 448 kbps / DN -4dB\nDolby Digital Audio             Dutch           448 kbps        5.1 / 48 kHz / 448 kbps / DN -4dB\nDolby Digital Audio             Dutch           448 kbps        5.1 / 48 kHz / 448 kbps / DN -4dB\nDolby Digital Audio             French          640 kbps        5.1 / 48 kHz / 640 kbps / DN -4dB\nDolby Digital Audio             French          640 kbps        5.1 / 48 kHz / 640 kbps / DN -4dB\nDolby Digital Audio             German          448 kbps        5.1 / 48 kHz / 448 kbps / DN -4dB\nDolby Digital Audio             Italian         448 kbps        5.1 / 48 kHz / 448 kbps / DN -4dB\n* Dolby Digital Audio           Japanese        640 kbps        5.1 / 48 kHz / 640 kbps / DN -4dB\nDolby Digital Audio             Portuguese      640 kbps        5.1 / 48 kHz / 640 kbps / DN -4dB\nDolby Digital Audio             Spanish         448 kbps        5.1 / 48 kHz / 448 kbps / DN -4dB\nDolby Digital Audio             Spanish         640 kbps        5.1 / 48 kHz / 640 kbps / DN -4dB\n\nSUBTITLES:\n\nCodec                           Language        Bitrate         Description    \n-----                           --------        -------         -----------    \nPresentation Graphics           English         30.011 kbps                    \nPresentation Graphics           Dutch           21.296 kbps                    \nPresentation Graphics           Dutch           0.062 kbps                      \nPresentation Graphics           French          20.922 kbps                    \nPresentation Graphics           French          0.019 kbps                      \nPresentation Graphics           German          33.346 kbps                    \nPresentation Graphics           Italian         30.470 kbps                    \n* Presentation Graphics         Japanese        21.129 kbps                    \n* Presentation Graphics         Japanese        0.379 kbps                      \nPresentation Graphics           Portuguese      26.674 kbps                    \nPresentation Graphics           Spanish         24.628 kbps                    \nPresentation Graphics           Spanish         24.889 kbps                    \nPresentation Graphics           Spanish         0.120 kbps                      \n\nFILES:\n\nName            Time In         Length          Size            Total Bitrate  \n----            -------         ------          ----            -------------  \n00163.M2TS      0:00:00.000     2:21:42.160     31,405,971,456  29,551     ","torrent":{"xt":"urn:btih:54df5bbc50be18dd51f561b326a4141ded505b75","amp;dn":"Harry+Potter+and+the+Prisoner+of+Azkaban+an+1080p+-+MultiLang+-+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54df5bbc50be18dd51f561b326a4141ded505b75","infoHashBuffer":{"type":"Buffer","data":[84,223,91,188,80,190,24,221,81,245,97,179,38,164,20,29,237,80,91,117]},"announce":[],"urlList":[]}}