{"title":"Big Action Mega Fight!","uid":13227167,"size":109148687,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:55d441aaa5b6941de5069fc92eef5c8f7ff59343&amp;dn=Big+Action+Mega+Fight%21&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1452883373,"description":"About This Game\r\nBig Action Mega Fight! is a classic single player beat 'em up/brawler with a modern twist! Hilarious 2D cartoon combat will leave you with your jaw on the floor and your hands full of blisters. Blast your way through levels filled with luscious art and unforgettable enemies. How fast can you SMASH?\r\n\r\nMegatropolis is overrun with a new vicious criminal gang, the Clunks. You play as Brick Strongarm, a killer-moustache-sporting, iron-pumping gym aficionado with a penchant for lazy Sundays. But when the Clunks kidnap your best friend Hawk, justice calls. Get out there, rescue your friend, and save the city from crime and corruption!\r\n\r\nBAMF! is an homage to classic 90s beat 'em ups like Double Dragon and Streets of Rage, where intense cartoon combat meets tight controls and a satisfying difficulty curve. Originally released for iOS and Android, Big Action Mega Fight! smashes its way onto Steam after a successfully-speedy Greenlight campaign.\r\nFeatures\r\n\r\n    Punch your way through over 35 stages of non-stop fighting action\r\n    Upgrade your fighter to improve endurance, punching power, and abilities\r\n    Learn ridiculously over-the-top special attacks like Fistnado, Orbital Punch and Poultry Rain\r\n    Enjoy luscious hand-drawn animation and detailed urban environments remastered in high resolution\r\n    Feast your ears on a fully remastered award-winning soundtrack that'll make you wish it was still the 90s\r\n    Get a kick out of full controller and keyboard support\r\n    Unlock Steam achievements","torrent":{"xt":"urn:btih:55d441aaa5b6941de5069fc92eef5c8f7ff59343","amp;dn":"Big+Action+Mega+Fight%21","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55d441aaa5b6941de5069fc92eef5c8f7ff59343","infoHashBuffer":{"type":"Buffer","data":[85,212,65,170,165,182,148,29,229,6,159,201,46,239,92,143,127,245,147,67]},"announce":[],"urlList":[]}}