{"title":"Bon Jovi - Bon Jovi","uid":4698523,"size":39856913,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:55eb8ef54235e646fd95d9849e0aedab087c55df&amp;dn=Bon+Jovi+-+Bon+Jovi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"enormous_grub","files":9,"time":1233641046,"description":"Bon Jovi's 1984 debut not only became a blueprint for the band's multi-platinum releases of later years, but a definitive work for ...    Full Descriptionan entire genre. Though scores of short-lived pop-metal bands rocketed to popularity on the success of this release, the time-weathered BON JOVI continues to stand out from the pack.\n\n&quot;Runaway,&quot; with its infectious hook and keyboard work from E-Streeter Roy Bittan, was discovered by a New York DJ and gave the band some early exposure. &quot;She Don't Know Me&quot; is a catchy mid-tempo rocker. &quot;Shot Through the Heart&quot; turns the hard-rocking pulse up a few notches, with Richie Sambora letting loose on the kind of solo that would be copied by a plethora of L.A. bands. David Bryan's keyboards, an integral part of the group's sound, work nicely on the melodic rocker &quot;Breakout.&quot; At a time when synthesizers dominated the pop landscape, Bon Jovi used them to gloss a heavy-rock foundation. &quot;Come Back&quot; shows the enormity of the charisma and emotion that Jon poured into his singing. BON JOVI is a great debut by a band in its underground, formative stage; a street album from a band hungry to make it.\n\nRecorded at The Power Station, New York, New York.\n\nEngineers: Scott Litt, Jeff Hendrickson, Larry Alexander.\n\nBon Jovi: Jon Bon Jovi (vocals, guitar); Richie Sambora (guitar, background vocals); David Rashbaum (keyboards, background vocals); Alec John Such (bass, background vocals); Tico Torres (drums).\n\nAdditional personnel: Aldo Nova, Tim Pierce (guitar); Roy Bittan (keyboards); Huey McDonald (bass); Frankie La Rocka (drums); David Grahmme, Mick Seeley (background vocals); Chuck Burgi, Doug Katsoras.\n\n\n 1. Runaway   \n 2. Roulette   \n 3. She Don't Know Me \n 4. Shot Through the Heart   \n 5. Love Lies   \n 6. Breakout   \n 7. Burning For Love   \n 8. Come Back   \n 9. Get Ready  \n","torrent":{"xt":"urn:btih:55eb8ef54235e646fd95d9849e0aedab087c55df","amp;dn":"Bon+Jovi+-+Bon+Jovi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55eb8ef54235e646fd95d9849e0aedab087c55df","infoHashBuffer":{"type":"Buffer","data":[85,235,142,245,66,53,230,70,253,149,217,132,158,10,237,171,8,124,85,223]},"announce":[],"urlList":[]}}