{"title":"Pilgrim's Wilderness (2013) Tom Kizzia (multi) ","uid":9421983,"size":16214389,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:56168a15dcbae2149f50b423dd9ffaebbf67ff8d&amp;dn=Pilgrim%27s+Wilderness+%282013%29+Tom+Kizzia+%28multi%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":-1,"time":1388606453,"description":"Pilgrim's Wilderness: A True Story of Faith and Madness on the Alaska Frontier (2013) Tom Kizzia (multi) \n\n\nPilgrim's Wilderness: A True Story of Faith and Madness on the Alaska Frontier by Tom Kizzia\n\n\nFormat: mobi/epub/azw3\nLength: 336 pages\nGenre: Non-Fictiom/True Crime\nDate: 16 July 2013\n\nIn this powerful piece of Americana, written with uncommon grace and high drama, Kizzia uses his unparalleled access to capture an era-defining clash between environmentalists and pioneers ignited by a mesmerizing sociopath who held a town and a family captive.\n\nWhen Papa Pilgrim appeared in the Alaska frontier outpost of McCarthy with his wife and fifteen children in tow, his new neighbors had little idea of the trouble to come. The Pilgrim Family presented themselves as a shining example of the homespun Christian ideal, with their proud piety and beautiful old-timey music, but their true story ran dark and deep. Within weeks, Papa had bulldozed a road through the mountains to the new family home at an abandoned copper mine, sparking a tense confrontation with the National Park Service and forcing his ghost town neighbors to take sides in an ever-more volatile battle over where a citizen's rights end and the government's power begins.\n\nAs Kizzia discovered, Papa Pilgrim was in fact the son of a rich Texas family with ties to Hoover's FBI and strange, oblique connections to the Kennedy assassination and the movie stars of Easy Rider. And as his fight with the government in Alaska grew more intense, the turmoil in his brood made it increasingly difficult to tell whether his children were messianic followers or hostages in desperate need of rescue.  \n\nAn Amazon Best Book of the Year 2013\n\nAuthor:\n\nTom Kizzia's stories about the Pilgrim Family won a President's Award from McClatchy Newspapers. He traveled widely in rural Alaska as a reporter for the Anchorage Daily News. His work has appeared in The Washington Post and been featured on CNN. He is a former Knight Journalism Fellow at Stanford University and a graduate of Hampshire College. His first book, The Wake of the Unseen Object, was named one of the best all-time non-fiction books about Alaska by the state historical society. He lives in Homer, Alaska","torrent":{"xt":"urn:btih:56168a15dcbae2149f50b423dd9ffaebbf67ff8d","amp;dn":"Pilgrim%27s+Wilderness+%282013%29+Tom+Kizzia+%28multi%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56168a15dcbae2149f50b423dd9ffaebbf67ff8d","infoHashBuffer":{"type":"Buffer","data":[86,22,138,21,220,186,226,20,159,80,180,35,221,159,250,235,191,103,255,141]},"announce":[],"urlList":[]}}