{"title":"Super Bowl XXXI - Green Bay Packers VS. New England Patriots","uid":4069274,"size":1775575556,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:56859dbb158ac26349882872e8c4702d8276efc2&amp;dn=Super+Bowl+XXXI+-+Green+Bay+Packers+VS.+New+England+Patriots&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RubbaDub9202","files":1,"time":1204965084,"description":"\n                                Super Bowl XXXI\n\n                   Green Bay Packers VS. New England Patriots\n                      Louisiana Superdome, New Orleans, LA\n\n                                1996-1997 Season\n\n             //////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n                    Seeded By RuBBaDub - Die Hard Packer Fan\n             \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\////////////////////////////\n\nDescription: \n\nThe National Football Conference (NFC) champion Green Bay Packers (16-3) defeated the American Football Conference (AFC) champion New England Patriots (13-6). This was the Packers&amp;#039; third overall Super Bowl victory, and their first one since Super Bowl II. The Packers also extended the league record for the most overall NFL championships to 12.\n\nKick returner/punt returner Desmond Howard was named Super Bowl MVP, the first special teams player ever to do so. He ran for 154 kickoff return yards, and scored the game-clinching touchdown on a Super Bowl record 99-yard kickoff return. Howard also recorded a Super Bowl record 90 punt return yards, thus setting the Super Bowl records of total return yards (244) and combined net yards gained (244). Howard became the 4th Heisman Trophy winner to be named Super Bowl MVP.\n\n////////////////////////////////////////////\n\nGame Recap:\n\nDesmond Howard returned a kickoff 99 yards for a touchdown and Brett Favre passed for two touchdowns and ran for a score as the Packers won their first Super Bowl in twenty-nine years.\n\nHoward, en route to garnering the MVP trophy, equaled a Super Bowl record with 244 total return yards.\n\nIt was Favre&amp;#039;s arm that struck first, as he hit Andre Rison for a 54-yard touchdown pass on the Packers&amp;#039; second play from scrimmage to take a 7-0 lead. Two plays later Doug Evans made a diving interception of Drew Bledsoe&amp;#039;s pass at the 28-yard line, setting up Chris Jacke&amp;#039;s field goal and giving the Packers a 10-0 lead just 6:18 into the Super Bowl.\n\nThe Patriots answered with touchdowns on their next two possessions. Craig Newsome&amp;#039;s pass interference penalty set up the first touchdown and a 44-yard completion from Bledsoe to Terry Glenn preceeding Ben Coates&amp;#039;s touchdown gave New England its first and only lead. The 24 combined first quarter points were the most in Super Bowl history.\n\nGreen Bay struck again 56 seconds into the second quarter as Favre hit Antonio Freeman with a Super Bowl-record 81-yard touchdown bomb. Jacke booted his second field goal on Green Bay\\&amp;#039;s next possession. After a Mike Prior interception, Favre orchestrated a 74-yard, nearly 6-minute drive that concluded with a diving Favre touching the ball against the pylon to give Green Bay a 27-14 halftime lead.\n\nCurtis Martin brought the Patriots to within a score by running in from 18 yards out with 3:27 left in the third quarter. But Howard broke the Patriots\\&amp;#039; spirit by returning the ensuing kickoff a Super Bowl-record 99 yards. Favre found Mark Chmura for the 2-point conversion to finish the scoring.\n\nBledsoe was intercepted twice in the fourth quarter as the Patriots never crossed midfield in four fourth-quarter possessions.\n\nReggie White set a Super Bowl record with three sacks. Favre completed 14 of 27 passes for 246 yards, with no interceptions. Bledsoe completed 11 more passes than Favre, but for just seven more yards, and threw four interceptions.\t\t\n\n","torrent":{"xt":"urn:btih:56859dbb158ac26349882872e8c4702d8276efc2","amp;dn":"Super+Bowl+XXXI+-+Green+Bay+Packers+VS.+New+England+Patriots","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56859dbb158ac26349882872e8c4702d8276efc2","infoHashBuffer":{"type":"Buffer","data":[86,133,157,187,21,138,194,99,73,136,40,114,232,196,112,45,130,118,239,194]},"announce":[],"urlList":[]}}