{"title":"Weather Report - Live in Germany (1971)","uid":9356957,"size":2461288480,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:56f6dd23a3b5f1c8dc14f6ab7f65b4df468bb3d3&amp;dn=Weather+Report+-+Live+in+Germany+%281971%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"felipefaco","files":23,"time":1387231502,"description":"Weather Report - Live in Germany (1971)\n\nDVD5 | VIDEO_TS | MPEG-2 Video, NTSC 4:3 (720:480), 29.97fps, 6587kbps | DD 2.0, 256kbps | 50 min | 2400Mb\njazz | Gonzo Media Group | covers\n\nWell if the world still has to find some live recording from the very first studio all-star line-up (not likely, though), at least we've got now something very close to and we can even see the quintet at work with this just-as-famous version in the form of a German TV show called the Beat Club. With only Airto Moreira gone, replaced by Brazilian countryman Um Romao, the other four being Vitous, Shorter, Mouzon and Zawinul, Weather Report embarked on this TV show adventure not knowing that Alphonse Mouzon would leave the band in a while.\nAs you'd expect this broadcast consisted mainly of tracks from the debut album, but some are fairly different as WR always made improvisation their force. So you'll recognize 'Umbrellas generic structure, but drafted fairly differently, not just because of Romao's constant change of percussions instruments - he's one of the visual focus of the group, who otherwise remains fairly static and even blows a flute (and later some whistles) for a short while. One of the big difference between the studio album and this broadcast is that Miroslav has taken up the electric bass (his contrabass is still very present but mainly played with a bow), thus allowing even more energy to invade the quintet's shared space. The group's steaming-hot improvised fusion is simply awesome and flows naturally from your speakers like a river of fresh lave spewing out from your volcanic woofers.\nClearly the gravitational centre of the band is Zawinul's Rhodes, but it is clear that it is the group's tightness its main force. Morning Lake is much needed breathing space, starting out slowly with Shorter's sax signalling the dawn for Romao's birdsongs. Just past that Dom pulls an Brazilian berimbau . Drummer Alphonse sings funkilly (rather well, too) a rare sung track in the closing medley, but it's will veer into the Dr Honoris Causa - later on the Body Electric album.\nA while later, Mouzon would leave the band and be replaced by drummer Erik Gravatt and this line-up would go on to record Body Electric and the Tokyo concert (released in 77, but part of it in the ISTBE album) and in the process become the definitive line-up of the Vitous- era Weather Report But for now, this German TV broadcast is an inestimable witness of the group's almost original line-up, and is just as essential as their debut album, the Tokyo concert or Body Electric.Too bad it's relatively short, though. Run for this baby.\n\nTracks:\n1 - Umbrellas\n2 - Orange Lady\n3 - Waterfall\n4 - Seventh Arrow\n5 - TH\n6 - Morning Lake\n7 - Improvised Medley Including Dr. Honoris Causa\n\nPersonnel:\n- Joe Zawinul     : acoustic &amp; electric piano\n- Wayne Shorter   : soprano &amp; tenor saxophones\n- Miroslav Vitous : acoustic &amp; electric bass\n- Dom Um Romao    : percussion\n- Alphonze Mouzon : drums, voice","torrent":{"xt":"urn:btih:56f6dd23a3b5f1c8dc14f6ab7f65b4df468bb3d3","amp;dn":"Weather+Report+-+Live+in+Germany+%281971%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56f6dd23a3b5f1c8dc14f6ab7f65b4df468bb3d3","infoHashBuffer":{"type":"Buffer","data":[86,246,221,35,163,181,241,200,220,20,246,171,127,101,180,223,70,139,179,211]},"announce":[],"urlList":[]}}