{"title":"The_Washington_Post_20_nov_2013_.epub","uid":9223319,"size":5789249,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:574a75b8880cefa73efeeea2a48cbea46c7ff1bb&amp;dn=The_Washington_Post_20_nov_2013_.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sidmal","files":-1,"time":1384971220,"description":"The Washington Post (WP) is an American daily newspaper. It is the most widely circulated newspaper published in Washington, D.C., and was founded in 1877, making it the area's oldest extant newspaper.\n\nLocated in the capital city of the United States, the newspaper has a particular emphasis on national politics. Daily editions are printed for the District of Columbia, Maryland and Virginia. The newspaper is published as a broadsheet, with photographs printed both in color and in black and white. In 2008, Marcus Brauchli replaced long-time executive editor Leonard Downie, Jr., serving publisher Katharine Weymouth.[5] In November 2012, Weymouth announced that Boston Globe editor Martin Baron would take over Brauchli's position on January 2, 2013.[6][7]\n\nIn the early 1970s, in the best known episode in the recent history of The Post, reporters Bob Woodward and Carl Bernstein led the American press's investigation into what became known as the Watergate scandal; reporting in the newspaper greatly contributed to the resignation of President Richard Nixon. In years since, its investigations have led to increased review of the Walter Reed Army Medical Center.[8] The newspaper is also known as the namesake of The Washington Post March, which John Phillip Sousa composed in 1889 while he was leading the United States Marine Band;[9] it became the standard music to accompany the two-step, a late 19th-century dance craze.[10]\n\nThe newspaper has won 47 Pulitzer Prizes. This includes six separate Pulitzers awarded in 2008, the second-highest number ever given to a single newspaper in one year.[11] The Post has also received 18 Nieman Fellowships and 368 White House News Photographers Association awards, among others.\n\nOn August 5, 2013, Jeff Bezos agreed to purchase the newspaper for $250 million in cash, completing the transaction on October 1, 2013.[1][2][12] The newspaper is owned by Nash Holdings LLC, a holding company created for the acquisition and controlled by Bezos","torrent":{"xt":"urn:btih:574a75b8880cefa73efeeea2a48cbea46c7ff1bb","amp;dn":"The_Washington_Post_20_nov_2013_.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"574a75b8880cefa73efeeea2a48cbea46c7ff1bb","infoHashBuffer":{"type":"Buffer","data":[87,74,117,184,136,12,239,167,62,254,238,162,164,140,190,164,108,127,241,187]},"announce":[],"urlList":[]}}