{"title":"A Certain Slant of Light - The First Hundred Years of New Englan","uid":10277786,"size":27023463,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:57d39cabb710275b78f307b83a6b4272a8aee738&amp;dn=A+Certain+Slant+of+Light+-+The+First+Hundred+Years+of+New+Englan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1401664382,"description":"pdf / English / 25.7 Mb / 264 pages / 1980\n\n125 black-and-white illustrations. Dust jacket notes: &quot;New England's 'certain slant of light' has captivated not only Emily Dickinson and generations of other beloved poets and painters but also a long line of distinguished photographers. How and why these men and women aimed their cameras at the people, places, and ways of life in New England is the theme of this book. They were a mixed lot - tinkerers and doctors, astronomers and socialites, housewives and mountain men, balloonists and reformers, with a few con men and crackpots for good measure. Their work, as diverse as their backgrounds and motives, also mirrors the astonishing variety and leadership of this tiny region. Rich in anecdote and fresh insights into New England's cultural and scientific history from 1839 to 1950, A Certain Slant of Light chronicles firsts in medical, astronomical, aerial, meteorological, and high-speed photography. It treats many kinds of documentary photography, ranging from one man's lifelong portrait of Walden Pond to the pictures of urban poverty that led to America's first housing project. It discusses reclusive amateurs whose genius lay unrecognized during their lifetimes, and professionals who turned the photography of New England into a lucrative industry. Many great names are here - among them Southworth and Hawes, John Adams Whipple, Oliver Wendell Holmes, James Wallace Black, Lewis Hine, Charles H. Currier, Chansonetta Stanley Emmons, Herbert W. Gleason, Fred Holland Day, Alvin Langdon Coburn, Ralph Steiner, the Farm Security Administration photographers, Ernst Halberstadt, Harold Edgerton, Wallace Nutting, Samuel Chamberlain, Walker Evans, and Paul Strand. But Mr. Robinson goes beyond the masters, paying homage also to many unsung photographers who made quiet, often anonymous, but just as clear-sighted and memorable images that say, 'Here is New England.'&quot;","torrent":{"xt":"urn:btih:57d39cabb710275b78f307b83a6b4272a8aee738","amp;dn":"A+Certain+Slant+of+Light+-+The+First+Hundred+Years+of+New+Englan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57d39cabb710275b78f307b83a6b4272a8aee738","infoHashBuffer":{"type":"Buffer","data":[87,211,156,171,183,16,39,91,120,243,7,184,58,107,66,114,168,174,231,56]},"announce":[],"urlList":[]}}