{"title":"HYPE - The Obama Effect","uid":4479130,"size":1515394560,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:57eda6ed0289b5e3eb781a7f25053957139e624b&amp;dn=HYPE+-+The+Obama+Effect&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SDPlissken96","files":2,"time":1225479262,"description":"Citizens United Productions examines the phenomenon that is Barack Obama. HYPE The Obama Effect examines the Junior Senator from Illinois and his record. Is he the new Kennedy or recycled Jimmy Carter? Is he the one who will finally change Washington, or will challenge reveal politics as usual? Will he provide the unity that this country desperately desires, or create a larger divide? HYPE The Obama Effect seeks the answers. Including interviews with political leaders, media experts, and social commentators, HYPE provides the in-depth analysis that can only occur in a full-length feature documentary.\n\nTo Quote Sir Winston Churchill:\n\n&quot;You ask, what is our policy? I can say: It is to wage war, by sea, land and air, with all our might and with all the strength that God can give us: to wage war against a monstrous tyranny, never surpassed in the dark, lamentable catalogue of human crime. That is our policy. You ask, what is our aim? I can answer in one word: It is victory, victory at all costs, victory in spite of all terror, victory, however long and hard the road may be; for without victory, there is no survival.&quot;","torrent":{"xt":"urn:btih:57eda6ed0289b5e3eb781a7f25053957139e624b","amp;dn":"HYPE+-+The+Obama+Effect","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57eda6ed0289b5e3eb781a7f25053957139e624b","infoHashBuffer":{"type":"Buffer","data":[87,237,166,237,2,137,181,227,235,120,26,127,37,5,57,87,19,158,98,75]},"announce":[],"urlList":[]}}