{"title":"Delta Goodrem - Innocent Eyes (2003) FLAC","uid":5796762,"size":394255705,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:58002cc334e15d1d373df38f040d37dab33c8746&amp;dn=Delta+Goodrem+-+Innocent+Eyes+%282003%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"piratetorrent1989","files":14,"time":1283042481,"description":"Delta Lea Goodrem (born 9 November 1984) is an Australian singer-songwriter, pianist, and actress. Signed to Sony at the age of 15, Goodrem rose to prominence in 2002, starring in the popular Australian soap Neighbours as Nina Tucker, and this assisted her establishing an international music career. Goodrem has achieved eight #1 singles in her home country including all three of her studio albums reaching #1. She currently holds the record for the highest selling album of the last decade and the most #1 singles from any debut album, with all five of her singles from her debut album Innocent Eyes reaching #1 on the ARIA charts. Her repertoire falls under the pop and adult contemporary styles, and heavily features the piano, which she usually plays barefoot while performing live. Her music is influenced by vast array of styles including Classical, Adult Contemporary music, Pop and Soft Rock. She is currently the face of Sunsilk and So Good in Australia. Her debut album, 2003's Innocent Eyes, gave her the highest selling Australian album of the last decade, in the process making her one of Australia's highest selling female recording artists of all time. Goodrem is currently in the process of recording her 4th studio album due for release early 2011.\n\n-------------------------------\n\nInnocent Eyes is the first album by Australian singer Delta, released in Australia on March 21, 2003 (see 2003 in music) by Epic Records and Mercury Records, with license to The Island Def Jam Group Australia Corporation Recording Company Records Entertainment. The album is a collection of piano-based pop and ballad tracks. Goodrem co-wrote most of the material, excluding &quot;Throw It Away&quot;, &quot;Lost Without You&quot; and &quot;Butterfly&quot;. It features two solely self-penned songs, &quot;In My Own Time&quot; and &quot;Will You Fall for Me&quot;. Innocent Eyes debuted at number-one on the Australian Albums Chart making it her first number-one album[1] and altogether selling 4.5 million copies worldwide (1.2 million in Australia alone). The album produced Goodrem five Australian number-one singles with &quot;Born to Try&quot;, Lost Without You, &quot;Innocent Eyes&quot;, &quot;Not Me, Not I&quot; and &quot;Predictable&quot;, giving her the record for becoming the first ever artist to have five number-one singles from a debut album.\n\nInnocent Eyes was the most successful album in Australia in 17 years. It was the highest-selling album in Australia of the decade, and is the third highest-selling album in Australian history.\n\n-------------------------------\n\nTrack listing\n\n1 - Born To Try\n2 - Innocent Eyes\n3 - Not Me, Not I\n4 - Throw It Away\n5 - Lost Without You\n6 - Predictable\n7 - Butterfly\n8 - In My Own Time\n9 - My Big Mistake\n10 - This Is Not Me\n11 - Running Away\n12 - A Year Ago Today\n13 - Longer\n14 - Will You Fall For Me\n\nEnjoy, and remember to seed ;)","torrent":{"xt":"urn:btih:58002cc334e15d1d373df38f040d37dab33c8746","amp;dn":"Delta+Goodrem+-+Innocent+Eyes+%282003%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58002cc334e15d1d373df38f040d37dab33c8746","infoHashBuffer":{"type":"Buffer","data":[88,0,44,195,52,225,93,29,55,61,243,143,4,13,55,218,179,60,135,70]},"announce":[],"urlList":[]}}