{"title":"Drawing - Glenn Vilppu","uid":11760284,"size":1544554090,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:58799d958575ec4d443fd8b403c64c624a2e8057&amp;dn=Drawing+-+Glenn+Vilppu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"mdusanjay","files":14,"time":1426562897,"description":"Drawing the Figure: Legs by G. Vilppu\n\nEnglish | 1 h 6 m 55 s | Aac, 44100 Hz, stereo | mpeg4, yuv420p, 1280x720, 29.97 fps | 616 MB\nGenre: eLearning\n\nIn this video lesson series Glenn Vilppu will break down each area of the human figure to show you the essential construction for drawing. You will learn about the anatomy of each region in addition to learning useful ways to think about the structures three-dimensionally. Glenn will demonstrate for you over the live model as well as through clear diagrammatical drawings. By the end of this series you should have a much firmer grasp on the complexity of the human figure that can be built upon even further. In this lesson Glenn will teach you how to draw legs.\n &lt;a href=&quot;\nhttp://www.newmastersacademy.org/drawing-figure-legs/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.newmastersacademy.org/drawing-figure-legs/&lt;/a&gt;\n\nDrawing the Figure: Proportions by G. Vilppu\n\nEnglish | 59m 47s | Aac, 44100 Hz, stereo | mpeg4, yuv420p, 1280x720, 29.97 fps | 564 MB\nGenre: eLearning\n\nIn this video lesson series Glenn Vilppu will break down each area of the human figure to show you the essential construction for drawing. You will learn about the anatomy of each region in addition to learning useful ways to think about the structures three-dimensionally. Glenn will demonstrate for you over the live model as well as through clear diagrammatical drawings. By the end of this series you should have a much firmer grasp on the complexity of the human figure that can be built upon even further. In this lesson Glenn will teach you how to draw the proportions.\n\nDrawing Facial Expressions by G Vilppu\n\nEnglish | 28 m 43 s | Aac, 44100 Hz, stereo | mpeg4, yuv420p, 1280x720, 29.97 fps | 272 MB\nGenre: eLearning\n\nIn this video lesson master artist, Glenn Vilppu will teach you how to build upon your knowledge of the structure of the head in order to capture facial expressions to bring your drawings and paintings to life. Glenn will walk you through an approach to deal with this complex and challenging subject that you can apply to your own work either working from a model or completely from imagination","torrent":{"xt":"urn:btih:58799d958575ec4d443fd8b403c64c624a2e8057","amp;dn":"Drawing+-+Glenn+Vilppu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58799d958575ec4d443fd8b403c64c624a2e8057","infoHashBuffer":{"type":"Buffer","data":[88,121,157,149,133,117,236,77,68,63,216,180,3,198,76,98,74,46,128,87]},"announce":[],"urlList":[]}}