{"title":"Coast to Coast AM December 04 2012","uid":7890844,"size":56869521,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:594a9b73761f3345a686a413d1513005fce3d64c&amp;dn=Coast+to+Coast+AM+December+04+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1354718868,"description":"Date: \t12-04-12\nHost: \tGeorge Noory\nGuests: \tJohn St. Augustine, Robert Zubrin\n\nKnown as The Voice of Uncommon Sense, producer John St. Augustine discussed the amazing coincidences and synchronicities that have happened in his career and life including two NDEs, and the spiritual events which paved the way for his life-saving kidney donation to his daughter. His first NDE occurred at age 19 when he suffered a severe electrical shock. He had a view from outside himself, and was brought back to life with CPR given by a medic who coincidentally happened to be at his location. Later during his recovery from severe burns, he learned the lesson that you have to take ownership of your pain in order to heal.\n\nBy the time he had his second NDE, 8 years later, when he was severely injured in a car accident, he began to refer to it as a Near Life Experience, because of the profound life changes it brought him. He also shared some unusual experiences &amp; synchronicities regarding the late singer John Denver, whom he befriended. After Denver's death, St. Augustine had a series of dreams related to the singer's guitars being misplaced, which he later confirmed as fact when he spoke with the Denver's manager.\n\nSt. Augustine detailed his involvement with Native American elders, and his experiences at sweat lodges, which allowed him to access deeper parts of himself, as well as visions. One of these, was to embark on a 1,000 mile walk from Upper Michigan to Chicago and back, which he did in 1996. During the walk, he heard a voice &quot;like orders from headquarters,&quot; saying: &quot;John, go on the radio.&quot; This was what inspired him to approach various radio stations, eventually landing a gig at a CBS affiliate. He also shared the events preceding his kidney donation to his daughter, which included a visitation from a figure he called &quot;The Jesus Man,&quot; while he was in a sweat lodge.\nNASA's New Missions\n\nFirst hour guest, aerospace engineer Dr. Robert Zubrin reacted to NASA's announcement to send a new rover to Mars in 2020. &quot;We should have a much richer robotic program than just the next rover 8 years from now...and we should be sending humans to Mars in roughly 8-10 years from now,&quot; he declared. Zubrin was also critical of NASA's planned L2 space station which could control Mars sample missions and some lunar robotics. &quot;The station at L2...is a way to have something for the human spaceflight program to do without it actually embracing the challenge of going to Mars,&quot; he remarked.\n\nNews segment guests: Greg Hunter, Dr. Peter Breggin\nWebsite(s):\n\n    johnstaugustine.com\n    marssociety.org\n    merchantsofdespair.com\n\nBook(s):\n\n    Living an Uncommon Life\n    Every Moment Matters: Savoring the Stuff of Life\n    The Case for Mars: The Plan to Settle the Red Planet\n    How to Live on Mars\n    Merchants of Despair\n\n","torrent":{"xt":"urn:btih:594a9b73761f3345a686a413d1513005fce3d64c","amp;dn":"Coast+to+Coast+AM+December+04+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"594a9b73761f3345a686a413d1513005fce3d64c","infoHashBuffer":{"type":"Buffer","data":[89,74,155,115,118,31,51,69,166,134,164,19,209,81,48,5,252,227,214,76]},"announce":[],"urlList":[]}}