{"title":"A Clockwork Orange (1971) DivX H.264 HD (moviesbyrizzo) MKV","uid":7036569,"size":1468664950,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:59a877ecda1e61d1ba40c01047f95f2496cd56d7&amp;dn=A+Clockwork+Orange+%281971%29+DivX+H.264+HD+%28moviesbyrizzo%29+MKV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moviesbyrizzo","files":-1,"time":1329403068,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0066921/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0066921/&lt;/a&gt;\n\nNote: Mature content - view with care\n\n\nDivX HD H.264 MKV (from 720p hdrip) 1280 X 768 1195k video bitrate  \nand 192k 6ch AAC audio \n\nStanley Kubricks masterpiece &quot;A clockwork Orange&quot; is brought to you \nhere in a reasonable and nice enough quality 1.36GB offering.\n\nThere are two main schools of thought in what is prevailing wisdom within the\ncircles of the Psychology field. The &quot;cognitive humanistic approach&quot;\nbelieves in the use of rational methods to bring about an engagement in the\nmind so as to see a better perspective prevail in the minds of all concerned\nwith its use. It requires of course correct engagement on those aspects of\nreason and emotion that should be validly brought to bear so as to bring true\nwisdom to the situation. Cognitive engagement with issues of punishments and\nrewards that flow normally in what choices are made in human affairs would be\n&quot;par for the course&quot; as it were, when using this approach, and required too\ncertainly and indispensably. That should go without saying I suppose. In this\nmodel, punishments would have to be seen as normally applied only to the\nextent that such use is kept sane, however - in what a reasonable such person\nwould fathom as such and completely so I suggest.\n\nOn the other hand, behaviorism is a belief in the use of only punishments\nmainly that reason is engaged - and the absence of punishment is considered\na reward  obviously - in addition to other incentive use of tokens perhaps, \nas a belief in control through such a regime is all that is the basis for the\nemployment of such tactics. The difference between this approach and\nthe (previously mentioned) modern school of &quot;cognitive humanistic therapies&quot;\nis mainly in regards to the view as to whether man is a rational being a being\nwith a conscience potentially engaged therefore, or simply more animalistic \nsort of a being which is therefore controlled by external restraints mainly -\nand based invariably on what are &quot;survival instincts&quot; alone. In the\ncase of the latter, some advocate that only the most severe forms of \npunishments can be used for human management as it were as they regard men as\nactually devoid of conscience in the absence of oppressive controls.\nMany practice behaviorism strategies without regard to rational engagement\nin a bid to make man simply responsive to control and without regard\nto having valid ends for this idea of control - including as to whether\na still sane man is to be the end result of surviving such treatment.\nAs a result, this approach has long been discredited by modern schools\nof alternative thought in the mental health profession and Western society\nin general. Those who lack human sanity in their own minds rarely can\napply appropriate use of cognitive approaches are are always behaviourism\ncentered in order to degenerate human stocks which they might have the means\nto control (as a means of venting the psychosis that such a mind is invariably\nmade of instead).\n\n\nIn this movie, we get a look at &quot;aversion therapy&quot;, aimed to reduce\nthe pleasure from sadistic acts that a freak mind might otherwise \nengage in. We see depicted, what is brutal Rape and other sadistic acts\nsuch as senseless murder in what is a display of freak like enjoyment of\nsuch crimes. &quot;Perhaps this therapy could work&quot; we are told only I\nthink in abstract theoretical terms to generate discussion.\n\nIn actual fact, it is my own view that &quot;capital punishment&quot; (the death penalty)\nis the only alternative that is truly sane and practical as no being that\nabstains from sadistic criminality based only on fear of punishment is a being\nthat is worth sustaining in our midst. To intent to commit the crime \n(given the opportunity with impunity perhaps) is evil enough and that threat\nis more than those innocent members of society should have to endure. \n\nYou cannot control through artificial means as a freak outcome\nis all you will persist in sustaining at a cost to our sanity which\nis too high to bear.\n\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\n\nsrt Subtitles included for - please check the net for others too\nArabic\nBosnian\nBrazilian Portuguese\nBulgarian\nCzech\nDanish\nDutch\nEnglish\nEstonian\nFarsi\nFinnish\nFrench\nGerman\nGreek\nHebrew\nItalian\nLithuanian\nNorwegian\nPolish\nPortuguese\nRomanian\nSlovenian\nSpanish\nSwedish\nTurkish","torrent":{"xt":"urn:btih:59a877ecda1e61d1ba40c01047f95f2496cd56d7","amp;dn":"A+Clockwork+Orange+%281971%29+DivX+H.264+HD+%28moviesbyrizzo%29+MKV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59a877ecda1e61d1ba40c01047f95f2496cd56d7","infoHashBuffer":{"type":"Buffer","data":[89,168,119,236,218,30,97,209,186,64,192,16,71,249,95,36,150,205,86,215]},"announce":[],"urlList":[]}}