{"title":"The Pirate's Dilemma (eng) PDF","uid":4280727,"size":1570608,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5bb44312732a7fa9d20e7b2ed433dc365ae2b4bd&amp;dn=The+Pirate%5C%27s+Dilemma+%28eng%29+PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"ZOiT_The_Pirate","files":1,"time":1215407209,"description":"The Pirate&amp;#039;s Dilemma\n\n~About~\n\nHow do you start a movement with a marker pen? What?s the connection between the nun who invented disco, and file sharing? How did a male model messing with disco records in New York in the 1970s influence the way Boeing design airplanes? Does hip-hop really hold the secret to world peace? How did three eleven-year-olds revolutionize the video game industry by turning Nazis into Smurfs? And what?s going to happen to Nike when it?s possible for kids to download sneakers?\n\nThe Pirate?s Dilemma tells the story of how youth culture drives innovation and is changing the way the world works. It offers understanding and insight for a time when piracy is just another business model, the remix is our most powerful marketing tool and anyone with a computer is capable of reaching more people than a multi-national corporation.\n\nDo we fight pirates, or do we learn from them?\n\nIdeas that started within punk, disco, hip-hop, rave, graffiti and gaming have been combined with new technologies and taken to new heights by the generations that grew up under their influence. With a cast of characters that includes such icons as The Ramones, Andy Warhol, Madonna, Russell Simmons, Pharrell and 50 Cent, The Pirate?s Dilemma uncovers, for the first time, the trends that transformed underground scenes into burgeoning global industries and movements, ultimately changing life as we know it, unraveling some of our most basic assumptions about business, society and our collective future.\n\nAs a result people, companies and organizations are now struggling with a new dilemma in increasing numbers. As piracy continues to change the way we all use information, how should we respond? Do we fight pirates, or do we learn from them? Should piracy be treated as a problem, or a solution? To compete or not to compete - that is the question ? that is the Pirate?s Dilemma, perhaps one of the most important economic and cultural conundrums of the 21st Century.\n\n~~~~~~~~~~~~~~~~~~~~~~~~\n\nA good read, and brings up very interesting points.\n\nEnjoy,\n~ZOiT","torrent":{"xt":"urn:btih:5bb44312732a7fa9d20e7b2ed433dc365ae2b4bd","amp;dn":"The+Pirate%5C%27s+Dilemma+%28eng%29+PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bb44312732a7fa9d20e7b2ed433dc365ae2b4bd","infoHashBuffer":{"type":"Buffer","data":[91,180,67,18,115,42,127,169,210,14,123,46,212,51,220,54,90,226,180,189]},"announce":[],"urlList":[]}}