{"title":"Dead Ringers - Series 01 to 11 - Audio Comedy - 128Kbps - Mp3 - ","uid":5277341,"size":1359178970,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5d51a99fe0e3ecf61ceaa38a20ac14724e804f4d&amp;dn=Dead+Ringers+-+Series+01+to+11+-+Audio+Comedy+-+128Kbps+-+Mp3+-+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_Slimoo_","files":56,"time":1263420285,"description":"Dead Ringers - Series 01 to 11 - Audio Comedy - BBC7 via DVB-T  \n56 x 30 Minute Episodes - 128Kbps (10 @ 64k) - Mp3 - Slimoo\n\n[b]Thanks again to Lester for filling some gaps[/b]\n\n\nDead Ringers is a UK radio (and television) comedy impressions show on BBC Radio 4  \n\nDespite its emphasis on British personalities who may not be well known in other countries, Dead Ringers has been shown outside the UK on BBC Prime in Europe and Africa, BBC America in the United States, ABC in Australia, BBC Canada in Canada and UK.TV in New Zealand, but has had to be re-edited considerably; although much of the show can be watched without contextual knowledge.\n\nDead Ringers transports you to an alternative Radio 4 where deadly continuity announcers rule the roost and Home Truths finally (inevitably?) clashes with John Peel's Radio 1 Show. Where a desperate Time Lord calls directory enquiries in search of his sworn arch-enemy and Alan Bennett and Thora Hird are the kind of thugs you most certainly wouldn't share your buttered scones with.\n\n\n\n\nDead Ringers - S01 - E01 - London, Last Thursday Night \nDead Ringers - S01 - E02 - You're Listening To The Today Programme \nDead Ringers - S01 - E03 - Thank You For Coming To The Interview, Mr Boyle \nDead Ringers - S01 - E04 - The News At 9 O'clock \n\nDead Ringers - S02 - E01 - Well, Time Now To Grill Headlines Over A Live Flame \nDead Ringers - S02 - E02 - Hi, It;s Gary Lineker Here. \nDead Ringers - S02 - E03 - And Hearts Were Lifted This Week \nDead Ringers - S02 - E04 - Ewan, We Need To Talk \nDead Ringers - S02 - E05 - Yes, It's Me, Trevor McDonald \nDead Ringers - S02 - E06 - And Here She Is Waving Regally To The Crowd \nDead Ringers - S02 - E07 - You're Listerning To. Today \nDead Ringers - S02 - E08 - Lovely, Welcome To Dibley Everyone \n\nDead Ringers - S03 - E01 - You're Listening To Today Where It's 24 Hours From Tulsa \nDead Ringers - S03 - E02 - G'day There. It's Your Old Mate Rolf Here \nDead Ringers - S03 - E03 - We Talk Tonight \nDead Ringers - S03 - E04 - What A Long But Rewarding Day That Was Cherie \nDead Ringers - S03 - E05 - What A Momentous Moment This Is Sue \nDead Ringers - S03 - E06 - Archers Special \n\nDead Ringers - S04 - E01 - This Is BBC Radio 4 \nDead Ringers - S04 - E02 - Er, Mr President. Great News. They\u0019ve Said Yes \nDead Ringers - S04 - E03 - As Leader Of This Conservative Party \nDead Ringers - S04 - E04 - People Of Great Britain, This Is Your Prime Minister \nDead Ringers - S04 - E05 - Election Special \n\nDead Ringers - S05 - E01 - And As The Race Draws To A Close \nDead Ringers - S05 - E02 - Well, I'm Leaving You J R \nDead Ringers - S05 - E03 - People Of Britain. No, We Were Not Dreaming \n[b]Dead Ringers - S05 - E04 - (Never Broadcast, 9-11)[/b]\n\nDead Ringers - S06 - E01 - People Of Great Britain, This Is Your Prime Minister \nDead Ringers - S06 - E02 - Ok, Ok, Er Gentlemen Of The Press, Welcome To The White House \nDead Ringers - S06 - E03 - Ah, Mr President. Can We Stop Looking For It Now \nDead Ringers - S06 - E04 - BBC Radio 4, I'm Charlotte Green \nDead Ringers - S06 - E05 - People Of Britain, My Visit To The Indian Subcontinent \n[b]Dead Ringers - S06 - ESP - Best Of 2001 - Part 1 &lt; Missing[/b] \nDead Ringers - S06 - ESP - Best Of 2001 - Part 2 \n\nDead Ringers - S07 - E01 - You Join Us On A Very Solemn Day \nDead Ringers - S07 - E02 - And Now On R4, Its Time For The Archers \nDead Ringers - S07 - E03 - On The Week That He Is Celebratified \nDead Ringers - S07 - E04 - Yes, You Join Me John Motram \nDead Ringers - S07 - E05 - Golden Jubilee Special \n\nDead Ringers - S08 - E01 - BBC Radio 4, I'm Brian Perkins (Edinbugh Special) \nDead Ringers - S08 - E02 - People Of Britain (Edinbugh Special) \nDead Ringers - S08 - E03 - My Fellow Americans \nDead Ringers - S08 - E04 - People Of Britain, I Speak To You Today \n\nDead Ringers - S09 - E01 - BBC Radio 4, I'm Charlotte Green \nDead Ringers - S09 - E02 - People Of Britain, This Is You Prime Minister \nDead Ringers - S09 - E03 - I Wanted To Be The First To Congratulate You Mr. President \nDead Ringers - S09 - E04 - Where Must My Quest Take Me Oh Wise Wizard Gandalf \n\nDead Ringers - S10 - E01 - So, Abdul, What Has Been The Latest Reaction \nDead Ringers - S10 - E02 - BBC Radio 4, I'm Lord Luchan \nDead Ringers - S10 - E03 - People Of Britain, Hand On Forehead \nDead Ringers - S10 - E04 - People Of Britain, I Hope You Appreciate \nDead Ringers - S10 - E05 - People Of Britain, Oh I Do Hate To Be By The Seaside\n\nDead Ringers - S11 - E01 - The Assembly Hall Theatre, Royal Tunbridge Wells\nDead Ringers - S11 - E02 - Warwick Arts Centre\nDead Ringers - S11 - E03 - New Theatre, Cardiff\nDead Ringers - S11 - E04 - Hull City Hall\nDead Ringers - S11 - E05 - The Anvil, Basingstoke\nDead Ringers - S11 - E06 - The Rex Cinema, Berkhamsted\n\n\nAudio Format    : MP3\nDuration Approx : 28mn 54s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\n\n. \n","torrent":{"xt":"urn:btih:5d51a99fe0e3ecf61ceaa38a20ac14724e804f4d","amp;dn":"Dead+Ringers+-+Series+01+to+11+-+Audio+Comedy+-+128Kbps+-+Mp3+-+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d51a99fe0e3ecf61ceaa38a20ac14724e804f4d","infoHashBuffer":{"type":"Buffer","data":[93,81,169,159,224,227,236,246,28,234,163,138,32,172,20,114,78,128,79,77]},"announce":[],"urlList":[]}}