{"title":"June Of 44 - Tropics And Meridians","uid":4410015,"size":233562134,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5d5868886f78e03316e3f6535015ee710ef110ea&amp;dn=June+Of+44+-+Tropics+And+Meridians&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"toadhenryjnr","files":3,"time":1222130902,"description":"This is all I have so any more lossless June of 44 would be most appreciated. Enjoy.\n\n1. Anisette\n2. Lusitania\n3. Lawn Bowler\n4. June Leaf\n5. Arms over Arteries\n6. Sanctioned in a Birdcage\n\nAlbum Review from hxxp://www.windowsmedia.com\n\nFeaturing current and former members of slowcore icons Codeine and post-rock bands like Rodan, Rex, and the Sonora Pine, June of 44 is proof positive that a musically incestuous scene can sometimes be a good thing. With origins in the same Louisville scene that gave birth to obvious influences Squirrel Bait and Slint, this quartet sticks more toward the rock side of the instrumental music spectrum, but with more than enough dynamic compositional elements to give them a distinctive sound. Tropics and Meridians, their second LP, picks up right where their formidable debut left off, with a similarly broad spectrum of song structures. &quot;Anisette&quot; rides along on a menacing subterranean bass groove as Jeff Mueller delivers indecipherable howling that the Jesus Lizard would be proud of, while &quot;Lawn Bowler&quot; conjures up the spirit of Slint with its shifting moods and creepily dissonant harmonies. &quot;June Leaf&quot; is damn near danceable, with a freight-train-a-rollin&amp;#039; rhythm and a supple guitar line that caresses you oh-so-gently, then smacks you hard across the face for getting fresh. The album is just six tracks clocking in at just over 36 minutes, but it still offers plenty of bang for your 15 bucks. ~ Bret Love, All Music Guide","torrent":{"xt":"urn:btih:5d5868886f78e03316e3f6535015ee710ef110ea","amp;dn":"June+Of+44+-+Tropics+And+Meridians","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d5868886f78e03316e3f6535015ee710ef110ea","infoHashBuffer":{"type":"Buffer","data":[93,88,104,136,111,120,224,51,22,227,246,83,80,21,238,113,14,241,16,234]},"announce":[],"urlList":[]}}