{"title":"A Boyfriend for Christmas (ENG)(NL SUBS) 2Lions-Team","uid":5239455,"size":3655968449,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5d5aa07234477a17b332a2668b3f9aea73857bb0&amp;dn=A+Boyfriend+for+Christmas+%28ENG%29%28NL+SUBS%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pioen","files":-1,"time":1261684910,"description":"Boyfriend for Christmas, A (2004)        \n\n\n\n\nVerenigde Staten\nRomantiek\n90 minuten\n\ngeregisseerd door Kevin Connor\nmet Patrick Muldoon, Kelli Williams en Charles Durning\n\nHolly heeft maar ÃƒÂ©ÃƒÂ©n ding in gedachten voor kerstmis en dat is een vriend voor minimaal twintig jaar. Nu maar hopen dat de kerstman haar wens in vervulling zal laten gaan\n\nEnglish\n\nHolly is not looking forward to Xmas. Her brother has a wife and kids to bring to their parents' house. She hasn't had a boyfriend since Ted. Holly loved Ted but he broke her heart when he chose to break up with her when he was transferred to an out of town newspaper owned by his family's publishing empire. Oh, and work is unrewarding--today the woman Holly was helping failed to regain custody of her kids when pro bono lawyer Ryan Hughes never showed up at the hearing. Knowing she will never meet Hughes, Holly has to settle for dictating a nasty letter to him. Holly's friend Diane tries to perk her up by promising to send her a great Xmas present. So when a handsome man with a Xmas tree knocks at her door, she realizes Douglas Firwood is her present and she can take him home to her parents for the day as a boyfriend she is serious about. Holly thinks the day is going perfectly--she and Doug are hitting it off, her family likes Doug, and her family believes every fact about Doug that she dreams up on the spur of the moment. There are three truths she doesn't realize: her brother's wife foresees great professional advancement if she can get his new boss Ted married to Holly so Ted is coming over, Diane's gift to Holly was a great bottle of booze, and how unbelievably coincidental it is that the man showing up at her door carrying a Douglas fir should claim to be named Douglas Firwood. \n\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail pal\nMenu : Yes\nAudio Englih 3.2\n \nOndertitels : Nederlands (Extern)\n \nGenre : Familiefilm\nRomantiek\n \nWeblink : http://www.moviemeter.nl/film/26018 \nWeblink : http://www.imdb.com/title/tt0385567\n\n***************************************** \n\nBrought to you by\n\n\n2Lions Team \n\n        &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt; \n\n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.","torrent":{"xt":"urn:btih:5d5aa07234477a17b332a2668b3f9aea73857bb0","amp;dn":"A+Boyfriend+for+Christmas+%28ENG%29%28NL+SUBS%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d5aa07234477a17b332a2668b3f9aea73857bb0","infoHashBuffer":{"type":"Buffer","data":[93,90,160,114,52,71,122,23,179,50,162,102,139,63,154,234,115,133,123,176]},"announce":[],"urlList":[]}}