{"title":"Paul Temple Intervenes (1942","uid":11634843,"size":174109920,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5ddb8b088a2c59542df104ecfe17cf4e6b1ad2e1&amp;dn=Paul+Temple+Intervenes+%281942&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SKRUVAD_WRESTLING","files":5,"time":1417719685,"description":"From 1942, in one of the oldest full-length radio dramas in the BBC archive, Carl Bernard stars as Paul Temple and Bernadette Hodgson as his wife Steve. From 1938 to 1969, the fictional crime novelist and detective Paul Temple, together with his &quot;Fleet Street&quot; journalist wife Steve, solved case after case in one of BBC radio's most popular series. They inhabited a sophisticated world of chilled cocktails and fast cars, where the women were chic and the men wore cravats - a world where Sir Graham Forbes, of Scotland Yard, usually needed Paul's help with his latest tricky case. The murder of well-known American Myron Harwood, found dead in a small country lane, heralds the start of a series of celebrity murders. Each time, the body is found with a small, square piece of white cardboard bearing the inscription 'The Marquis'. When the eighth victim, a girl, is picked out of the river with the same card attached to her dress, a note from Paul Temple is delivered to Sir Graham Forbes. The message reads: 'Is it true what they say about Rita?' Rita Cartwright was a private detective investigating the Marquis murders - and now she too has ended up dead. With the police baffled and the Home Secretary specially requesting his involvement, Paul Temple has no choice but to interven.\n................................................................................\n\nTime: 2 H 25 M\n\nSound Quality: good Quality The radio show is from 1942 (its copy from casset)\n\nCover From cd\n................................................................................\n\nEnjoy I have more","torrent":{"xt":"urn:btih:5ddb8b088a2c59542df104ecfe17cf4e6b1ad2e1","amp;dn":"Paul+Temple+Intervenes+%281942","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ddb8b088a2c59542df104ecfe17cf4e6b1ad2e1","infoHashBuffer":{"type":"Buffer","data":[93,219,139,8,138,44,89,84,45,241,4,236,254,23,207,78,107,26,210,225]},"announce":[],"urlList":[]}}