{"title":"Europa Universalis IV-ALiAS","uid":8809632,"size":188556748,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5e4751faaa03111347ebeb7911129b27d72184e8&amp;dn=Europa+Universalis+IV-ALiAS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AN0NYMOUS142857","files":21,"time":1376425887,"description":"\nRELEASE\niNFOS\n\nEuropa Universalis IV\n(c) Paradox Interactive\n\nRelease date: 13/08/2013 Protection: Steam\nFiles: 19x10.00MB Language: Multi\n\nRELEASE\nNOTES\n\nParadox Development Studio is back with the fourth installment of\nthe game that defined the Grand Strategy Genre. Europa Universalis\nIV gives you control of a nation to guide through the years in\norder to create a dominant global empire. Rule your nation through\nthe centuries, with unparalleled freedom, depth and historical\naccuracy\n\nTrue exploration, trade, warfare and diplomacy will be brought to\nlife in this epic title rife with rich strategic and tactical depth\nMain Features\n\n? Make your own decisions: Nation building is flexible. Decide your\nown form of government, the structure of your society, trade\npolitics and more. The possibilities are endless\n\n? Use your Monarch Power: Experience the new system of monarch\npower where your choices are influenced by the caliber of the man\nyou have at the top. Do you have a warrior King? Then it is time to\nmake war\n\n? Experience history come to life: The great people and\npersonalities of the past are on hand to support you. Thousands of\nhistorical events guide you, creating a unique atmosphere depending\non the country you play\n\n? The world is now your playground: Players can enjoy over 300\nyears of gameplay with a lush topographic map in full 3D. Lead any\none of more than 250 countries that originally existed during the\ngame s extensive time span\n\n? Experience the all new trade system: The trade system adds a new\ndimension to the great trade empires of the period. Seize control\nof key ports to expand your trade, support it with your powerful\nfleet and the wealth of the world will flow to you\n\n? Bring out your diplomatic skills: Deeper diplomatic gameplay with\ncoalitions, threats, fleet basing rights and detailed support for\nrebels. Featuring a new unilateral opinion system that, for\nexample, allows a country to dislike you while you remain neutral\ntowards them\n\n? Engage in Multiplayer: Battle against your friends or try the\nco-operative multiplayer mode that allows several players to work\ntogether to control a single nation with up to 32 players\nFeaturing hotjoin, improved chat, new matchmaking servers and\nsupport for a standalone servers\n\n? Create your own history &amp; customize your game: Europa Universalis\nIV gives you the chance to customize and mod practically anything\nyour heart may desire\n\n1. Unzip &amp; Unrar\n2. Run Setup.exe for install\n3. Start the Game with eu4_launch.exe\n4. Have Fun!!!!\n\nRipped: Music\n\nNOTES\n\nLanguages: English, German, French, Spanish (edit steam_rld.ini)\n\n1. Don't forget to add an exception to your antivirus (if required)\n2. Block all game executables in your firewall\n\nSupport the software developers. If you like this game, BUY IT!\n\nALiAS GREETS\n\nOur Friends!!!\n\nASCii DOPE BY\n\nNERV/SAC!","torrent":{"xt":"urn:btih:5e4751faaa03111347ebeb7911129b27d72184e8","amp;dn":"Europa+Universalis+IV-ALiAS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e4751faaa03111347ebeb7911129b27d72184e8","infoHashBuffer":{"type":"Buffer","data":[94,71,81,250,170,3,17,19,71,235,235,121,17,18,155,39,215,33,132,232]},"announce":[],"urlList":[]}}