{"title":"Rebecca Forster - Witness Series,epub,Mobi,KK","uid":6882976,"size":3260245,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5edba64bf0ca030b8cc85f4a403b2c076bfb1c8c&amp;dn=Rebecca+Forster+-+Witness+Series%2Cepub%2CMobi%2CKK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"karaokeking123","files":-1,"time":1323712052,"description":"Rebecca Forster - Witness Series \n\n01.Character Witness \nHired by a woman who wants to sue her ex-husband's estate to collect his life insurance, attorney Kathleen Cotter follows a dangerous trail of corruption and betrayal that reaches to the highest levels of government as she tries to prove that the late Lionel Brooker did not commit suicide. \n\n02.Hostile Witness\n Some secrets aren't uncovered. They are unleashed... \n\nThe national bestselling author is back with a gripping legal thriller of a brilliant lawyer caught between her client, a powerful family's hidden legacy, and the truth... \n\nJosie Baylor-Bates returns to the practice of criminal defense when her friend's sixteen-year-old daughter, Hannah, is arrested for the brutal slaying of her step-grandfather-a California Supreme Court justice. Although all evidence points to Hannah's guilt, her family's disturbing relations may play a more significant role than anyone could guess. As Josie unravels a circle of secrets, she discovers a shocking truth that could save her client-or destroy them all...\n \n03.Silent Witness \nThe inimitable defense attorney Josie Baylor-Bates returns to defend the man she loves from the charge of murdering his own disabled stepson. Walking the fine line between lover and lawyer, trust and truth, Josie will have to race against time to prove someone is framing her client-until she finds out that the last, silent witness is the most dangerous of all.\n\n 04.Privileged Witness \nThough attorney Josie Baylor-Bates swore off rich clients years ago, she succumbs to Grace McCreary's plea for help. The sister of a Senate hopeful-Josie's former lover-Grace is accused of murdering her disturbed sister-in-law. As Josie steps back into the world of privilege and power to prove her own worth and her client's innocence, she risks everything she now holds dear.\n \nEnjoy!","torrent":{"xt":"urn:btih:5edba64bf0ca030b8cc85f4a403b2c076bfb1c8c","amp;dn":"Rebecca+Forster+-+Witness+Series%2Cepub%2CMobi%2CKK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5edba64bf0ca030b8cc85f4a403b2c076bfb1c8c","infoHashBuffer":{"type":"Buffer","data":[94,219,166,75,240,202,3,11,140,200,95,74,64,59,44,7,107,251,28,140]},"announce":[],"urlList":[]}}