{"title":"The Comfort of Things","uid":8946080,"size":462192,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5f6e5bb736fa7a97b171711675b804e8700ae060&amp;dn=The+Comfort+of+Things&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"livhre","files":-1,"time":1379780659,"description":"The diversity of contemporary London is extraordinary, and begs to be better understood. Never before have so many people from such diverse backgrounds been free to mix and not to mix in close proximity to each other. But increasingly people's lives take place behind the closed doors of private houses. How can we gain an insight into what those lives are like today? Not television characters, not celebrities, but real people. How could one ever come to know perfect strangers?\nDanny Miller attempts to achieve this goal in this brilliant expos? of a street in modern London. He leads us behind closed doors to thirty people who live there, showing their intimate lives, their aspirations and frustrations, their tragedies and accomplishments. He places the focus upon the things that really matter to the people he meets, which quite often turn out to be material things, the house, the dog, the music, the Christmas decorations. He creates a gallery of portraits, some comic, some tragic, some cubist, some impressionist, some bleak and some exuberant.\nWe find that a random street in modern London contains the most extraordinary stories. Mass murderers and saints, the most charmed Christmas since Fanny and Alexander and the story of how a CD collection helped someone overcome heroin. ","torrent":{"xt":"urn:btih:5f6e5bb736fa7a97b171711675b804e8700ae060","amp;dn":"The+Comfort+of+Things","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f6e5bb736fa7a97b171711675b804e8700ae060","infoHashBuffer":{"type":"Buffer","data":[95,110,91,183,54,250,122,151,177,113,113,22,117,184,4,232,112,10,224,96]},"announce":[],"urlList":[]}}