{"title":"Dr. Scott Hahn - Lord, Have Mercy (13-part audio series + book)","uid":10277790,"size":266246611,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:60a5edc69311e382b2380ec9d422b66381de3d8a&amp;dn=Dr.+Scott+Hahn+-+Lord%2C+Have+Mercy+%2813-part+audio+series+%2B+book%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ancapcatholic","files":-1,"time":1401664522,"description":"In this 13-part series, Dr. Scott Hahn shares the great insight he discovered on his way to becoming Catholic. Namely, that throughout the Old and New Testaments, God consistently used confession as He carefully fathered His family down through the ages. Rather than being another &quot;Catholic invention&quot;, Scott demonstrates that confession is clearly a Biblical practice elevated to a Sacrament by Christ Jesus Himself. \n\nThe series is based on Dr. Hahn's book, &quot;Lord Have Mercy: The Healing Power of Confession &quot;, which is included in a ZIP file in EPUB/MOBI/OPF/PDF formats.\n\n\n13 MP3 files totaling nearly 6.5 hours\n\n\nPART 1, GETTING OUR STORIES STRAIGHT - Mike Aquilina and Dr. Scott Hahn discuss Scott's book, Lord, Have Mercy: The Healing Power of Confession. They talk about Confession's amazing ability to clear the mind and heart. \n\nPART 2, CONFESSION IN THE OLD TESTAMENT - The Healing Power of Confession. Discuss the Old Testament roots of Confession. \n\nPART 3, THE HEALING POWER OF CONFESSION - Today they examine the Sacrament of Reconciliation in the Gospels, the letters of the apostles and in all the New Testament. \n\nPART 4, THE HISTORY OF CONFESSION - The surprising history of the Sacrament of Confession in its various forms from Apostolic times to the present. \n\nPART 5, CONFESSION AS HEALING - Why Confession is referred to as &quot;the Sacrament of Healing&quot;.\n\nPART 6, COMMON OBJECTIONS - Mike Aquilina and Dr. Scott Hahn discuss Scott's book, Lord, Have Mercy: The Healing Power of Confession, addressing some of the most common objections to going to Confession.\n\nPART 7, WHAT'S WRONG WITH THE WORLD - The mysterious and persistent presence of sin in our lives, and how Confession helps prevent sin as well as heal its damage.\n\nPART 8, FROM BAD TO WORSE - Scott explains the difference between mortal and venial sin.\n\nPART 9, ATONEMENT - Scott explains models of atonement, which literally means &quot;at-one-ment&quot;, we are made one family. Confession and penance help to bring us back into the family covenant. \n\nPART 10 - THE SPIRITUALITY OF EXILE - How Confession helps us live out the spirituality of exile by purifying us.\n\nPART 11, REACHING OUT FOR AND WITH CONFESSION - A number of non-Catholics have tried to revive the practice in one form or another, including Martin Luther and C. S. Lewis.\n\nPART 12, WINNING PENANCE - Mike asks, &quot;What lessons can we learn from Confession and apply to everyday life?&quot;\n\nPART 13, HOW TO MAKE A GOOD CONFESSION - Scott and Mike talk about the four elements to making a good Confession.\n\n\nSee also:\n\nDr. Scott Hahn - The Healing Power of Confession (1 hour)\n  &lt;a href=&quot; https://thepiratebay.se/torrent/10174056&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/10174056&lt;/a&gt;\n\nDr. Scott Hahn - Answering Common Objections (6 CD SET)\n  &lt;a href=&quot; https://thepiratebay.se/torrent/10211970&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/10211970&lt;/a&gt;\n\nFr. Larry Richards - Confession (1 hour)\n  &lt;a href=&quot; https://thepiratebay.se/torrent/10204588&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/10204588&lt;/a&gt;\n\n\nMore: https://thepiratebay.se/user/ancapcatholic \n\nBTC: 1N3Y2HNWe3xWY4qdYricHRKz58zqqi5MZp","torrent":{"xt":"urn:btih:60a5edc69311e382b2380ec9d422b66381de3d8a","amp;dn":"Dr.+Scott+Hahn+-+Lord%2C+Have+Mercy+%2813-part+audio+series+%2B+book%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60a5edc69311e382b2380ec9d422b66381de3d8a","infoHashBuffer":{"type":"Buffer","data":[96,165,237,198,147,17,227,130,178,56,14,201,212,34,182,99,129,222,61,138]},"announce":[],"urlList":[]}}