{"title":"Sweet Like Sugar - Wayne Hoffman.epub","uid":9280918,"size":658882,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6237576c1782f4fe11f13881ebe6eb5985c4a23e&amp;dn=Sweet+Like+Sugar+-+Wayne+Hoffman.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Mohammad_AT","files":1,"time":1385938852,"description":"With eloquence and wit, Wayne Hoffman explores the unlikely camaraderie between a young Jewish man and an Orthodox rabbi, in this rich, insightful novel about love, honesty, faith, and belonging.\n\nIn Yiddish, there is a word for it: bashertÂ—the person you are fated to meet. Twentysomething Benji Steiner views the concept with skepticism. But the elderly rabbi who stumbles into Benji's office one day has no such doubts. Jacob Zuckerman's late wife, Sophie, was his bashert. And now that she's gone, Rabbi Zuckerman grapples with overwhelming grief and loneliness.\n\nTouched by the rabbi's plight, Benji becomes his helperÂ—driving him home after work, sitting in his living room listening to stories. Their friendship baffles everyone, especially Benji's sharp-tongued, modestly observant mother. But Benji is rediscovering something he didn't know he'd lost. Yet the test of friendship, and of both men's faith, lies in the difficult truths they come to share. With each revelation, Benji learns what it means not just to be Jewish, but to be fully humanÂ—imperfect, striving, and searching for the pieces of ourselves that come only through another's acceptance.\n\n&quot;A story that is beautifully told, profound and funny. &quot; Â—Jonathan Rosen, author of Joy Comes In The Morning\n\n&quot;A stirring story about the face of love on many different levels.&quot; Â—Carolyn Hessel\n\n&quot;An unforeseen tale of friendship and faith. &quot; Â—Dave King, author of The Ha-Ha\n\nWayne Hoffman is a writer and editor whose cultural reporting has appeared in the Washington Post, Village Voice, The Forward, The Advocate, and elsewhere. Wayne is currently deputy editor of Nextbook Press. He lives in New York City and the Catskills.","torrent":{"xt":"urn:btih:6237576c1782f4fe11f13881ebe6eb5985c4a23e","amp;dn":"Sweet+Like+Sugar+-+Wayne+Hoffman.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6237576c1782f4fe11f13881ebe6eb5985c4a23e","infoHashBuffer":{"type":"Buffer","data":[98,55,87,108,23,130,244,254,17,241,56,129,235,230,235,89,133,196,162,62]},"announce":[],"urlList":[]}}