{"title":"Memtest86 3.5","uid":4709270,"size":535470,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:62384f8cac9c5f3bdc7ff6faecef304213d4a779&amp;dn=Memtest86+3.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"olofolleola4","files":-1,"time":1233958818,"description":"Copied from Memtest86 Homepage:\n\nMemtest86 is thorough, stand alone memory test for x86 architecture computers. BIOS based memory tests are a quick, cursory check and often miss many of the failures that are detected by Memtest86. \n\nMemtest86 was developed by Chris Brady with a first release in 1994. However, the testing algorithms used have been under development since 1981 and have been previously implemented on Dec PDP-11, VAX-11/780 and Cray XMP architectures. Development and distribution of Memtest86 is now funded and supported by BradyTech Inc. \n\nMemtest86 is released under the terms of the Gnu Public License (GPL).\n\n\nError Display\n \n\nMemtest has three options for reporting errors. \nThe default is an an error summary that displays the most relevant error information. The second option is reporting of individual errors. \nIn BadRAM Patterns mode patterns are created for use with the Linux BadRAM feature. This slick feature allows Linux to avoid bad memory pages. \nDetails about the BadRAM feature can be found at: http://home.zonnet.nl/vanrein/badram \n\nThe error summary mode displays the following information: \n\n\nError Confidence Value:\n\nA value that indicates the validity of the errors being reported with\nlarger values indicating greater validity. There is a high probability\nthat all errors reported are valid regardless of this value.\nHowever, when this value exceeds 100 it is nearly impossible that the reported\nerrors will be invalid.\n\nLowest Error Address:\n\nThe lowest address that where an error has been reported.\n\n\nHighest Error Address:\n\nThe highest address that where an error has been reported.\n\n\nBits in Error Mask:\n\nA mask of all bits that have been in error (hexadecimal).\n\n\nBits in Error:\n\nTotal bit in error for all error instances and the min, max and average bit in error of each individual occurrence.\n\n\nMax Contiguous Errors:\n\nThe maximum of contiguous addresses with errors.\n\n\nECC Correctable Errors:\n\nThe number of errors that have been corrected by ECC hardware.\n\n\nErrors per DIMM slot:\n\n*Error counts are reported for each memory module installed in the system.\n*Use the &quot;Show DMI Memory Info&quot; runtime option for detailed memory module information.\n\n\nTest Errors:\n\nOn the right hand side of the screen the number of errors for each test are displayed.\n\n\nFor individual errors the following information is displayed when a memory error is detected. An error message is only displayed for errors with a different address or failing bit pattern. All displayed values are in hexadecimal. \n\nTst: Test Number \nFailing Address: Failing memory address \nGood: Expected data pattern \nBad: Failing data pattern \nErr-Bits: Exclusive or of good and bad data (this shows the position of the failing bit(s)) \nCount: Number of consecutive errors with the same address and failing bits\n\n\nExecution Time \n\nThe time required for a complete pass of Memtest86 will vary greatly depending on CPU speed, memory speed and memory size.\nMemtest86 executes indefinitely. The pass counter increments each time that all of the selected tests have been run. Generally a single pass is sufficient to catch all but the most obscure errors.\nHowever, for complete confidence when intermittent errors are suspected testing for a longer period is advised.\n\n\nChangelog:\n\n\nLimited support for execution with multiple CPUs. CPUs are selected round-robin or sequential for each test. \n\nSupport for detection of additional chipsets. (from Memtest86+ v2.11). \n\nAdditions and corrections for CPU detection including reporting of L3 cache. \n\nReworked information display for better readability and new information. \n\nAbbreviated iterations for first pass. \n\nEnhancements to memory sizing. \n\nMisc bug fixes.\n\n\nComments from the uploader (olofolleola4):\nThis is a bootCD that you have to burn and startup with your computer to start the Memory test","torrent":{"xt":"urn:btih:62384f8cac9c5f3bdc7ff6faecef304213d4a779","amp;dn":"Memtest86+3.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62384f8cac9c5f3bdc7ff6faecef304213d4a779","infoHashBuffer":{"type":"Buffer","data":[98,56,79,140,172,156,95,59,220,127,246,250,236,239,48,66,19,212,167,121]},"announce":[],"urlList":[]}}