{"title":"A Way Out: America's Ghettos and the Legacy of Racism [blackatk]","uid":8770719,"size":346958,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6266bd08e1df237d308409674d11e36353f04821&amp;dn=A+Way+Out%3A+America%27s+Ghettos+and+the+Legacy+of+Racism+%5Bblackatk%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackatk","files":-1,"time":1375448605,"description":"\nPublication Date: February 3, 2003 | With A special thanks to &quot;wetworx12&quot; - The bitter, race-baiting troll who inspired this upload | filetype: pdf |\n\nAfter decades of hand-wringing and well-intentioned efforts to improve inner cities, ghettos remain places of degrading poverty with few jobs, much crime, failing schools, and dilapidated housing. Stepping around fruitless arguments over whether or not ghettos are dysfunctional communities that exacerbate poverty, and beyond modest proposals to ameliorate their problems, one of America's leading experts on civil rights gives us a stunning but commonsensical solution: give residents the means to leave.\n\nInner cities, writes Owen Fiss, are structures of subordination. The only way to end the poverty they transmit across generations is to help people move out of them--and into neighborhoods with higher employment rates and decent schools. Based on programs tried successfully in Chicago and elsewhere, Fiss's proposal is for a provocative national policy initiative that would give inner-city residents rent vouchers so they can move to better neighborhoods. This would end at last the informal segregation, by race and income, of our metropolitan regions. Given the government's role in creating and maintaining segregation, Fiss argues, justice demands no less than such sweeping federal action.\n\nTo sample the heated controversy that Fiss's ideas will ignite, the book includes ten responses from scholars, journalists, and practicing lawyers. Some endorse Fiss's proposal in general terms but take issue with particulars. Others concur with his diagnosis of the problem but argue that his policy response is wrongheaded. Still others accuse Fiss of underestimating the internal strength of inner-city communities as well as the hostility of white suburbs.\n\nFiss's bold views should set off a debate that will help shape urban social policy into the foreseeable future. It is indispensable reading for anyone interested in social justice, domestic policy, or the fate of our cities.\n\n\nReview\n&quot;Fiss sets forth with admirable clarity and rigor an integrationist manifesto for the early twenty-first century. The most striking aspect of his book is the unembarrassed, unequivocal, unblinking manner in which Fiss champions a position that has been in retreat since the mid 1960s. Fiss is boldly and seriously advancing ideas that will be scoffed at by dominant sectors of both the political right and the political left.&quot;\nFrom the Inside Flap\n\n&quot;Making an entirely novel proposal, this book is fair, accurate, and just plain smart. I have not seen so bold a public policy pronouncement in quite some time.&quot;--Samuel Issacharoff, Columbia Law School\n\n&quot;Fiss sets forth with admirable clarity and rigor an integrationist manifesto for the early twenty-first century. The most striking aspect of his book is the unembarrassed, unequivocal, unblinking manner in which Fiss champions a position that has been in retreat since the mid 1960s. Fiss is boldly and seriously advancing ideas that will be scoffed at by dominant sectors of both the political right and the political left.&quot;--Randall Kennedy, Harvard Law School\n\n\n\nHardcover: 144 pages\nPublisher: Princeton University Press (February 3, 2003)\nLanguage: English\nISBN-10: 0691088810\nISBN-13: 978-0691088815\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Way-Out-Americas-Ghettos-Legacy/dp/0691088810/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Way-Out-Americas-Ghettos-Legacy/dp/0691088810/&lt;/a&gt;\n\n\nTags: race, racism, discrimination, oppression, bias, psychology, sociology, bad faith, race, black, african, american, african american, AA, african american studies, society, institutional racism, white guilt, white privilige, denial, double standard, profiling, fear, responsibility, cognitive dissonance, freedom, white anxiety, abuse, disparity, disparities, caucasian, white, urbanization, ghettoization, urban planning, urban design, wealth disparity, hood, gang, crime, community policing, saturation, \n","torrent":{"xt":"urn:btih:6266bd08e1df237d308409674d11e36353f04821","amp;dn":"A+Way+Out%3A+America%27s+Ghettos+and+the+Legacy+of+Racism+%5Bblackatk%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6266bd08e1df237d308409674d11e36353f04821","infoHashBuffer":{"type":"Buffer","data":[98,102,189,8,225,223,35,125,48,132,9,103,77,17,227,99,83,240,72,33]},"announce":[],"urlList":[]}}