{"title":"InTheCrack E379 Blue Angel Full HD 1080p","uid":12283547,"size":2550433983,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:636f820760de8f873e45df30d574add92b357fce&amp;dn=InTheCrack+E379+Blue+Angel+Full+HD+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pornboy89","files":5,"time":1440447418,"description":"..:::ScreenShots:::..\n &lt;a href=&quot;\nhttp://imgnemo.com/?g=604869&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgnemo.com/?g=604869&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgnemo.com/?v=966919&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgnemo.com/?v=966919&lt;/a&gt;\n\nAudio: wmav2, 44100 Hz, stereo, 128 kb/s\nVideo: wmv3, yuv420p, 1920x1080, 8000 kb/s, 29.97 fps\n\n\nTake One.10:42\n\nThere's lots of fantastic up skirt views in this clip with only a tiny thong panty hiding the bare minimum of her pussy and ass. You also get more of this view without the skirt both in the standing and bend over positions. After a while she pulls her panty thong aside revealing an immaculate pussy and ass crack. Her poses bending over and lying on her side are really quite stunning with incredible curves and form on display.\n\n\n\n\n\nMaximum Exposure.7:05\n\nThis clip is all just nude posing with lots of fantastic positions getting all her private areas right out in the open for maximum exposure and easy ogling access. She starts lying on her back with her legs wrapped right around behind her head. She then gets on one knee giving you a fabulous faceful of bend over pussy and ass. As she later sits on her feet in rear view her position really shows off the curves of her back flowing into the well formed curve of her ass.\n\n\n\n\n\nThe Fistory Channel. ITC Favorite9:47\n\nFisting may well be Blue Angel's main claim to fame and she shows why in this clip. Not only does she completely bury her entire hand all the way up inside her pussy but she even masturbates with her hand thrusting in all the way up to her wrist. Her position lying on her side is quite spectacular with her bare pussy thrust out in the open. She also fists herself in a sitting position and in the doggy style position and on one knee with her other leg raised. There are a number of six finger pussy spreads although you really see more fingers than vagina at this point.\n\n\n\n\n\nMovie Buff.3:07\n\nThis is mostly all bend over pussy and ass viewing with her gorgeous underside squirming in your face. Her crack is still all glistening with lube from her fisting session. Her ass motions in the latter part of this clip are super sexy with her lovely curves slowly gyrating in various ways.\n\n\n\n\n\nToytally Buzzted.10:57\n\nBlue Angel uses a slim vibrating toy on her clit in multiple positions including the bend over and lying on her side positions. The best of it has her lying on her back with her ass hanging right off the edge of the couch. She has some beautiful twitching and squirming motions as she reaches her orgasm complete with lots of contractions in her anus. You can see her anus clenching for quite a long time after her orgasm too as she continues to lightly dabble the vibrator on her clitoris","torrent":{"xt":"urn:btih:636f820760de8f873e45df30d574add92b357fce","amp;dn":"InTheCrack+E379+Blue+Angel+Full+HD+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"636f820760de8f873e45df30d574add92b357fce","infoHashBuffer":{"type":"Buffer","data":[99,111,130,7,96,222,143,135,62,69,223,48,213,116,173,217,43,53,127,206]},"announce":[],"urlList":[]}}