{"title":"Jonni Darko - Facial Overload 2 Milf Edition XXX DVDRip","uid":12613272,"size":2931927040,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:63c00234245d9ae99c343d414d4be7044892f814&amp;dn=Jonni+Darko+-+Facial+Overload+2+Milf+Edition+XXX+DVDRip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"feeldabyte","files":4,"time":1445485978,"description":"Screens &amp; Info :\r\n\r\n――――――――――――――――――――――――――\r\n \nhttp://imgkiss.com/image/fDz3i \nhttp://imgkiss.com/image/fD3cv \nhttp://imgkiss.com/image/fDDH9 \nhttp://imgkiss.com/image/fDT68 \nhttp://imgkiss.com/image/fDoYA \nhttp://imgkiss.com/image/fD2QU \nhttp://imgkiss.com/image/fDGvK \nhttp://imgkiss.com/image/fDOGr \nhttp://imgkiss.com/image/fDVaq \nhttp://imgkiss.com/image/fDk0y \nhttp://imgkiss.com/image/fD43d \nhttp://imgkiss.com/image/fDYcR \nhttp://imgkiss.com/image/fDgd6\r\n\r\n――――――――――――――――――――――――――\r\n\r\nInvovled: India Summer, Lisa Ann, Veronica Avluv, Eva Angelina, Anissa Kate, Inari Vachs, Liza Del Sierra, Lily Carter, Tiffany Mynx, Kayla Carrera, Jonni Darkko, Rebecca Bardoux, Winston Burbank\r\n\r\nAlmost 5 Hours Of Your Favorite MILF Cocksuckers, Starring Lisa Ann!\r\n\r\nFashion photographer turned porn artist Jonni Darkko has an extreme fetish for women both beautiful and slutty. The image comes together when a model's glamorous make-up has been ruined by one or more loads of thick, dripping sperm! Jonni's 'Facial Overload 2: MILF Edition' is a two-disc treat matching the director's cum facial fixation with 11 of the most gorgeous adult babes in the XXX industry. These stunning women use their talented, experienced mouths in sensuous POV-style blow jobs that result in spurting semen showers messy, cum-smeared faces. Tattooed and bespectacled fan fave Eva Angelina masturbates with a vibrating wand, then satisfies two erect customers with her famous oral skills. By the end, Eva's smiling through a gooey haze of ejaculate!\r\n\r\nSensuous cougar Rebecca Bardoux is a naughty dame with a hunger for young dick. She strokes, sucks and tit-wanks a thick pole, earning herself a faceful of hot cum. Incredible dicksucking beauty Lily Carter opens wide for Winston Burbank's huge prick, taking it to the back of her throat until it erupts all over her luscious face. And busty, big-assed icon Tiffany Mynx takes on three hard shafts in a nasty, semen-splattering blow bang. The cast also includes tanned, mega-stacked blonde whore Kayla Carrera; exotic, raven-haired goddess Anissa Kate; seasoned, buxom bombshell Lisa Ann; petite, curvaceous French Latina Liza del Sierra; sweet oral slut India Summer; sultry mama Veronica Avluv; and all-natural cock-pleaser Inari Vachs. 'Facial Overload 2: MILF Edition' is cum-caked mayhem from the old school! \r\n\r\nSail to another one :\r\n \nhttps://thepiratebay.se/user/feeldabyte/","torrent":{"xt":"urn:btih:63c00234245d9ae99c343d414d4be7044892f814","amp;dn":"Jonni+Darko+-+Facial+Overload+2+Milf+Edition+XXX+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63c00234245d9ae99c343d414d4be7044892f814","infoHashBuffer":{"type":"Buffer","data":[99,192,2,52,36,93,154,233,156,52,61,65,77,75,231,4,72,146,248,20]},"announce":[],"urlList":[]}}