{"title":"How I Became a Nun","uid":8946587,"size":297554,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6422f890855c44d32d668efcb17a77d65d831638&amp;dn=How+I+Became+a+Nun&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"livhre","files":-1,"time":1379792348,"description":"A sinisterly funny modern-day Through the Looking Glass that begins with cyanide poisoning and ends in strawberry ice cream.\n\n&quot;My story, the story of 'how I became a nun,' began very early in my life; I had just turned six. The beginning is marked by a vivid memory, which I can reconstruct down to the last detail. Before, there is nothing, and after, everything is an extension of the same vivid memory, continuous and unbroken, including the intervals of sleep, up to the point where I took the veil .&quot; So starts Cesar Aira's astounding &quot;autobiographical&quot; novel. Intense and perfect, this invented narrative of childhood experience bristles with dramatic humor at each stage of growing up: a first ice cream, school, reading, games, friendship. The novel begins in Aira's hometown, Coronel Pringles. As self-awareness grows, the story rushes forward in a torrent of anecdotes which transform a world of uneventful happiness into something else: the anecdote becomes adventure, and adventure, fable, and then legend. Between memory and oblivion, reality and fiction, Cesar Aira's How I Became a Nun retains childhood's main treasures: the reality of fable and the delirium of invention.\n\nA few days after his fiftieth birthday, Aira noticed the thin rim of the moon, visible despite the rising sun. When his wife explained the phenomenon to him he was shocked that for fifty years he had known nothing about &quot;something so obvious, so visible.&quot; This epiphany led him to write How I Became a Nun. With a subtle and melancholic sense of humor he reflects on his failures, on the meaning of life and the importance of literature","torrent":{"xt":"urn:btih:6422f890855c44d32d668efcb17a77d65d831638","amp;dn":"How+I+Became+a+Nun","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6422f890855c44d32d668efcb17a77d65d831638","infoHashBuffer":{"type":"Buffer","data":[100,34,248,144,133,92,68,211,45,102,142,252,177,122,119,214,93,131,22,56]},"announce":[],"urlList":[]}}