{"title":"Moonshadow (Epic TPB)","uid":8753052,"size":241932183,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:65b210ea59c8cd282004badd9b4b6e398cc7909e&amp;dn=Moonshadow+%28Epic+TPB%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1375079469,"description":"This book/upload is repeatedly labeled 'Epic TPB' because it was reprinted nine years later by Vertigo(after they re-printed the entire twelve-issue series) with textual revisions and the single issue 'Farewell to Moonshadow' included as an epilogue. I don't have that version available for upload at this time, but I do have this, the very limited (at the time) Epic TPB. So this puts us as, like, 2/3 of the way to uploading every version of this series... or maybe 1/2... err.. anyway... Moonshadow (Epic TPB)...\n\n-------------------------------------------------------------------------------------- \n\n'Moonshadow (Epic TPB)\n\nEpic Comics, 1989, 393 pages\n\nWritten by J.M. DeMatteis\n\nIllustrated by John J. Muth, Kent Williams, George Pratt\n\n\nThe story takes the form of an eclectic and quirky fairy tale with satirical elements and dealing with philosophical concerns. It is told via the framing device of Moonshadow, now 120, looking back on his earlier life. The action concerns the events leading up to the &quot;awakening&quot; of Moonshadow, the child of a hippy mother and a enigmatic alien father. The alien, who resembles a glowing orb of light bearing a stylized human face, abducted Moonshadow's mother from Earth in 1968 along with her black pet cat, Frodo. When the idealistic and naive Moonshadow is orphaned at approximately age 15, he becomes friends with a venal and opportunistic furry humanoid named Ira. Moonshadow and Ira and Frodo the cat set out to find a life for themselves in the stars.\n\nMoonshadow loses his innocence, but eventually makes peace with the world and reconciles himself to the actions of his seemingly capricious alien father.\n\n\nHere's the epilogue issues (kindly uploaded by STFmaryville), 'Farewell to Moondshadow' (not sure this is seeded still - I'm trying to check it, but utorrent is stuck at the metadata)...\n  &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8196650/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8196650/&lt;/a&gt;\n\n\nAnd here's the twelve-issue Vertigo run (sadly, this appears to be one of the things I accidentally removed from utorrent, so I can't guarantee that it's still seeded properly - y'all can help with that if it is, though)...\n  &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/7684658/Moonshadow_%28Restored%29_%28Vertigo%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/7684658/Moonshadow_%28Restored%29_%28Vertigo%29&lt;/a&gt;\t\t\n","torrent":{"xt":"urn:btih:65b210ea59c8cd282004badd9b4b6e398cc7909e","amp;dn":"Moonshadow+%28Epic+TPB%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65b210ea59c8cd282004badd9b4b6e398cc7909e","infoHashBuffer":{"type":"Buffer","data":[101,178,16,234,89,200,205,40,32,4,186,221,155,75,110,57,140,199,144,158]},"announce":[],"urlList":[]}}