{"title":"Toon Boom Studio v4.5 with serial","uid":4352416,"size":38461307,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6606c81ec6a0a8b92fb2642c7a20dda0e053ed18&amp;dn=Toon+Boom+Studio+v4.5+with+serial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"romelanda","files":5,"time":1219230382,"description":"Toon Boom Studio 4.5 is ideal for individuals looking for an all-in-one animation software. From drawing digitally, scanning hand-drawn animations or seamlessly importing existing artwork, Studio 4.5 enables you to lip sync your animation, setup the action in a 3D space and publish your animation projects for print, TV, HDTV, the Web, YouTube and iPod! Covering the entire animation workflow from sketching to final publishing, you will find Toon Boom Studio to be a great tool to create or learn animation.\n\nCreate\nDeveloped by animators for animators, Toon Boom Studio offers intuitive and easy-to-use drawing tools. In addition to onion skinning, automatic gap-closing and a full screen rotary light table, Studio 4.5 can import a wide range of media to create live-action cartoons and rotoscoping.\n\nAnimate\nToon Boom Studio offers true animation features designed to facilitate the creation of any styles of animation, including traditional frame-by-frame animation, keyframe animation, cut-out, photo animation and live-action cartoon.\n\nPublish\nIn addition to printing, Toon Boom Studio creates high quality animation for any media including the web, iPod, YouTube, cell phones and PDAs, TV and HDTV. Studio 4.5 supports all major industry standards including SWF, QuickTime, AVI, DV, and image sequences.","torrent":{"xt":"urn:btih:6606c81ec6a0a8b92fb2642c7a20dda0e053ed18","amp;dn":"Toon+Boom+Studio+v4.5+with+serial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6606c81ec6a0a8b92fb2642c7a20dda0e053ed18","infoHashBuffer":{"type":"Buffer","data":[102,6,200,30,198,160,168,185,47,178,100,44,122,32,221,160,224,83,237,24]},"announce":[],"urlList":[]}}