{"title":"The Health Wyze Report - Episode 19","uid":7042712,"size":53998734,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:6667c01b202bdd40c643d01f56b9519f03099d5e&amp;dn=The+Health+Wyze+Report+-+Episode+19&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mandalasarah","files":-1,"time":1329611807,"description":"In this show we discuss how people should not blindly trust anyone in the alternative or mainstream medical establishment. We talk about other shows, along with how they frequently alter their health advice to sell products. We expose the true origin of snake oil, and the ignorance held by modern doctors. We provide examples of medicine's inability to connect cause and effect relationships (use science), and explain why life expectancies have been rising, until now. We tell our audience how they can avoid kidney stones, and warn about excess vitamin D. We describe the differences between the omega-3 provided by flax seed oil, and that which is provided by fish oil. We also talk about grass-fed organic beef, and about the fact that most beef is so old that it is actually green prior to recolorization. We critique homeopathic medicine and draw connections between it, and the current orthodox medical practices. We warn people, particularly pet owners, about irradiation, and its current use in foods. We inform people about the deceptive metal bottles that are being sold by Whole Foods Market, and we strongly advise people against the use of guar gum as a diet aid. We also talk about night terrors, and their link to autism and thereby vaccines. \n\nFeel free to visit our home site at http://HealthWyze.org","torrent":{"xt":"urn:btih:6667c01b202bdd40c643d01f56b9519f03099d5e","amp;dn":"The+Health+Wyze+Report+-+Episode+19","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6667c01b202bdd40c643d01f56b9519f03099d5e","infoHashBuffer":{"type":"Buffer","data":[102,103,192,27,32,43,221,64,198,67,208,31,86,185,81,159,3,9,157,94]},"announce":[],"urlList":[]}}