{"title":"Gangster Squad: Covert Cops, the Mob, and the Battle for Los Ang","uid":9410456,"size":8348145,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:678cc0e05c865c7c413433a549e917ea2d47ca53&amp;dn=Gangster+Squad%3A+Covert+Cops%2C+the+Mob%2C+and+the+Battle+for+Los+Ang&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MucGar","files":-1,"time":1388274316,"description":"Gangster Squad: Covert Cops, the Mob, and the Battle for Los Angeles\n\n\n\n2013 | ISBN: 1410453448, 144722230X | 643 pages | EPUB, MOBI | 8 MB\n\n\n\n'The shadowy Gangster Squad was formed in 1946 with eight men operating out of two rusted old Fords. They had no office and made no arrests -- the idea was to remain invisible. By the time I met Sgt. Jack O'Mara, most of the early members were dead, so I set out to find the survivors.' Based on the hugely popular Los Angeles Times column 'LA Noir: Tales from the Gangster Squad', this is the dark-hearted true story of a group of men cleaning up the mean streets of post-War America. From hundreds of interviews with the original members of the team, Paul Lieberman stitches together the story of Jack O'Mara, his dangerous colleague Jerry Wooters ('the killer cop, that's what they called me') and their anything-goes war with arch-criminal Mickey Cohen and his budding rival Jack 'The Enforcer' Whalen. A tale of stake-outs, shoot-outs and even the famous Black Dahlia murder case, this is ice-cool narrative non-fiction at its best -- and the basis for a huge Warner Brothers film of the same name, starring Ryan Gosling, Sean Penn, Josh Brolin and Emma Stone.","torrent":{"xt":"urn:btih:678cc0e05c865c7c413433a549e917ea2d47ca53","amp;dn":"Gangster+Squad%3A+Covert+Cops%2C+the+Mob%2C+and+the+Battle+for+Los+Ang","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"678cc0e05c865c7c413433a549e917ea2d47ca53","infoHashBuffer":{"type":"Buffer","data":[103,140,192,224,92,134,92,124,65,52,51,165,73,233,23,234,45,71,202,83]},"announce":[],"urlList":[]}}