{"title":"MommysGirl - Sara Luvv, Mercedes Carrera (The Daughter Wars 2)","uid":12992672,"size":1175775729,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:67b5b73fa0a50857026079b209c7691ceead3085&amp;dn=MommysGirl+-+Sara+Luvv%2C+Mercedes+Carrera+%28The+Daughter+Wars+2%29+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"feeldabyte","files":1,"time":1450137020,"description":"Screens &amp; Info :\r\n\r\n―――――――――――――――――――――――――――――――――\r\n \nhttp://imgkiss.com/image/rj9AL \nhttp://imgkiss.com/image/rjJKP \nhttp://imgkiss.com/image/rjPlO \nhttp://imgkiss.com/image/rjSIW \nhttp://imgkiss.com/image/rjbFj\r\n\r\n―――――――――――――――――――――――――――――――――\r\n\r\nPreviously on Mommysgirl, we watched Sara Luvv take sweet revenge on her spiteful step-sister Jenna sativa, filming her seducing their new Step-mother Mecedez Carrera. Their whole sexual escapade is filmed which gave the advantage for Sara to plot against her mischievous sister and catch them in a trap they will never be able to get out from. It is time for Sara to be on top and get exactly what she is entitled to!\r\nMercedes walks into the master bedroom, thinking her sexual encounter with Jenna was way too easy...until Sara knocks on the door not expecting things to change with a blink of an eye. Sara asks Mercedes if she can take a look at her pictures, as she's taken a passion in photography. Delighted to have a gander at Sara's pictures, Sara reiterates on how happy she is that Mercedes is going to be their new mother, and hopes to be her favorite daughter, and just maybe, be the maid of honor at the wedding. Mercedez is flattered, but gives her the bad news that she already promised Jenna the duty of bridesmaid, but offers Sara to be a flower girl. Sara is vexed, taking out her camera, exposing the cheating homewrecker, blackmailing Mercedez that Sara was going to be the maid of honor, not Jenna. Mercedez abides, compliant to Sara's every demand, which includes her reenacting everything that she caught on camera.\r\nSara grabs Mercedez with dedication and sexual temptation, gliding her hands over her mothers thong, demanding to fuck her like she is her real daughter. Sara removes her tight shorts, excited to sit on her mommy's face. Sara spreads her ass open, opening her pussy lips for Mercedez to indulge, obliging her mother to eat out her better than she did Jenna, screaming out as she climaxes. Sara promises Mercedez she can eat her out better than Jenna can, where Mercedez accepts her challenge. Her expectations are well met, her pussy juices covering Sara's face, dying to taste her own cum. Mercedez did all she can do assure Sara is her favorite daughter, guaranteeing her as the maid of honor, but wanted the memory card back from the camera, and asks her daughter if she can have it as a token of good faith, let's say a pre-wedding present. Sara, has no issues with giving her the memory card, but only after she knows Jenna first! Payback is a bitch!\r\n\r\n\r\nSail to another one :  https://thepiratebay.se/user/feeldabyte/","torrent":{"xt":"urn:btih:67b5b73fa0a50857026079b209c7691ceead3085","amp;dn":"MommysGirl+-+Sara+Luvv%2C+Mercedes+Carrera+%28The+Daughter+Wars+2%29+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67b5b73fa0a50857026079b209c7691ceead3085","infoHashBuffer":{"type":"Buffer","data":[103,181,183,63,160,165,8,87,2,96,121,178,9,199,105,28,238,173,48,133]},"announce":[],"urlList":[]}}