{"title":"Nazareth - Love Hurts (Beat Club) (2nafish)","uid":5835418,"size":136421380,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:67bf5c442fea042de9dbe03eabe56dd2069c0a5b&amp;dn=Nazareth+-+Love+Hurts+%28Beat+Club%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1284713178,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Love Hurts&quot; is the name of a song, written and composed by Felice and Boudleaux Bryant. First recorded by The Everly Brothers in July 1960, the song is best known from a 1975 international hit version by the rock band Nazareth.\n\nThe song was introduced in December 1960 as an album track on A Date with The Everly Brothers, but was never released as a single (A-side or B-side) by the Everlys. The first hit version of the song was by Roy Orbison, who earned Australian radio play, hitting the Top Five of that country's singles charts in 1961. A recording by Emmylou Harris and Gram Parsons was included on Parsons' posthumously released Grievous Angel album. After Parsons' 1973 death, Harris made the song a staple of her repertoire, and has included it in her concert set lists from the 1970s to the present. Harris has since re-recorded the song twice.\n\nThe most successful recording of the song was by hard rock/heavy metal band Nazareth, who took the song to the U.S. Top 10 in 1975 and hit number one in Norway and the Netherlands. The song was covered by Cher in 1975 for her album Stars. Cher re-recorded the song in 1991 for her album of the same name.\n\nPerformed as a rock ballad, the Nazareth version was the most popular version of the song and the only rendition of &quot;Love Hurts&quot; to become a big hit single, reaching #8 on the Billboard Hot 100 in early 1976. As part of the &quot;Hot Tracks (EP)&quot; it also reached #15 in the UK in 1977. Nazareth's version was an international hit (reaching #8 in the US, #15 in the UK, and #1 in Canada and Norway), and remains the best-known recording of the song. The Nazareth single was so successful in Norway that it charted for 57 consecutive weeks on the Norwegian charts (VG-lista Top 10), including 14 weeks at #1.\n\nA later recording by Nazareth, featuring the Munich Philharmonic Orchestra, peaked at #89 in Germany.\n\nThe lyrics of the song remained unchanged on all versions up until Nazareth's 1975 recording, where the original line &quot;love is like a stove/it burns you when it's hot&quot; was changed to &quot;love is like a flame/it burns you when it's hot&quot;. The Nazareth track has been featured in the movies Dazed and Confused, Detroit Rock City, Together, and Halloween, among others. It was edited for use in a late-'90s Gatorade TV commercial. In 2009, it was used in a TV commercial for the Nissan Altima.\n\nNazareth is a Scottish rock band that had several hard rock hits in the UK in the early 1970s, and established an international audience with their 1975 album Hair of the Dog. Perhaps their best-known hit single was a cover of the ballad &quot;Love Hurts&quot;, in 1975. The band continues to record and tour to the present day.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:67bf5c442fea042de9dbe03eabe56dd2069c0a5b","amp;dn":"Nazareth+-+Love+Hurts+%28Beat+Club%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67bf5c442fea042de9dbe03eabe56dd2069c0a5b","infoHashBuffer":{"type":"Buffer","data":[103,191,92,68,47,234,4,45,233,219,224,62,171,229,109,210,6,156,10,91]},"announce":[],"urlList":[]}}