{"title":"Snap Camera HDR v3.4.0[DELTA1001]","uid":8805532,"size":5409749,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:67dadfbb301350892a96de11c66e3255b207565f&amp;dn=Snap+Camera+HDR+v3.4.0%5BDELTA1001%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Chi101","files":1,"time":1376320252,"description":"Snap Camera HDR\nVersion: 3.4.0\n\nSnap is a camera and gallery application based on the camera included in Android 4.2 on the Nexus 4.\nTake pictures and record video with a single click, no cluttered preview screen, just the two buttons you really need.\n\nIt has a simple, powerful user interface. Touch to focus, pinch to zoom, swipe to review and long press for photo settings. The photo controller includes settings for colour, contrast and sharpness (if supported by the hardware). The additional settings menu gives you access to: Picture and Video Size, Scene mode, Self Timer, Burst Mode, Time Lapse, Still and Video Focus Modes, JPEG Quality, Effects, ISO and Anti-banding.\n\nThe powerful photo editor lets you add colour effects, borders, crop, rotate, mirror and straighten. You can also choose image effects, histogram modification and vignette. Undo an effect at any time from the history menu.\n\nShare an image with any other app such as Facebook or Google+ by clicking on the share icon.\n\nSnap works best on newer phones but will still run on older models.\n\nThe extra settings on the controller menu are only available on phones that support them. Most phones based on Qualcomm hardware do support these options but most others do not.\n\nCamera apps are notoriously difficult to make compatible with all hardware. If it doesn't work, please don't rate the app badly, let us know and we will try to fix it.\n\nPlease post bugs and suggestions on the XDA thread for this app by clicking on &quot;Visit Developer's Website&quot; below.\n\nWhat's in this version : (Updated : Aug 9, 2013)\n\nFixes for Galaxy S4 and new Nexus 7\nAllow hiding of albums in the gallery\nImproved HDR registration\nNew focus mode icons for the controller\nNew setting to keep HDR intermediate shots (enabled by default)\nNew setting to show a ghost image of the last shot in the preview (useful for stop-motion)\nNew setting to refocus between HDR shots (only needed on a few devices)\nSettings to allow customisation of two controller icons\nNew UI is now the default\nNew icons\n\nRequired Android O/S : 2.3.3+\n\nInstallation Instruction:\n1)Copy the file to SD Card\n2)Open and install it\n3)Enjoy ","torrent":{"xt":"urn:btih:67dadfbb301350892a96de11c66e3255b207565f","amp;dn":"Snap+Camera+HDR+v3.4.0%5BDELTA1001%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67dadfbb301350892a96de11c66e3255b207565f","infoHashBuffer":{"type":"Buffer","data":[103,218,223,187,48,19,80,137,42,150,222,17,198,110,50,85,178,7,86,95]},"announce":[],"urlList":[]}}