{"title":"MINOR THREAT at Dc Space Buff hall 9 30 club (dvd)","uid":3798174,"size":4146287313,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:68090e85045724ed4748b5f2b12060c672913b77&amp;dn=MINOR+THREAT+at+Dc+Space+Buff+hall+9+30+club+%28dvd%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"PeterRamone","files":26,"time":1189154537,"description":"MINOR THREAT\n\nLive at DC SPACE , BUFFALO HALL , 9:30 CLUB\n\nMinor threat played its first show in november 1980, shortly after the breakup of the Teen Idles, singer Ian MacKaye and the drummer Jeff NelsonÃ‚Â´s previous band. The two other members, guitarist Lyle Preslar and bassist Brian Baker, were new to the small circle of teenage Washington DC punks that had fielded such bands as the Untouchables and SOA.\nThe latter groupÃ‚Â´s lead singer was soon to change his surname to Rollins and move to L.A. tojoin Black Flag. Another DC punk band, Bad Brains, was Minor Threat that defined the style that came to be called &quot;harDCore&quot;. The music was speedy, precise and melodic, and MacKaye commanded attention with a declamatory style and lyrics that critiqued not only adult society but also himself and his fellow punks.\nSome listeners rejected the message of songs like &quot;Straight Edge&quot; and &quot;Out of Step&quot;, but Minor ThreatÃ‚Â´s following grew, nationally as ewll as locally.\nThe band recorded two 7&quot;EPs, a 12&quot;EP, and a single during a run that lasted less than three years --- considerably less, considering that the band split from September Ã‚Â´81 to april Ã‚Â´82, while Preslar was in college.\nThe  reconstituted group briefly expanded to a quintet (with Baker on second guitar and Steve Hansgen on bass) before returning to its original lineup.\nAlthough Minor Threat remained popular -- a 1982 Flipside Magazine readerÃ‚Â´s poll named it &quot;band of the year&quot; -- internal tensions unraveled the band the following year.\nItÃ‚Â´s final show was september 23, 1983.\n\n\nEnjoy ! / Peter Ramone","torrent":{"xt":"urn:btih:68090e85045724ed4748b5f2b12060c672913b77","amp;dn":"MINOR+THREAT+at+Dc+Space+Buff+hall+9+30+club+%28dvd%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68090e85045724ed4748b5f2b12060c672913b77","infoHashBuffer":{"type":"Buffer","data":[104,9,14,133,4,87,36,237,71,72,181,242,177,32,96,198,114,145,59,119]},"announce":[],"urlList":[]}}