{"title":"Japanese schoolgirl furniture humping and other random object ma","uid":4297624,"size":2544400154,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:683bbd5a1abc3c128f8a60339b626166ae31b7c3&amp;dn=Japanese+schoolgirl+furniture+humping+and+other+random+object+ma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"potatopus","files":1,"time":1216142762,"description":"&quot;JK Rubbing Masturbation&quot;.  Scenes of skirt-clad Japanese young women masturbating by rubbing themselves on furniture and with other objects.  Some nudity, above the waist only, but no mosaic.   Company: Diva&amp;#039;s.  ID#: DIV-028. Running time: 108 minutes.  \n\nScreenshots and samples: http://b10f.jp/p/4906.html\n\nScene 1: A girl wakes up from a nap, slides her pillow under the covers, and humps it for a while.  Then she takes off the covers and does it harder until she comes.  Then she humps the edge of her mattress for a while, taking off her skirt in the middle.  Clutching the pillow while bouncing up and down on the mattress, she comes again.  Then she goes back to sleep.\n\nScene 2: A girl alone in a schoolroom rubs her crotch on the corner of a wooden desk.    Then she gets herself off with the back of the wooden chair.  \n\nScene 3: A girl alone in the school office starts rubbing herself on the office chair.  She mounts it and rubs harder and faster and then, after checking to make sure nobody is around, takes off her skirt and mounts the chair hard until she comes.\n\nScene 4: A girl is masturbating in a gym by pulling a jump rope back and forth between her legs.  After a while she straddles a vaulting horse and rocks on it, groping her breasts through her gym shirt.  She takes off her shirt and fondles her bare breasts until she comes.  She has great tits!\n\nScene 5: A girl is sweeping up a classroom.   When she&amp;#039;s done, she checks to be sure nobody is watching, then puts the broom handle between her legs.   She sits down in a chair and rubs the broom up and down in her crotch until she comes.   The scene ends with her laying her head down on the dock and fondling the broom lovingly.\n\nScene 6: This time the girl is working on a report on the computer. She slides back in her chair and rubs her crotch against the edge of the metal desk.  This isn&amp;#039;t enough, so she stands up, with one leg on the desk and one on the floor, and humps herself back and forth on the edge of the desk until she comes.\n\nScene 7: Another girl alone in a classroom, studying.  She rubs her clit with the corner of her Japanese-English dictionary, then stands up and does it harder.  She takes off her sweater and mounts the desk, fucking it until she comes. \n\n","torrent":{"xt":"urn:btih:683bbd5a1abc3c128f8a60339b626166ae31b7c3","amp;dn":"Japanese+schoolgirl+furniture+humping+and+other+random+object+ma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"683bbd5a1abc3c128f8a60339b626166ae31b7c3","infoHashBuffer":{"type":"Buffer","data":[104,59,189,90,26,188,60,18,143,138,96,51,155,98,97,102,174,49,183,195]},"announce":[],"urlList":[]}}