{"title":"Ku Klux Klan Secrets Exposed: Attitude Toward Jews, Catholics, F","uid":11825558,"size":3338780,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:68877f6cc79b41072a08a35d37a7c4bf88ef2ec0&amp;dn=Ku+Klux+Klan+Secrets+Exposed%3A+Attitude+Toward+Jews%2C+Catholics%2C+F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1429481536,"description":"To the old Ku Klux Klan which rode through the south in the days following the civil war the new Ku Klux Klan is a relative only in name. It is not tied by blood. It holds the same position to its southern aristocratic forbear as an imposter in social life does to some illustrious gentleman of the same name of whom he claims to be a descendant. The old Ku Klux Klan was a historical development. The new is a mans contrivance. The old Ku Klux Klan movement was an outcome of conditions that prevailed in the southern states after the war. The present Klan, apparently, is an outcome of a group of mens desire to make money. Widespread, spontaneous, popular, the movement of 1866 grew out of a disordered society, not as a movement at all at first, but as a scheme for having fun, a source of amusement among a group of young, full-blooded southern men to puzzle outsiders. Its use as a weapon against the stranger in the old south came later. The stranger was the northern carpetbagger. To the south he was the pestilence that follows war. He was the blunderer who entered the land whose social customs were unknown to him, in a year when the fabric by those social customs was in need of mending","torrent":{"xt":"urn:btih:68877f6cc79b41072a08a35d37a7c4bf88ef2ec0","amp;dn":"Ku+Klux+Klan+Secrets+Exposed%3A+Attitude+Toward+Jews%2C+Catholics%2C+F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68877f6cc79b41072a08a35d37a7c4bf88ef2ec0","infoHashBuffer":{"type":"Buffer","data":[104,135,127,108,199,155,65,7,42,8,163,93,55,167,196,191,136,239,46,192]},"announce":[],"urlList":[]}}