{"title":"Phil Dowe &amp; Paul Noordhof - Cause and Chance: Causation in a","uid":10857626,"size":885458,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:68d1f78ad9ca359bbe275bec3fb10cb63bc27d34&amp;dn=Phil+Dowe+%26amp%3B+Paul+Noordhof+-+Cause+and+Chance%3A+Causation+in+a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"philosophi","files":-1,"time":1408850857,"description":"Phil Dowe &amp; Paul Noordhof - Cause and Chance: Causation in an Indeterministic World\n\nPhilosophers have long been fascinated by the connection between cause and effect: are 'causes' things we can experience, or are they concepts provided by our minds? The study of causation goes back to Aristotle, but resurged with David Hume and Immanuel Kant, and is now one of the most important topics in metaphysics. Most of the recent work done in this area has attempted to place causation in a deterministic, scientific, worldview. But what about the unpredictable and chancey world we actually live in: can one theory of causation cover all instances of cause and effect? \n\nCause and Chance: Causation in an Indeterministic World is a collection of specially written papers by world-class metaphysicians. Its focus is the problem facing the 'reductionist' approach to causation: the attempt to cover all types of causation, deterministic and indeterministic, with one basic theory. \n\nContributors: Stephen Barker, Helen Beebee, Phil Dowe, Dorothy Edgington, Doug Ehring, Chris Hitchcock, Igal Kwart, Paul Noordhof, Murali Ramachandran and Michael Tooley.","torrent":{"xt":"urn:btih:68d1f78ad9ca359bbe275bec3fb10cb63bc27d34","amp;dn":"Phil+Dowe+%26amp%3B+Paul+Noordhof+-+Cause+and+Chance%3A+Causation+in+a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68d1f78ad9ca359bbe275bec3fb10cb63bc27d34","infoHashBuffer":{"type":"Buffer","data":[104,209,247,138,217,202,53,155,190,39,91,236,63,177,12,182,59,194,125,52]},"announce":[],"urlList":[]}}