{"title":"The Gospel According to Philip K. Dick","uid":5565852,"size":839217152,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:694de09ab86e36fe9f6f9c43092464eafdbb519e&amp;dn=The+Gospel+According+to+Philip+K.+Dick&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"adakaboom","files":1,"time":1273975461,"description":"The visionary work of science fiction legend Philip K. Dick inspired the films Blade Runner (1982), Total Recall (1990), and Minority Report (2002). Films from John Carpenter's They Live to David Cronenberg's eXistenZ to The 6th Day mine the same sense of the technological morass, complex conspiracies, and manipulated and uncertain realities that Dick spun out in such novels as Time Out of Joint and A Scanner Darkly. Dick's unnerving ideas influenced a generation, but despite the title of this labor-of-love documentary, it's less about his work than the life-changing events of the last decade of his life. The bizarre true story of paranoia, mind-altering drugs, mystical visions, and an 8,000-page treatise called The Exegesis is as compelling as any of his novels. All it lacks is a grounding: filmmakers Mark Steensland and Andy Massagli take for granted a familiarity with the author and his work. That may leave the casual viewer a bit bewildered by it all, but fans will appreciate the comments of cult author Robert Anton Wilson and rare audio recordings of Dick himself (set to funky minimalist animation). Lacking a strong portrait of Dick's life and work before the visions, The Gospel According to Philip K. Dick is hardly definitive, relying almost solely on interviews to flesh out the figure, but it is a valuable first step in exploring the work of one of the most influential &quot;unknown&quot; authors of our time. --Sean Axmaker\n\nLanguage: English\nFile Type: AVI - XviD ISO MPEG-4\nFile Size: 800 MB\nFile Duration: 1:19:27\nKBPS: 1208\nFPS: 29.970\nResolution: 560 x 416\nAudio: 0x2000 (Dolby AC3) AC3 -- 48000Hz  192 kb/s tot , stereo (2/0)","torrent":{"xt":"urn:btih:694de09ab86e36fe9f6f9c43092464eafdbb519e","amp;dn":"The+Gospel+According+to+Philip+K.+Dick","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"694de09ab86e36fe9f6f9c43092464eafdbb519e","infoHashBuffer":{"type":"Buffer","data":[105,77,224,154,184,110,54,254,159,111,156,67,9,36,100,234,253,187,81,158]},"announce":[],"urlList":[]}}