{"title":"Pieta Brown - One and All [2010] [EAC/FLAC]","uid":11762077,"size":237197573,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:69674afd27dfc43d38b793ec7459af77ee2e7145&amp;dn=Pieta+Brown+-+One+and+All+%5B2010%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":20,"time":1426615172,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#:Red House Records / RHR CD 229\nCountry: USA\nYear: April 6, 2010\nGenre: americana folk\nFormat: CD\n\n01. Wishes Falling Through The Rain\n02. Other Way Around\n03. Out Of The Blue\n04. Prayer Of Roses\n05. Calling All Angels\n06. El Guero\n07. Faller\n08. Flowers In The Kingdom\n09. Shake\n10. Grass Upon The Hills\n11. Never Did Belong\n12. It Wasn't That\n\nDon Was stripped Pieta Brown's sound down to its essentials for her 2009 EP and Red House label debut. But on her first full-length album for the imprint her dad Greg called home for many years, she co-produces (along with shotgun-riding guitarist legend Bo Ramsey) and beefs up the proceedings considerably. The extra instrumentation includes two drummers on all but three tracks, but the additional percussion never seems busy and never overwhelms her delicate, whispery vocals. Brown's introspective folk is tinged with occasional jazz overtones yet stays in Americana territory as she wraps her silky smooth bourbon voice around music that floats without being nebulous. Her muted delivery is both sensual and startling in its honesty. It seems like she's reading her diary out loud in songs such as &quot;It Wasn't That,&quot; one of many reflective moments that feel like you are eavesdropping on Brown singing to herself. It's that subtlety and grace that beckon the listener Siren-like, to delve deeper into these songs.\n\nLongtime collaborator Ramsey's snake-like guitar perfectly frames the music by slithering around the choruses. It's no surprise that she toured with J.J. Cale since her sense of restraint and reserved approach reflect his notoriously retiring style.\n\nThe dozen selections were recorded in about five days which keeps the groove immediate even in its most hushed moments, of which there are many. Brown's understated method is like a foreign movie in the way her images and subdued, measured voice set the scene, resonating long after the last note fades. These tunes are achingly pretty but never slick, obvious, or wispy. Rather, Brown caresses her lyrics, delivering lines like &quot;if wishes were horses/I would ride/down to the river where the water is wide&quot; with a melancholy and perception that seem beyond her years. Her previous three releases have been impressive, but with One and All, Pieta Brown delivers her finest, most fully realized album yet","torrent":{"xt":"urn:btih:69674afd27dfc43d38b793ec7459af77ee2e7145","amp;dn":"Pieta+Brown+-+One+and+All+%5B2010%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69674afd27dfc43d38b793ec7459af77ee2e7145","infoHashBuffer":{"type":"Buffer","data":[105,103,74,253,39,223,196,61,56,183,147,236,116,89,175,119,238,46,113,69]},"announce":[],"urlList":[]}}