{"title":"Pink Floyd - Live At Pompeii (1972)(24 bit FLAC from DVD)(Concer","uid":10184088,"size":598341142,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6a22b63ad55b8eb7337e6757196523429adc4bb4&amp;dn=Pink+Floyd+-+Live+At+Pompeii+%281972%29%2824+bit+FLAC+from+DVD%29%28Concer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"scottyscum","files":-1,"time":1400558035,"description":"Not part of the great 24 bit Pink Floyd post earlier today, so figured I'd post it. Ripped from the DVD.                                                             Pink Floyd: Live at Pompeii is a 1972 concert film featuring the English progressive rock group Pink Floyd performing at the ancient Roman amphitheatre in Pompeii, Italy, directed by Adrian Maben. Although the band are playing a typical live set from this point in their career, the film is notable for having no audience.\n\nThe main footage in and around the amphitheatre was filmed over four days in October 1971, using the band's regular touring equipment, including studio-quality 24-track recorders. Additional footage filmed in a Paris television studio that December made up the original 1972 release. The film was then re-released in 1974 with additional studio material of the band working on The Dark Side of the Moon, and interviews at Abbey Road Studios.\n\nThe film has subsequently been released on video numerous times, and in 2003 a &quot;Director's Cut&quot; DVD appeared which combines the original footage from 1971 with more contemporary shots of space and the area around Pompeii, assembled by Maben. A number of notable bands have taken inspiration from the film in creating their own videos, or filming concerts without an audience.                                    &quot;Echoes, Part 1&quot; (from Meddle, 1971)\n&quot;Careful with That Axe, Eugene&quot; (from Point Me At The Sky, B-side, 1968)\n&quot;A Saucerful of Secrets&quot; (from A Saucerful of Secrets, 1968)\n&quot;One of These Days I'm Going to Cut You into Little Pieces&quot; (from Meddle, 1971)\n&quot;Set the Controls for the Heart of the Sun&quot; (from A Saucerful of Secrets, 1968)\n&quot;Mademoiselle Nobs&quot; (from Meddle, 1971)\n&quot;Echoes, Part 2&quot; (from Meddle, 1971)","torrent":{"xt":"urn:btih:6a22b63ad55b8eb7337e6757196523429adc4bb4","amp;dn":"Pink+Floyd+-+Live+At+Pompeii+%281972%29%2824+bit+FLAC+from+DVD%29%28Concer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a22b63ad55b8eb7337e6757196523429adc4bb4","infoHashBuffer":{"type":"Buffer","data":[106,34,182,58,213,91,142,183,51,126,103,87,25,101,35,66,154,220,75,180]},"announce":[],"urlList":[]}}