{"title":"Christmas With The Simpsons -Crisp","uid":5997978,"size":918261989,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6a4e468ff1e65bae56c2f53275cd540d5d7435f1&amp;dn=Christmas+With+The+Simpsons+-Crisp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"crispy1989","files":6,"time":1291094240,"description":"Christmas With The Simpsons\n\nSeries: The Simpsons\nDVD release: November 3, 2003\nNetwork: Fox\nNo. of episodes: 05\nSource: DVD\nVideo format: .avi\nAudio format: MPEG Layer-3\nBit Rate: 135kbps\nWidth: 512\nHeight: 384\n\n---------\n\nSimpsons Roasting on an Open Fire (S01E01)\nWhile Christmas shopping, Bart sneaks off and gets a tattoo. Marge soon discovers this and uses the family's Christmas savings to get it removed. Meanwhile, Homer discovers that he will not be getting a Christmas bonus from Mr. Burns and thus the family has no money to buy Christmas presents. He decides to keep their financial troubles a secret and gets a job as a department store Santa, but later discovers that the job does not pay enough. Desperate for a miracle, Homer and Bart go to the dog racing track on Christmas Eve in hopes of earning some money. He bets it all on a longshot named Santa's Little Helper, who loses. Santa's Little Helper's owner angrily releases the dog and Homer lets Bart keep him. Later on, Homer tries to explain that Christmas is ruined, but Bart exclaims that they have a dog and everyone happily welcomes the newest member of the Simpson family.\n\nMr. Plow (S04E09)\nAfter demolishing both his and Marge's family cars during a snowstorm, Homer buys a snowplow and starts a business plowing driveways. He calls his business &quot;Mr. Plow&quot; and becomes a huge success. Barney Gumble, inspired by Homer decides to start his own rival company and becomes Springfield's new favorite snow plower. Homer tricks Barney into plowing the dangerous Widow's Peak. Barney does so, but gets trapped in an avalanche and after seeing a news report about it, Homer rushes to save him. Homer saves Barney and the two decide to work together, but God melts all of the snow.\nGuest stars: Linda Ronstadt, Adam West\n\nMiracle on Evergreen Terrace (S09E10)\nOn Christmas morning, Bart wakes up earlier than the rest of the family and goes to open his presents. After playing with a remote control firetruck, Bart accidentally starts a fire, causing the plastic Christmas tree and the presents to melt. Bart hides the melted mess, but the next morning, reports to the family that there had been a robber. The news media soon reports this, and the community rallies to their aid and donates $15,000, which Homer spends on a car he soon crashes. However, Bart soon tells the truth to his family; that there never was a robber. The community soon finds out, and demands their money back. Marge decides to go on Jeopardy! to make the money back, but does not succeed. When the family comes back home, they find that the town has looted their entire house of everything except a washcloth.\nGuest star: Alex Trebek\n\nGrift of the Magi (S11E09)\nPrincipal Skinner hires Fat Tony's construction company to build wheelchair ramps for the school. These ramps promptly break down, forcing Skinner to close down Springfield Elementary. However, a toy company lead by Jim Hope takes over the school; in school, the children are only taught to provide marketing schemes and suggestions. Soon, a new toy called Funzo that mysteriously resembles the children's ideas is invented. After a brief showdown Gary Coleman and the Funzo, things return to normal as Burns decides to fund the school after a visit from the three Christmas spirits.[23]\nGuest stars: Gary Coleman, Tim Robbins and Clarence Clemons\n\nShe of Little Faith (S13E06)\nAfter Homer and Bart's model rocket damages the church, Mr. Burns makes a deal to commercialize the church in return for paying for the damages, which leads Lisa to convert to Buddhism out of disgust, causing Marge to fear for Lisa's soul.\nGuest star: Richard Gere.\n\n---------\n\nPlease seed, comment and enjoy!\n\nBrought to you by Crisp","torrent":{"xt":"urn:btih:6a4e468ff1e65bae56c2f53275cd540d5d7435f1","amp;dn":"Christmas+With+The+Simpsons+-Crisp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a4e468ff1e65bae56c2f53275cd540d5d7435f1","infoHashBuffer":{"type":"Buffer","data":[106,78,70,143,241,230,91,174,86,194,245,50,117,205,84,13,93,116,53,241]},"announce":[],"urlList":[]}}