{"title":"Total Recorder v5.2 with user name + serial key (WinZip file)","uid":3375766,"size":3334565,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6aeaea0d69ba81ce3b6e4828020540ce95ac177b&amp;dn=Total+Recorder+v5.2+with+user+name+%2B+serial+key+%28WinZip+file%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"olav66","files":3,"time":1125227711,"description":"NB! Something went wrong the 1st time around with the upload!\nHopefuly, this time around will work fine!\n\nTotal Recorder v5.2 with serial key (works for me) WinZip file\n**************************************************************\n\nUnlock info:\n\nName:\nPeter Kosmol \n\nSerial:\nTRD4.UKNS.Z8JS.KX65.94BA.7AEK.TX9V.XK85.G9NX.9XV2.TL3M.YEX9.NAAA \n\n\nTotal Recorder records streaming audio, Mic input, Line-in input as well as CDs and DVDs. The resulting files are saved on your computer's hard-drive. The system also allows users to schedule any number of future recordings!\n\nTotal Recorder is a powerful, yet simple audio recording solution. Total Recorder records streaming audio directly from systems like Real Player, Windows Media Player, QuickTime and WinAmp. It can also record from cassette tapes, LPs, DVDs, CDs or through a microphone connected to your PC. The resulting recordings may be saved as wav, wma, mp3, Ogg Vorbis or FLAC audio files. The recordings may then be copied to a CD using a standard CD burner and associated software.\n\nTotal Recorder is available in Standard, Professional and Developer Editions. The Standard Edition has all of the recording functionality that allows users to record streaming audio or to record from cassettes, LPs, DVDs, CDs or through a microphone. It also has a built-in scheduler that allows for the scheduling of automated recordings.\n\nTotal Recorder System Requirements:\nTotal Recorder was designed to run on any PC using Windows 95, 98, NT, ME, 2000 or XP operating systems. The only hardware requirement is that the PC be equipped with a Windows compatible sound card. The sound card may be a separate card, or it may be of the type that are integrated into the PC's motherboard.\n\nTotal Recorder v5.2 Tutorial included!\n**************************************\n\nHOW TO USE TOTAL RECORDER TO DOWNLOAD STREAMING AUDI FROM A WEB SITE:\n*********************************************************************\nWhen you know there will be a streaming audio show soon to start on a web page somewhere, beforehand, create a folder on your hard drive and name it according to that show's name.\n\nOpen the web page where the streaming audio is going to happen and Total Recorder simultaneously.\n\nNow, to record the streaming audio, simply click the red recording button in the down-most right corner and locate the download audio file to the folder you just created on your hard drive!\n\nEnjoy good folks\nolav66","torrent":{"xt":"urn:btih:6aeaea0d69ba81ce3b6e4828020540ce95ac177b","amp;dn":"Total+Recorder+v5.2+with+user+name+%2B+serial+key+%28WinZip+file%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6aeaea0d69ba81ce3b6e4828020540ce95ac177b","infoHashBuffer":{"type":"Buffer","data":[106,234,234,13,105,186,129,206,59,110,72,40,2,5,64,206,149,172,23,123]},"announce":[],"urlList":[]}}