{"title":"The Hunger Games Trilogy NL Collected By Jeffrey","uid":12836504,"size":3310830632,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6c3dc8eef9845fb5c3c9db42d2b8bc4a1a017962&amp;dn=The+Hunger+Games+Trilogy+NL+Collected+By+Jeffrey&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gljeffrey45","files":3,"time":1448462655,"description":"The Hunger Games Trilogy NL Collected By Jeffrey\r\n\r\nThe Hunger Games 1 (2012)\r\n\r\nVerenigde Staten\r\nAvontuur / Sciencefiction\r\n142 minuten\r\n\r\ngeregisseerd door Gary Ross\r\nmet Jennifer Lawrence, Josh Hutcherson en Elizabeth Banks\r\n\r\nIn de nabije toekomst wordt Noord-Amerika geteisterd door droogte, brand en oorlog. Het wordt nu Panem genoemd, een land verdeeld in de 'Hoofdstad' en twaalf regio's. Elk jaar worden twee jonge deelnemers van elk district uitgeloot met het doel om in een competitie de andere deelnemers uit te schakelen. Het volk wordt gedwongen om deze 'wedstrijden' te kijken. Voor vermaak, maar ook ter intimidatie van de onderworpen districten. Katniss neemt vrijwillig de plaats in van haar zusje, die geselecteerd was om deel te nemen. Peeta, een man zonder enige gevechtsvaardigheden, zal haar vergezellen. Samen moeten ze het opnemen tegen veel sterkere en beter getrainde deelnemers...\r\n\r\n\r\nThe Hunger Games: Catching Fire 2 (2013)\r\n\r\nVerenigde Staten\r\nActie / Avontuur\r\n146 minuten\r\n\r\ngeregisseerd door Francis Lawrence\r\nmet Jennifer Lawrence, Josh Hutcherson en Liam Hemsworth\r\n\r\nNa haar overwinning in de 74ste Jaarlijkse Hongerspelen met haar metgezel Peeta Mellark is Katniss Everdeen veilig naar huis teruggekeerd. Deze overwinning betekent echter dat ze opnieuw weg moeten en hun familie moeten achterlaten om op een 'Overwinningstournee' doorheen de districten te vertrekken. Onderweg merkt Katniss dat een opstand op til is, maar de Hoofdstad is nog steeds aan de macht wanneer President Snow de 75ste Jaarlijkse Hongerspelen voorbereidt - een wedstrijd die Panem voorgoed kan veranderen.\r\n\r\n\r\nThe Hunger Games 3: Mockingjay - Part 1 (2014)\r\n\r\nVerenigde Staten\r\nAvontuur / Sciencefiction\r\n123 minuten\r\n\r\ngeregisseerd door Francis Lawrence\r\nmet Jennifer Lawrence, Josh Hutcherson en Natalie Dormer\r\n\r\nTegen alle verwachtingen in heeft Katniss Everdeen (Jennifer Lawrence) de Hongerspelen twee keer overleefd. Maar ondanks dat ze de bloederige arena levend heeft verlaten, is ze nog steeds niet veilig. Haar geliefde Peeta Mellark (Josh Hutcherson) is gevangen genomen door Het Capitool dat uit is op wraak en president Snow maakt duidelijk dat niemand veilig is. Katniss groeit uit tot het gezicht van de revolutie, een opstand van de districten die zich verzet tegen de regering die hen regeert en verhongert. Bij de massa wordt ze bekend als hun 'spotgaai'","torrent":{"xt":"urn:btih:6c3dc8eef9845fb5c3c9db42d2b8bc4a1a017962","amp;dn":"The+Hunger+Games+Trilogy+NL+Collected+By+Jeffrey","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c3dc8eef9845fb5c3c9db42d2b8bc4a1a017962","infoHashBuffer":{"type":"Buffer","data":[108,61,200,238,249,132,95,181,195,201,219,66,210,184,188,74,26,1,121,98]},"announce":[],"urlList":[]}}