{"title":"Frost/Nixon: Watergate (Not the Movie, the Docu)","uid":4559772,"size":734037047,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6dae7375d056ea4cce68c287a388a75c8e96df72&amp;dn=Frost%2FNixon%3A+Watergate+%28Not+the+Movie%2C+the+Docu%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"finding_hope","files":3,"time":1228634146,"description":"The Frost Nixon Interviews are now recognised as one of the great media events of the Twentieth Century. First broadcast in May 1977, they drew the biggest ever worldwide audience for a news interview. Forty-five million people watched in America alone. During twenty eight and three quarter gruelling hours, Frost questioned Nixon on everything from Vietnam to China, from abuse of power to the Final Days. But the most tense and gripping sessions were on Watergate. Two whole days were devoted to the subject.\n\nNever before and never afterwards would Nixon confront the issue of Watergate, particularly in a forum where he had no knowledge of the questions and no right even to see the edited programme before it was broadcast. A picture emerges of a White House under siege, of burglars and hush money, of a Nixon close to tears, having to sacrifice his closest aides culminating in the unprecedented sight of a President apologising to his people.\n\nThe DVD includes a brand new interview, exclusively for Amazon, where, after nearly 30 years Sir David Frost takes a look back at the circumstances surrounding the Frost Nixon programme and answers questions on how he came to secure the film that all big TV companies wanted and what Nixon said to him in the weeks following the broadcast to the American people.","torrent":{"xt":"urn:btih:6dae7375d056ea4cce68c287a388a75c8e96df72","amp;dn":"Frost%2FNixon%3A+Watergate+%28Not+the+Movie%2C+the+Docu%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dae7375d056ea4cce68c287a388a75c8e96df72","infoHashBuffer":{"type":"Buffer","data":[109,174,115,117,208,86,234,76,206,104,194,135,163,136,167,92,142,150,223,114]},"announce":[],"urlList":[]}}