{"title":"The Prodigy - Invaders Must Die [ FLAC ]","uid":4743839,"size":336188863,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6df68e482ab25c4670963f31aed51be7be52f175&amp;dn=The+Prodigy+-+Invaders+Must+Die+%5B+FLAC+%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aszeran","files":-1,"time":1235701438,"description":"The Prodigy - Invaders Must Die in lossless quality, be a good pirate and help with seeding the swag please.\n\n\n\nInvaders Must Die is the fifth regular studio album by the electronic act The Prodigy which was released in Australia on February 21 and released elsewhere on February 23, 2009[1] on the band's new label, Take Me to the Hospital,[2] and distributed by Cooking Vinyl. It is the first studio album released by the band since 2004's Always Outnumbered, Never Outgunned and is the first Prodigy album since 1997's The Fat of the Land to feature all three members of the band.[2]\n\nDetails about the album were released on November 4, through The Prodigy's official newsletter and confirmed the same day by Liam on The Zane Lowe Show on BBC Radio 1. The band have said that the album will go back to their &quot;old-school but cutting edge&quot; roots,[3] and will feature collaborations with Dave Grohl (of Foo Fighters) and James Rushent (of Does It Offend You, Yeah?)[3], but will not feature any guest vocals.[4] The album will be released as a CD, CD/DVD set, Double vinyl, digital download and a luxury 7-inch vinyl box set which will include five 7-inches, CD/DVD, bonus CD, poster, stickers and stencils.[5]\n\nThe first track, also entitled &quot;Invaders Must Die&quot;, was released as a free download from the band's website on the November 26, coinciding with its first airing on Zane Lowe's show, as his &quot;Hottest Record in the World&quot;. Omen was the first single released off the album on February.\n\n\nAsz.\n\n","torrent":{"xt":"urn:btih:6df68e482ab25c4670963f31aed51be7be52f175","amp;dn":"The+Prodigy+-+Invaders+Must+Die+%5B+FLAC+%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6df68e482ab25c4670963f31aed51be7be52f175","infoHashBuffer":{"type":"Buffer","data":[109,246,142,72,42,178,92,70,112,150,63,49,174,213,27,231,190,82,241,117]},"announce":[],"urlList":[]}}