{"title":"Smallville_S1_D2_(dutchsubs)_(dvd5)-WaRlOrD","uid":4842138,"size":4551192623,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:6e1aeb9716950e92a7d9b66864b51fba357f3a0e&amp;dn=Smallville_S1_D2_%28dutchsubs%29_%28dvd5%29-WaRlOrD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bitpirate","files":15,"time":1239545341,"description":"WaRlOrD presents: Smallville de serie\n\nIn de serie is te zien hoe de tiener Clark langzaam zijn superkrachten krijgt. Ook introduceert de serie al vele bekende bijpersonages uit de Superman-franchise zoals Lex Luthor en Lois Lane. Dit is in tegenstrijd met de meeste Supermanstrips, waarin Clark deze personages pas ontmoet nadat hij als volwassene naar Metropolis is verhuisd. Gedurende de eerste vier seizoenen focust de serie zich op Clarks middelbare schooltijd. Vanaf seizoen 5 heeft de serie een meer volwassen ondertoon en achtergrond. Ook hebben veel andere personages van DC Comics gastrollen in de serie. Het lijkt alsof er meer uit het Superboy universum komt dan uit het Superman universum; Dit zijn de twee hoofdvormen van Superman uit de comics. Met name de meerdere soorten kryptoniet zijn alleen aanwezig in het Superboy universum. Het Superman universum kent slechts een soort kryptoniet. Daardoor is Superman ongevoelig voor alle soorten kryptoniet behalve groen kryptoniet, dat op hem dezelfde uitwerking heeft als op Superboy. Ook is het zo dat Superboy sneller (vliegt) dan Superman, wat blijkt uit een comic van Superman uit de 80'er jaren, waarin de twee samen in een comic verschijnen. Superboy sterft in een gevecht met Time Trapper (1987), wat uiteindelijk het einde van zijn serie inhoud. Superman, daarentegen strijd nog steeds. Het verhaal in Smallvile is eigenlijk meer een amalgamatie van de beide universa.\n\nSeizoen 1 disk 2\n\n1:cool\n2:hourglass\n3:Craving\n4:jitters\n\n(dvd5)\n\nHelp seeding after download\nhelp met seeden naar het downloaden.\n\nrunners sucks!","torrent":{"xt":"urn:btih:6e1aeb9716950e92a7d9b66864b51fba357f3a0e","amp;dn":"Smallville_S1_D2_%28dutchsubs%29_%28dvd5%29-WaRlOrD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e1aeb9716950e92a7d9b66864b51fba357f3a0e","infoHashBuffer":{"type":"Buffer","data":[110,26,235,151,22,149,14,146,167,217,182,104,100,181,31,186,53,127,58,14]},"announce":[],"urlList":[]}}