{"title":"American Woodworker - All to Feb-Mar 2014","uid":9691544,"size":5779396094,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6e690a0c727ca9261a784a76cd0386cc55eafa2d&amp;dn=American+Woodworker+-+All+to+Feb-Mar+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Capt-lock","files":188,"time":1393873567,"description":"Hello All,\n\n     This is my first post ever, and I think an ambitious one at that. I recently made a request on the following post &quot;American Woodworker 2011 - Full Year Issues Collection (Malestrom_HH)&quot; that if Malestrom would be so kind, would he post year wide guides 2012 and 2013. Well, I did my own searching and found this, what appears to be all of the American Woodworker magazines ever made to date (March 2014). So I decided that instead of just relying on such giants as Malestrom (or Blackcanary, or STFmaryville, or nemesis43, or VikTSlick, or Mothra67, or 2nafish, or joshua13, gesserit, or shipjolly, or way many more than I can name), I would try to upload this post myself. Again, This is my first time, I am following a tutorial on Superbay, and I have no idea what I am doing, so please be kind in your comments.\n\nI want to point out - THIS IS NOT MY OWN WORK - The credit for this rightfully goes to a better man than me, I actualy do not know who it is, so I cannot give direct credit, but given the difficulties involved in creating such a pile that individual deserves credit for it.\n\nThis is a re-post - as I did not see it on the Pirate Bay I am posting it.\n\nI havent tested the included ISO, so I don't know aything about it, If I did this right, you should just be able to deselect it if you don't want it.\n\nThere are som extras in here the original creator included....enjoy.\n\nThank you for your time.","torrent":{"xt":"urn:btih:6e690a0c727ca9261a784a76cd0386cc55eafa2d","amp;dn":"American+Woodworker+-+All+to+Feb-Mar+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e690a0c727ca9261a784a76cd0386cc55eafa2d","infoHashBuffer":{"type":"Buffer","data":[110,105,10,12,114,124,169,38,26,120,74,118,205,3,134,204,85,234,250,45]},"announce":[],"urlList":[]}}