{"title":"The Anniversary - 2 Albums (2000-2002) [FLAC]","uid":8255390,"size":644942277,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6f21858f76614c6226c8e7f1cfa0e9fe3419ce01&amp;dn=The+Anniversary+-+2+Albums+%282000-2002%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1363256766,"description":"\n  The Anniversary - 2 Albums (2000-2002) [FLAC]\n\n  Released: 2000, 2002\n  Genre: Pop/Rock\n  Style: Indie Rock\n  Codec: FLAC\n  Source: CD (Log + Cue)\n  Bit Rates: ~ 1,000 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  \n  Albums:\n \n  2000 - Designing a Nervous Breakdown\n  2002 - Your Majesty \n\n  The Anniversary brought their own blend of male-female vocals, jangly guitars, and synth keyboards to the emo scene after signing with Heroes and Villains, an imprint of Vagrant Records, in 1999. Hailing from Kansas, the group began expanding their fanbase beyond the Midwest with the release of 2000's Designing a Nervous Breakdown, a strong debut that earned them comparisons to their label owners, the Get Up Kids, as well as another boy-girl synth pop band, the Rentals. At the core of the group were three lead vocalists - guitarists Josh Berwanger, Justin Roelofs, and keyboardist Adrianne Verhoeven - with drummer Christian Jankowski and bassist James David filling out the rhythm section. Borrowing from the theatrics of '80s rock bands, The Anniversary reveled in adding glittery pyrotechnics to their live shows, and their recognition grew during the new millennium.\n \n  The band issued a split EP with Superdrag in fall 2001 and later collaborated with the Pulsars' Dave Trumfio for their 2002 sophomore effort, Your Majesty. After the release of Your Majesty, The Anniversary began demoing tracks for their next album but were eventually derailed by creative differences, which forced the group to split up. After the breakup, Berwanger, Jankowski, and David formed the Only Children, while Verhoeven sang in a number of bands before releasing an album in 2008 under the name D*R*I*. Roelofs pursued other projects, too, releasing a record under the name White Flight. In 2008, Vagrant paid tribute to the group by releasing the double-disc set Devil on Our Side: Rarities and B-Sides, comprised of demos that spanned the group's entire career, as well as singles and compilation tracks.","torrent":{"xt":"urn:btih:6f21858f76614c6226c8e7f1cfa0e9fe3419ce01","amp;dn":"The+Anniversary+-+2+Albums+%282000-2002%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f21858f76614c6226c8e7f1cfa0e9fe3419ce01","infoHashBuffer":{"type":"Buffer","data":[111,33,133,143,118,97,76,98,38,200,231,241,207,160,233,254,52,25,206,1]},"announce":[],"urlList":[]}}