{"title":"Exploring Medical Language [9th edition] - Myrna and Danielle La","uid":11046809,"size":86804956,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6f735fbe7deb7fcc389fe12edbb4d5008ec24f97&amp;dn=Exploring+Medical+Language+%5B9th+edition%5D+-+Myrna+and+Danielle+La&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"InformationShouldBeFree","files":1,"time":1410961136,"description":"Introducing Exploring Medical Language, 9th Edition: an innovative learning resource that helps you master medical terminology on your terms. At the heart of Exploring Medical Language is the student-friendly worktext, which gradually helps you build an understanding of medical terminology by first introducing you to word parts and then combining the parts into full medical terms that make sense. Add print and electronic flashcards, engaging interactive games, on-the-go audio reinforcement, and an extensive arsenal of other student-friendly learning tools, and you have everything you need to become fluent in medical terminology in no time!Integrated online learning tools offer a variety of unique ways to master medical terminology:\ninteractive games and activities\nelectronic flashcardsanatomy and physiology tutorialscareer videosquizzes5,000-term English/Spanish glossaryClinical case studies and medical reports encourage critical thinking and information application.More than 400 flashcards provide immediate review material.Systematic book organization gradually builds your understanding of medical terminology by first introducing you to word parts and then combining the parts to build the terms. Margin boxes detail important information such as medical terminology facts and tips, historical information, weblinks, and complementary and alternative medicine terms. NEW! Quick Quizzes offer gradable and email-able assessments to help you quickly gauge your understanding of key chapter concepts and terms. UPDATED! More electronic health records and sample patient information prepare you for the growing use of EHRs in healthcare settings. UPDATED! New terms and abbreviations reflect the latest advances in technology and the healthcare delivery system.IMPROVED! New and updated drawings and photos keep you ahead of current technology and healthcare processes.NEW! Pageburst eBook interactive features help you improve your understanding of medical terminology with immediate feedback.\n","torrent":{"xt":"urn:btih:6f735fbe7deb7fcc389fe12edbb4d5008ec24f97","amp;dn":"Exploring+Medical+Language+%5B9th+edition%5D+-+Myrna+and+Danielle+La","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f735fbe7deb7fcc389fe12edbb4d5008ec24f97","infoHashBuffer":{"type":"Buffer","data":[111,115,95,190,125,235,127,204,56,159,225,46,219,180,213,0,142,194,79,151]},"announce":[],"urlList":[]}}