{"title":"Rush - Signals","uid":3371930,"size":61726435,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:704fcf104f271cfec3546e56a6e7b1a2fb8f0fbb&amp;dn=Rush+-+Signals&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"an1m8r1x","files":8,"time":1124473565,"description":"Rush had already begun using electronics and synth in their music by the time Signals was released in 1982, so the synth-heavy opener, &quot;Subdivisions&quot; (a song that proves that high-school separatism is older than last year), wasn't that great a departure from their previous material. Signals also contains the single &quot;New World Man,&quot; which still gets heavy radio airplay almost 20 years later, as well as groove-heavy, tech-savvy songs like &quot;The Analog Kid&quot; and &quot;Digital Man&quot;--prescient comments on the forthcoming information technology revolution if ever there were any. This was Rush's first studio album following Moving Pictures, which arguably remains their strongest and most well-known effort, after 2112. That's a tough act to follow, and Rush did it in the best possible way--by maintaining their distinctive sound while updating it with 1980s touches. Signals indicates that it was a good move\n\nTHE REPORT CARD:\n\nSubdivisions: A (awesome song, one of Rush's all-time best)\nThe Analog Kid: A- (this song has a cool riff)\nChemistry: A- (very futuristic, lyrics are sorta weird)\nDigital Man: B (melody is strong but can get repetitive at times)\nThe Weapon: A (I like the beats in this song)\nNew World Man: A (OH, THE BASSLINES!!)\nLosing It: A (haunting and beautiful, a favorite)\nCountdown: B (good basis for a song, but Rush have done better)","torrent":{"xt":"urn:btih:704fcf104f271cfec3546e56a6e7b1a2fb8f0fbb","amp;dn":"Rush+-+Signals","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"704fcf104f271cfec3546e56a6e7b1a2fb8f0fbb","infoHashBuffer":{"type":"Buffer","data":[112,79,207,16,79,39,28,254,195,84,110,86,166,231,177,162,251,143,15,187]},"announce":[],"urlList":[]}}