{"title":"Beyonce - Listen","uid":4610203,"size":130594820,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:705efebc5e6097efdcee990eff6128b2a882c9d1&amp;dn=Beyonce+-+Listen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1230612356,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Listen&quot; is a song by American R&amp;B singer BeyoncÃƒÂ© Knowles. Henry Krieger, Scott Cutler, Anne Preven, and Knowles wrote the song, and it was produced by The Underdogs for the soundtrack in the 2006 musical film Dreamgirls. &quot;Listen&quot; is one of four new compositions written for Dreamgirls, and Deena Jones, the character portrayed by Knowles in the film, sang it to assert independence over her controlling husband.\n\nThe track was released as the lead single from film's soundtrack album on December 5, 2006 in the United States, and appeared as a hidden track on international editions of Knowles' second solo studio album, B'Day. &quot;Listen&quot; was a critical success, and it won Best Original Song at the 2007 Annual Critics' Choice Awards.\n\nThe music video premiered on MTV's Making the Video on November 28, 2006. This video, which was directed by Diane Martel, features Knowles walking through a performance hall in modern-day street clothes, performing the song. Once she arrives onstage and at the song's bridge, she appears in costume as Deena, dressed in a 1970s-era gown. Intercut into the video are scenes from Dreamgirls, most of which depict Deena's relationship with Curtis. These clips, however, were taken out in the director's cut version of the video; this version appeared on the B'Day Anthology Video Album. In her first outfit, BeyoncÃƒÂ© is seen wearing a Wonder Woman t-shirt. BeyoncÃƒÂ© has stated before that she would love to play Wonder Woman.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:705efebc5e6097efdcee990eff6128b2a882c9d1","amp;dn":"Beyonce+-+Listen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"705efebc5e6097efdcee990eff6128b2a882c9d1","infoHashBuffer":{"type":"Buffer","data":[112,94,254,188,94,96,151,239,220,238,153,14,255,97,40,178,168,130,201,209]},"announce":[],"urlList":[]}}