{"title":"China MiÃƒÂ©ville - The Scar.pdf","uid":5475486,"size":1652534,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:70aa3f94ed6cdf783df7ebf6a05f176e30294c49&amp;dn=China+Mi%C3%83%C2%A9ville+-+The+Scar.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"artpepper","files":-1,"time":1270120737,"description":"The Scar by China China MiÃƒÂ©ville (2002)\n\nIn this stand-alone novel set in the same monster-haunted universe as last year's much-praised Perdido Street Station, British author China MiÃƒÂ©ville, one of the most talented new writers in the field, takes us on a gripping hunt to capture a magical sea-creature so large that it could snack on Moby Dick, and that's just for starters. \n\nArmada, a floating city made up of the hulls of thousands of captured vessels, travels slowly across the world of Bas-Lag, sending out its pirate ships to prey on the unwary, gradually assembling the supplies and captive personnel it needs to create a stupendous work of dark magic. Bellis Coldwine, an embittered, lonely woman, exiled from the great city of New Crobuzon, is merely one of a host of people accidentally trapped in Armada's far-flung net, but she soon finds herself playing a vital role in the byzantine plans of the city's half-mad rulers. \n\nThe author creates a marvelously detailed floating civilization filled with dark, eccentric characters worthy of Mervyn Peake or Charles Dickens, including the aptly named Coldwine, a translator who has devoted much of her life to dead languages; Uther Doul, the superhuman soldier/scholar who refuses to do anything more than follow orders; and Silas Fennec, the secret agent whose perverse magic has made him something more and less than human. Together they sail through treacherous, magic-ridden seas, on a quest for the Scar, a place where reality mutates and all things become possible. This is state-of-the-art dark fantasy","torrent":{"xt":"urn:btih:70aa3f94ed6cdf783df7ebf6a05f176e30294c49","amp;dn":"China+Mi%C3%83%C2%A9ville+-+The+Scar.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70aa3f94ed6cdf783df7ebf6a05f176e30294c49","infoHashBuffer":{"type":"Buffer","data":[112,170,63,148,237,108,223,120,61,247,235,246,160,95,23,110,48,41,76,73]},"announce":[],"urlList":[]}}