{"title":"The Ploughman's Lunch and the Miser's Feast (2012) Gooner","uid":13031318,"size":22480017,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7104103be2a355b7fafabad90595d81ada34484c&amp;dn=The+Ploughman%27s+Lunch+and+the+Miser%27s+Feast+%282012%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1450446724,"description":"The Ploughman's Lunch and the Miser's Feast - Authentic Pub Food, Restaurant Fare and Home Cooking from Small Towns, Big Cities and Country Villages Across the British Isles (2012).epub Gooner\r\n\r\nPublisher: Harvard Common Press; 1st Edition edition (February 28, 2012)\r\nLanguage: English\r\nISBN-10: 1558324135\r\nISBN-13: 978-1558324138\r\n\r\nCelebrity television chefs like Jamie Oliver and culinary stars like Hugh Fearnely-Wittingstall have made Americans newly aware of the great potential in British cooking. But the new British food revolution is not limited to fine restaurants and television. Within Britain, pub and country inn chefs, newspaper and magazine food writers, and everyday home cooks are taking a renewed interest in their own traditional cuisine, at long last approaching it with more pride than with prejudice.  In The Ploughman's Lunch and the Miser's Feast, the American cookbook author, travel writer and professional photographer Brian Yarvin brings these newly rediscovered pleasures to the attention of home cooks on this side of the Atlantic.\r\n \r\nIn 100 recipes, 65 color photos, and dozens of lively sidebars, Yarvin reveals what he has discovered in his numerous walking and driving trips across the length and breadth of Great Britain. His recipes emphasize traditional and down-home dishes as perfected and updated by the best cooks in Britain. They include lots of pub fare, like Fish and Chips, Shepherd's Pie, Ploughman's Lunch, and a host of savory cakes and pasties. There are festive and substantial main courses like Howtowdie, Poached Salmon with White Sauce, and, of course, a splendidly done Beef Wellington.  The hard-working Brits love big breakfasts, and there is a chapter devoted to those, while another chapter celebrates the sandwiches, salads, and snacks that are served at tea time. Curry shops have been ubiquitous for so long that Indian food by now is properly British, and Yarvin devotes another chapter to dishes such as Shrimp Biryani and Chicken Korma. A big chapter, too, shows us how to make the best-loved British sweets, from the humbly named Plum Pudding and Mincemeat Cake to the amusingly monikered Fast Rascals, Kentish Huffkins, and Welsh Dripping Cake","torrent":{"xt":"urn:btih:7104103be2a355b7fafabad90595d81ada34484c","amp;dn":"The+Ploughman%27s+Lunch+and+the+Miser%27s+Feast+%282012%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7104103be2a355b7fafabad90595d81ada34484c","infoHashBuffer":{"type":"Buffer","data":[113,4,16,59,226,163,85,183,250,250,186,217,5,149,216,26,218,52,72,76]},"announce":[],"urlList":[]}}