{"title":"Nausicaa of the Valley of the Wind(ENG)","uid":4006807,"size":2145479043,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:71b1bcd6ac6e442afc109cd93e9cc4eea78649fa&amp;dn=Nausicaa+of+the+Valley+of+the+Wind%28ENG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Catphish","files":1,"time":1201875966,"description":"Nausicaa of the Valley of the Wind (Kaze no tani no Naushika) is a 1984 film by Japanese writer, illustrator, and filmmaker Hayao Miyazaki, based on his manga of the same name. The movie has environmentalist undertones and was presented by the World Wide Fund for Nature when it was released in 1984. Nausicaa is ranked as one of the 50 greatest science fiction films by the Internet Movie Database. While created before Studio Ghibli was founded, the film is considered by some to be the studio's first film because of the involvement of Studio Ghibli's Hayao Miyazaki, Isao Takahata and Toshio Suzuki. It is often included as part of the Studio's works, including the Studio Ghibli Collection of DVDs.\n\nThe movie won the Animage Anime Grand Prix prize in 1984.The story takes place 1,000 years after the &quot;Seven Days of Fire,&quot; an event which destroyed human civilization and most of the Earth's original ecosystem. Scattered human settlements survive, isolated from one another by the Sea of Decay. Literally translating as the Rotting Sea or the Sea of Fungus, the Sea of Decay is a lethally toxic jungle of fungus swarming with giant insects, which seem to come together only to wage war.\n\nThe primary protagonist, Nausicaa, is a charismatic young princess of the peaceful Valley of the Wind. Her name comes from the princess Nausicaa in the Odyssey who assisted Odysseus, and is transcribed into Japanese. Part of her character comes from a Japanese folk hero known as &quot;the princess who loved insects&quot;, while another part was inspired by the writings of Bernard Evslin, as he had written a more in-depth extrapolation of character of Odyssey's Nausicaa.\n\nAlthough a skillful fighter, Miyazaki's Nausicaa is humane and peace-loving. She has an unusual gift for communicating with the giant insects (particularly with the Ohmu, the gigantic, armored, caterpillar-like insects who are the most intelligent creatures in the Sea of Decay). She is also noted for her empathy toward animals, humans, and other beings. An intelligent girl, and inspired by the mentor figure Yupa, a wandering samurai type possessed of great wisdom, NausicaÃƒÆ’Ã‚Â¤ frequently explores the Sea of Decay and conducts scientific experiments in an attempt to divine the true nature and origins of the toxic world in which she lives. Her explorations are facilitated by her skill at &quot;windriding&quot;; flying with an advanced glider-like craft with a jet assist called a mowe.\n\nThe Valley of the Wind is threatened when another state, Pejite, unearths a God Warrior (kyoshinhei) embryo which is then stolen by a more powerful state, Tolmekia, translated in the manga as Tormekia. The God Warriors are one of the lethal, giant, biological weapons used in the ancient war. Both Pejite and Tolmekia hope to use the God Warrior against each other and, ultimately, against the Sea of Decay. While transporting the Warrior back to their realm, the Tolmekians are attacked by insects and subsequently crash-land in the Valley. The very next day, the Tolmekians invade the Valley to secure and revive the Warrior, eventually forcing the peaceful people of the Valley into armed resistance. The situation deteriorates as the fight to possess the God Warrior escalates out of control and the Sea of Decay strikes back against those who attack it.\n\nThe story holds deeper meaning than its depiction of war; there are both humanistic and ecological subtexts in Miyazaki's narrative. Even the insects seem to be working toward some secret harmony and the lethal fungal forest seems to have a vital role in Earth's new ecosystem.\n\nEnjoy !!! And please seed too -)","torrent":{"xt":"urn:btih:71b1bcd6ac6e442afc109cd93e9cc4eea78649fa","amp;dn":"Nausicaa+of+the+Valley+of+the+Wind%28ENG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71b1bcd6ac6e442afc109cd93e9cc4eea78649fa","infoHashBuffer":{"type":"Buffer","data":[113,177,188,214,172,110,68,42,252,16,156,217,62,156,196,238,167,134,73,250]},"announce":[],"urlList":[]}}