{"title":"Bob Hope Tribute Collection - College Swing (1938) Xvid 1cd [DDR","uid":9845656,"size":734509056,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:71fc2dbc967cac19c7a937e72587e53cc07f9fa9&amp;dn=Bob+Hope+Tribute+Collection+-+College+Swing+%281938%29+Xvid+1cd+%5BDDR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":1,"time":1396063512,"description":"Bob Hope Tribute Collection - College Swing (1938) Xvid 1cd - George Burns, Gracie Allen [DDR]\n\nCollege Swing, also known as Swing, Teacher, Swing in the U.K., is a 1938 comedy film directed by Raoul Walsh and starring George Burns, Gracie Allen, Martha Raye, and Bob Hope. The movie features Edward Everett Horton, Ben Blue, Betty Grable, Jackie Coogan and Jerry Colonna.\n\nCAST:-\nGeorge Burns as George Jonas\nGracie Allen as Gracie Alden\nMartha Raye as Mable\nBob Hope as Bud Brady\nEdward Everett Horton as Hubert Dash\nFlorence George as Ginna Ashburn\nBen Blue as Ben Volt\nBetty Grable as Betty\nJackie Coogan as Jackie\nJohn Payne as Martin Bates\nCecil Cunningham as Dean Sleet\nRobert Cummings as Radio Announcer\nSkinnay Ennis as Skinnay\nJerry Colonna as Prof. Yascha Koloski (uncredited)\nThe Slate Brothers as themselves\nRobert Mitchell and St. Brendan's Choristers as themselves\n\nDirected by Raoul Walsh\nProduced by Lewis E. Gensler\nLyrics: Frank Loesser\nMusic: Burton Lane, Hoagy Carmichael, Victor Young\nRunning time 86 minutes\n\nMary Livingstone, who became well known as the wife of Jack Benny, appears in a small uncredited part as an usherette.\nJackie Coogan and Betty Grable were married at the time they made this film together.\n\nSONG NUMBERS:-\n&quot;The Old School Bell&quot; - sung by Robert Mitchell and St. Brendan's Choristers\n&quot;Moments Like This&quot; - by Burton Lane (music) and Frank Loesser (words), performed by Florence George\n&quot;I Fall in Love with You Every Day&quot; - by Manning Sherwin (music) and Frank Loesser (words), performed by Florence George and John Payne\n&quot;College Swing&quot; - by Hoagy Carmichael (music) and Frank Loesser (words), sung by Betty Grable and Skinnay Ennis, danced by Betty Grable and Jackie Coogan\n&quot;How'ja Like to Love Me?&quot; - by Burton Lane (music) and Frank Loesser (words), performed by Martha Raye and Bob Hope\n&quot;What Did Romeo Say To Juliet?&quot; - by Burton Lane (music) and Frank Loesser (words), performed by John Payne and Florence George\n&quot;What a Rumba Does to Romance&quot; - by Manning Sherwin (music) and Frank Loesser (lyrics), performed by Martha Raye with Ben Blue, danced by Betty Grable and Jackie Coogan, George Burns and Gracie Allen, The Slate Brothers, and unidentified extras\n&quot;You're a Natural&quot; - by Manning Sherwin (music) and Frank Loesser (lyrics), performed by Gracie Allen\n&quot;Irish Washerwoman&quot; - traditional Irish jig, danced by Gracie Allen\n&quot;Please&quot; - performed by Jerry Colonna.\n\nSYNOPSIS:- College Swing (1938)\nIt's 1738, and Gracie Alden (Gracie Allen) of the powerful Alden family fails to graduate from the college founded by her grandfather for the ninth year in a row, so he leaves it in his will to the first female of the family to graduate within 200 years. At the deadline, in 1938, another Gracie Alden, the last girl of the line, is having trouble with her studies, so she hires fast-talking Bud Brady (Bob Hope) to help her. Her efforts are opposed by woman-hating professor Hubert Dash (Edward Everett Horton) and his secretary George Jones (George Burns), who don't want to see their beloved college fall into the hands of an empty-headed nit-wit like Gracie.\n\nWhen by hook and by crook Gracie manages to pass her exam and becomes the owner of the college, she does away with entrance exams, hires a bunch of incompetent but kooky teachers, and turns the place into a jumpin' jitterbugging joint complete with swing bands and remote radio broadcasts.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Bitrate: 1295 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: English\nRunTime: 78 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 78 mins","torrent":{"xt":"urn:btih:71fc2dbc967cac19c7a937e72587e53cc07f9fa9","amp;dn":"Bob+Hope+Tribute+Collection+-+College+Swing+%281938%29+Xvid+1cd+%5BDDR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71fc2dbc967cac19c7a937e72587e53cc07f9fa9","infoHashBuffer":{"type":"Buffer","data":[113,252,45,188,150,124,172,25,199,169,55,231,37,135,229,60,192,127,159,169]},"announce":[],"urlList":[]}}