{"title":"FS2004 FS9 : Razbam T-2 Buckeye","uid":3936410,"size":21283455,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:733116c55432e9486f77fa00e8a30883a417abe3&amp;dn=FS2004+FS9+%3A+Razbam+T-2+Buckeye&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"samayot","files":1,"time":1197831149,"description":"T-2C Buckeye jet trainer aircraft was produced for the U.S. Navy by North American at Columbus. T-2C trainers were used by the Naval Air Training Command to conduct basic jet flight training for future Navy and Marine Corps aviators. The trainer established an outstanding record of safety and reliability while providing training for more than 11,000 students to pilot 18 different models of Navy jet aircraft.\n\nBuckeyes also were purchased by Venezuela (T-2D) and Greece (T-2E). The two-place, high-performance T-2C Buckeye was used for a wide variety of pilot training, from the student&amp;#039;s first jet flight to fully qualified flight. The aircraft was used for teaching a wide range of skills, including high-altitude, high-speed formation and aerobatic flights; basic and radio instruments; night and day navigation; and gunnery, bombing, and carrier operations.\n\nTHE AIRCRAFT INCLUDED IN THIS ADD-ON\n\nUS NAVY:\nVT-9\nVT-23\nVF-43 CHALLENGERS\nUSNTPS 2 liveries\nHellenic Air Force\n\nT-2E 160091, 362 M.P.E. 120 P.E.A.\nVenezuelan Air Force\n\nFuerza Aerea Venezolana ,Grupo de Entrenamiento No.14\nFuerza Aerea Venezolana Escuadron de Caza No35, new camuflage pattern 1993\nFEATURES\n\nFS9:\n\nAccurate fligth modelling, tested &amp; aproved by a former T-2 Buckeye Intructor Pilot, Lt. Cmdr Paul -Stork- Reinhart.\nCustom gauges\nautomatic engine smoke and wing contrail effects\nFully detailed and completely animated virtual cockpit with clickable gauges (Landing gear, arrestor hook, throttle, control stick, rudder pedals are independantly animated)\nReal T-2 sounds, used with a full license from Skysong Soundworks\nUSS Lexington, fully licensed from The Virtual Navy, completely compatible with Flight Deck 3 arrestor cable software*\n\nPost if you enjoyed it !\nBonsoir les trolls, les boches, les rosbeefs et les mangeurs de gouda et surtout Panodillo je te chie Ãƒ  la gueule !","torrent":{"xt":"urn:btih:733116c55432e9486f77fa00e8a30883a417abe3","amp;dn":"FS2004+FS9+%3A+Razbam+T-2+Buckeye","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"733116c55432e9486f77fa00e8a30883a417abe3","infoHashBuffer":{"type":"Buffer","data":[115,49,22,197,84,50,233,72,111,119,250,0,232,163,8,131,164,23,171,227]},"announce":[],"urlList":[]}}