{"title":"Ike Quebec - 1962 - Easy Living (1995) FLAC","uid":9363097,"size":376235695,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:733f8a04ce816d8baff843e833f5d1d212c17314&amp;dn=Ike+Quebec+-+1962+-+Easy+Living+%281995%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1387363601,"description":"Ike Quebec - 1962 - Easy Living (1995)\n\nThe release history behind Ike Quebec's Easy Living session is pretty convoluted. Eight songs were recorded in all, five of them bluesy sextet jams and three of them ballad standards in Quebec's trademark romantic style. The LP was slated to feature three of the blues tunes and all of the ballads, but remained unissued; in 1981, all five blues were released as Congo Lament, and in 1987, Easy Living was issued on LP in its originally intended, six-song form. Blue Note's CD reissue cuts through all the confusion by gathering all eight songs, grouping the blues cuts together in the first part of the album for continuity's sake. The sextet lineup is absolutely stellar, featuring fellow tenor Stanley Turrentine, trombonist Bennie Green, pianist Sonny Clark, bassist Milt Hinton, and drummer Art Blakey -- all extremely well suited to the blues material that leads off the album. On the standards, Quebec performs with the rhythm section only, and Clark's soft touch takes over the backdrops. His lines on these selections are long and lyrical, full of harmonic details as well as atmosphere. Contrast that with the album's exuberant first half, highlighted by a raucous romp through &quot;See See Rider,&quot; where Quebec's wide swing-era vibrato meshes fantastically with Green's down'n'dirty trombone slides. Green's two originals, &quot;Congo Lament&quot; and &quot;B.G.'s Groove Two,&quot; are both winning and rhythmically infectious, while Quebec's &quot;I.Q. Shuffle&quot; is the most bop-tinged sextet workout. The mood isn't as unified as some of his carefully calibrated romantic dates, but Easy Living offers the two strongest sides of Quebec's musical personality in one place, encapsulating a great deal of what he did best. (AllMusic)\n\nTrack list:\n01 - See See Rider\n02 - Congo Lament\n03 - Que's Pills\n04 - B.G.'s Groove Two\n05 - I.Q. Shuffle\n06 - I've Got A Crush On You\n07 - Nancy (With The Laughing Face)\n08 - Easy Living\n\nPersonnel:\nIke Quebec - tenor saxophone\nBennie Green - trombone (tracks 1-5)\nStanley Turrentine - tenor saxophone (tracks 1-5)\nSonny Clark - piano\nMilt Hinton - bass\nArt Blakey - drums\n\nEnjoy and share!","torrent":{"xt":"urn:btih:733f8a04ce816d8baff843e833f5d1d212c17314","amp;dn":"Ike+Quebec+-+1962+-+Easy+Living+%281995%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"733f8a04ce816d8baff843e833f5d1d212c17314","infoHashBuffer":{"type":"Buffer","data":[115,63,138,4,206,129,109,139,175,248,67,232,51,245,209,210,18,193,115,20]},"announce":[],"urlList":[]}}