{"title":"[MP3 - 192 Kbps - Rock]Irene Grandi - Prima di Partire","uid":4401048,"size":63530969,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:737c7478e3079527d680f2c6d2d356f680807383&amp;dn=%5BMP3+-+192+Kbps+-+Rock%5DIrene+Grandi+-+Prima+di+Partire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"taritilion","files":11,"time":1221691448,"description":"Irene Grandi - Prima di Partire\n\n\nArtista \tIrene Grandi\nTipo album \tStudio\nPubblicazione \tPrimavera 2003\nDischi \t1\nTracce \t10\nGenere \tRock\nEtichetta \tCGD Eastwest Records\n\nIrene Grandi (Firenze, 6 dicembre 1969) ÃƒÂ¨ una cantautrice italiana.\n\nUna delle sue prime apparizioni televisive ufficiali risale al 20 novembre 1993 alla trasmissione Roxy Bar per promuovere il suo primo 45 giri &quot;Un motivo maledetto&quot; , a 24 anni viene scoperta dal grande pubblico grazie a T.V.B., scritta appositamente per lei da Jovanotti, ma il grande successo lo raggiunge l&amp;#039;anno seguente, nel 1995, vendendo con l&amp;#039;album In vacanza da una vita, trainato dal fortunatissimo singolo di Bum Bum, oltre 500.000 copie in Italia.\n\nNel corso della sua carriera ha cantato anche in spagnolo ed ha eseguito duetti in inglese, tedesco, francese, indiano ed africano; ha attraversato diversi generi musicali (rap, pop, soul, rock, dance, hard rock, blues, jazz e unplugged, ma senza rinunciare alla melodia italiana), collaborando spesso con artisti del panorama musicale nazionale (Jovanotti, Eros Ramazzotti, Pino Daniele, Vasco Rossi, Gaetano Curreri degli Stadio, Edoardo Bennato, Francesco Bianconi dei Baustelle, fino ad arrivare a Elio e le Storie Tese). Ha ricoperto anche ruoli di attrice e presentatrice , il 2008 la vede anche scrittrice della sua prima autobiografia ufficiale .\n\n\nUn meditato ritorno alle origini, un&amp;#039;istintiva necessitÃƒÂ  di suoni grintosi o il frutto di una terapia a base di Vasco Rossi, non sappiamo a quale di questi motivi sia imputabile il ritorno allo spirito rock di Irene Grandi (forse a un mix di tutti questi elementi), ma ÃƒÂ¨ un fatto che questo nuovo disco della cantante toscana vibri piÃƒÂ¹ dei precendenti. &quot;Prima di partire&quot; (CGD) ÃƒÂ¨ il sesto lavoro di Irene Grandi ed ÃƒÂ¨ un album a base di suoni curati e ritmi sostenuti, non perÃƒÂ² senza picchi e piccole cadute. La vetta piÃƒÂ¹ alta ÃƒÂ¨ sicuramente il singolo che ha lanciato il disco e che ha ispirato anche il titolo: &quot;Prima di partire per un lungo viaggio&quot;, scritto e prodotto per lei da Vasco Rossi e Gaetano Curreri. Dei due illustri colleghi la canzone ha il forte impatto dei testi diretti e la cura per il suono, che balzano prepotentemente in primo piano. Insieme alla forza di brani come questo, convivono, invece, altri pezzi meno convincenti e piÃƒÂ¹ anonimi come &quot;E&amp;#039; solo un sogno&quot; e &quot;Una nuvola bianca&quot;. Tra questi due estremi troviamo le altre sette tracce, che alternano temi e sonoritÃƒÂ  romantiche ad altre piÃƒÂ¹ determinate e ironiche. Tra i pezzi piÃƒÂ¹ dolci del disco il primo posto in ordine di gradimento spetta sicuramente a &quot;Io bucolico&quot;, che dopo &quot;Prima di partire per un lungo viaggio&quot; ÃƒÂ¨ senz&amp;#039;altro la canzone destinata a lasciare una scia al passaggio dell&amp;#039;intero lavoro, per l&amp;#039;attenzione che riesce a destare sin dalle prime note. Mentre tra i brani che incontriamo nel percorso piÃƒÂ¹ dichiaratamente rock risaltano &quot;Oltre&quot; e &quot;Domenica 69&quot;, la seconda decisamente piÃƒÂ¹ valida della prima. A metÃƒÂ  strada tra pop e rock, si posizionano altri brani di ottima fattura, come &quot;Buon compleanno&quot; e &quot;Voglio una ninna nanna&quot;, entrambe scritte da Pia Tuccitto e arrangiate da NiccolÃƒÂ² Fragile, con la produzione di Vasco Rossi. &quot;Prima di partire&quot; ÃƒÂ¨, dunque, un lavoro discreto che Irene Grandi ha confezionato con la preziosa collaborazione di tanti amici e illustri musicisti. E&amp;#039;, infatti, grazie alla complicitÃƒÂ  dei Kinoppi, sua storica band che ha partecipato attivamente alla realizzazione dei brani, e soprattutto alla scelta di affidarsi a un produttore della scena indipendente come Paolo Favati, che la Grandi ha potuto realizzare un lavoro tra i piÃƒÂ¹ curati della sua carriera, sotto il profilo sonoro. PiÃƒÂ¹ dei testi (che a dire il vero non trasudano un grande sforzo, fatte le dovute eccezioni, in primis per il brano firmato da Vasco), infatti, ciÃƒÂ² che resta alla fine dell&amp;#039;ascolto dell&amp;#039;intero album ÃƒÂ¨ proprio il grande rispetto che tutto il team di lavoro ha avuto nei confronti della musicalitÃƒÂ  del disco. Anche la stessa Irene ha scelto un&amp;#039;interpretazione adatta ad ogni atmosfera, nel rispetto dell&amp;#039;ambientazione sonora di ogni pezzo. Questo disco sÃƒÂ¬ che ÃƒÂ¨ un grande esempio di collaborazione.\n","torrent":{"xt":"urn:btih:737c7478e3079527d680f2c6d2d356f680807383","amp;dn":"%5BMP3+-+192+Kbps+-+Rock%5DIrene+Grandi+-+Prima+di+Partire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"737c7478e3079527d680f2c6d2d356f680807383","infoHashBuffer":{"type":"Buffer","data":[115,124,116,120,227,7,149,39,214,128,242,198,210,211,86,246,128,128,115,131]},"announce":[],"urlList":[]}}