{"title":"Shadows and Fog / Neblinas e Sombras-Woody Allen","uid":4586646,"size":562620416,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:73b69a2c5acbe87c8cccaef5534a2be9f9d4ba1a&amp;dn=Shadows+and+Fog+%2F+Neblinas+e+Sombras-Woody+Allen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ricsisifo","files":1,"time":1229648580,"description":"Shadows and Fog (1992)\n\nA small and insignificant bookkeeper, Kleinman, is awoken one night by his neighbours who wants him to help them track down a strangler who has been killing people all over town. The citizens form vigilance committees, but when Kleinman has dressed, his neighbours have disappeared. Meanwhile a circus has come to town. Irmy and Paul are two of the artists. After a fight, Irmy leaves the circus in the middle of the night. Eventually she meets Kleinman, scared and alone.\n\nEm Neblina e Sombras, Woody Allen funde o Expressionismo alemÃƒÂ£o aos pesadelos de Kafka e ÃƒÂ s fÃƒÂ¡bulas contemporÃƒÂ¢neas do diretor alemÃƒÂ£o Wim Wenders. Em uma estranha cidadezinha europÃƒÂ©ia, um serial killer estragula brutalmente suas vÃƒÂ­timas. Allen vive Kleinman, um homem a princÃƒÂ­pio escalado para procurar o assassino, mas que logo passa a ser apontado como principal suspeito. Simultaneamente ÃƒÂ  busca pelo criminoso, um circo chega na cidade, acrescentando novos elementos ao filme. Quando flagra seu marido (Jonh Malkovich) com a trapezista Marie (Madonna), a engolidora de espadas Irmy (Mia Farrow) arruma suas coisas e decide ir embora. No caminho, ela encontra Kleinman, unindo definitivamente as narrativas.\n","torrent":{"xt":"urn:btih:73b69a2c5acbe87c8cccaef5534a2be9f9d4ba1a","amp;dn":"Shadows+and+Fog+%2F+Neblinas+e+Sombras-Woody+Allen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73b69a2c5acbe87c8cccaef5534a2be9f9d4ba1a","infoHashBuffer":{"type":"Buffer","data":[115,182,154,44,90,203,232,124,140,204,174,245,83,74,43,233,249,212,186,26]},"announce":[],"urlList":[]}}