{"title":"Stuff","uid":8946077,"size":552126,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:749d781b074ed6c70f108acaebe307751a9657ed&amp;dn=Stuff&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"livhre","files":-1,"time":1379780568,"description":"Things make us just as much as we make things. And yet, unlike the study of languages or places, there is no discipline devoted to the study of material things. This book shows why it is time to acknowledge and confront this neglect and how much we can learn from focusing our attention on stuff.\nThe book opens with a critique of the concept of superficiality as applied to clothing. It presents the theories that are required to understand the way we are created by material as well as social relations. It takes us inside the very private worlds of our home possessions and our processes of accommodating. It considers issues of materiality in relation to the media, as well as the implications of such an approach in relation, for example, to poverty. Finally, the book considers objects which we use to define what it is to be alive and how we use objects to cope with death.\nBased on more than thirty years of research in the Caribbean, India, London and elsewhere, Stuff is nothing less than a manifesto for the study of material culture and a new way of looking at the objects that surround us and make up so much of our social and personal life","torrent":{"xt":"urn:btih:749d781b074ed6c70f108acaebe307751a9657ed","amp;dn":"Stuff","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"749d781b074ed6c70f108acaebe307751a9657ed","infoHashBuffer":{"type":"Buffer","data":[116,157,120,27,7,78,214,199,15,16,138,202,235,227,7,117,26,150,87,237]},"announce":[],"urlList":[]}}