{"title":"Translucent Stupa - Great Buddhist Books v2.0 - 2015.06.02","uid":11982494,"size":24728363496,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:756a6daf489967e7b87b489ab9d1f79669c1fbb8&amp;dn=Translucent+Stupa+-+Great+Buddhist+Books+v2.0+-+2015.06.02&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kunleg","files":37,"time":1433254192,"description":"The Translucent Stupa of Non-Ownership\nA Public Library of Buddhadharma, an Auspicious Sharing and Curation of Great Dharma Books v2.0 (Saga Dawa, 2015)\n\nHundreds of Buddhist books, most of them collected from other torrents and libgen, but also many new ones. All the &quot;Great Dharma Books&quot; torrents + ~200 more.\n\nAll kinds of formats, but mainly pdf and e-reader files (mobi, epub). \n\nIt is very difficult to manage 1000+ files on torrent, Pirate Bay gets nervous with a big torrent file-wise. So I rared it, don't complain. There will be updates for sure. There's a file list outside the rar. \n\nAll of Chogyam Trungpa Rinpoche's, many Dalai Lama's, all Thinley Norbu Rinpoche's, Dudjom Rinpoche, Tai Situ Rinpoche, Karmapa, Sakya Trizin, Khyentse Rinpoche, the foremost translators and western scholars, Jeffrey Hopkins, Alan Wallace, Richard Barron, Robert Thurman, Erik Pema Kunsang, Keith Dowman, vajrayana, mahayana, madhyamika, dzogchen, mahamudra, zen, tantra, yogachara, sutras, classic commentaries, mind training, meditation, pith instruction, modern classics, classic translations, new translations, academic papers, dissertations, advice from contemporary teachers, rare and difficult to find books in any format, and, hopefully, all free of spurious teachers and gloriously preserved.\n\nAll Tibetan lineages represented, some Theravada and Zen.\n\nPlease share, please seed. Give to your lama, give to your fellow students. Do you think the Buddha or Guru Rinpoche would frown upon you spreading the teachings, even though copyright law makes it illegal? Please sponsor dharma activity at all times, and pay respects and always make offerings to all these teachers, translators and dharma centers here represented. They don't sell the dharma, so don't buy the dharma. Yet, always be generous, and generous with filesharing AND money (and work, and time, and attention). \n\nMay all beings benefit","torrent":{"xt":"urn:btih:756a6daf489967e7b87b489ab9d1f79669c1fbb8","amp;dn":"Translucent+Stupa+-+Great+Buddhist+Books+v2.0+-+2015.06.02","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"756a6daf489967e7b87b489ab9d1f79669c1fbb8","infoHashBuffer":{"type":"Buffer","data":[117,106,109,175,72,153,103,231,184,123,72,154,185,209,247,150,105,193,251,184]},"announce":[],"urlList":[]}}