{"title":"Dick Dale &amp; His Del-Tones - Mr. Eliminator (1964) [FLAC]","uid":8734108,"size":189532907,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:759bfa501d7d3050e3549fdbd95766d9ee29b4e1&amp;dn=Dick+Dale+%26amp%3B+His+Del-Tones+-+Mr.+Eliminator+%281964%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1374652267,"description":"Artist - Dick Dale and his Del-Tones\nAlbum - Mr Eliminator\nRelease Date: 1964\nLabel: Capitol Records\nCountry: US\nType: Album Official\nLength: 00:28:29\n\nTrack List:\n01. Dick Dale and his Del-Tones - Mr Eliminator (02:01)\n02. Dick Dale and his Del-Tones - 50 Miles To Go (02:15)\n03. Dick Dale and his Del-Tones - Flashing Eyes (01:47)\n04. Dick Dale and his Del-Tones - Taco Wagon (02:10)\n05. Dick Dale and his Del-Tones - The Squirrel (02:08)\n06. Dick Dale and his Del-Tones - The Victor (03:14)\n07. Dick Dale and his Del-Tones - Blond In The 406 (01:58)\n08. Dick Dale and his Del-Tones - Firing Up (02:35)\n09. Dick Dale and his Del-Tones - My X-KE (01:52)\n10. Dick Dale and his Del-Tones - Nitro Fuel (02:04)\n11. Dick Dale and his Del-Tones - Hot Rod Alley (02:12)\n12. Dick Dale and his Del-Tones - Wild Ideas (02:24)\n13. Dick Dale and his Del-Tones - Wild, Wild Mustang (01:49)\n\nThx to the OP on WHAT.\n\nIn the half-century since he began his reign as King of the Surf Guitar, Dick Dale has remained one of rock's most innovative and influential axemen. A bold pioneer in the use of speed, volume and sonic texture, the charismatic Dale invented surf music, and in the process permanently altered the role of the electric guitar in rock 'n' roll. Of all the surf guitarists who would follow in Dale's wake, none could match his prodigious technique, his fierce showmanship or his restless inventiveness.  At the dawn of the 1960s, Dale's passion for the sport of surfing inspired him to create music that replicated the physical sensations of the surfing experience.  Although he began releasing singles on his own Deltone label in the late '50s, Dale made much of his most enduring music during his '60s stint with Capitol Records. In addition to carving out the surf sound on the landmark albums Surfers' Choice, King of the Surf Guitar and Summer Surf, Dale turned for inspiration to another all-American pursuit--drag racing--to create the hot-rod music genre on the LPs Checkered Flag and Mr. Eliminator.\n\nNow, Sundazed is making Dick Dale's reverb-soaked, genius LPs available once again, the way they were meant to be heard: on vinyl. Our vinyl restoration of the vintage Dale catalog features his take-no-prisoners 1964 album, Mr. Eliminator. Whether its the fuel-injected, AA-gas thrills of the LP's title track, the south of the border shake and shimmy of &quot;Taco Wagon&quot; or the heroic guitar avalanche of &quot;The Victor,&quot; Dick Dale and his Del-tones know what every Friday-afternoon kegger needs just as much as an unlimited supply of suds: the breathtaking excitement where the drag slicks meet the road, compliments of the slashing, reverbed-guitar genius of the king of hot rod, Dick Dale! This album has been mastered from the original analog tapes, and is packaged with the complete original cover art.\n","torrent":{"xt":"urn:btih:759bfa501d7d3050e3549fdbd95766d9ee29b4e1","amp;dn":"Dick+Dale+%26amp%3B+His+Del-Tones+-+Mr.+Eliminator+%281964%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"759bfa501d7d3050e3549fdbd95766d9ee29b4e1","infoHashBuffer":{"type":"Buffer","data":[117,155,250,80,29,125,48,80,227,84,159,219,217,87,102,217,238,41,180,225]},"announce":[],"urlList":[]}}