{"title":"Guns N' Roses - The Spaghetti Incident (1993) WMA320","uid":6128279,"size":121665446,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:76e4e136bc91681eed1f7275f1ec64eef47a2594&amp;dn=Guns+N%5C%27+Roses+-+The+Spaghetti+Incident+%281993%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1296025885,"description":"November of 1993 saw the release of Guns N' Roses fifth album &quot;The Spaghetti Incident?&quot; It was recorded mostly alongside the &quot;Use Your Illusion&quot; (1991) albums and featured the lineup of Axl Rose, (vocals) Slash, (lead guitar) Duff McKagan, (bass) Dizzy Reed, (keyboards) and Matt Sorum (drums). Izzy Stradlin's (rhythm guitar) parts were removed and replaced by then current gunner Gilby Clarke. \n\nGuns N' Roses swan song (at least of old-school GN'R) &quot;The Spaghetti Incident?&quot; seems to rub people the wrong way. It unfortunately has the reputation of being one of those albums that &quot;suck.&quot; That's a shame because while &quot;The Spaghetti Incident?&quot; is not a timeless classic, it's a good album. \n\nWhy do people seem to have such a negative reaction to this album? I think quite simply there really isn't an audience for a GN'R punk-cover album. While there was definitely an element of punk to the GN'R sound (courtesy of bassist Duff McKagan) people, by and large, who like &quot;Paradise City,&quot; &quot;Sweet Child `O Mine&quot; and &quot;November Rain&quot; aren't going to dig Iggy and the Stooges, T-Rex, the Dammed, Fear, The UK Subs, etc. Likewise, fans of punk-rock aren't going to like the slick production, added solos, and other perceived bombast of GN'R's interpretations. \n\nWhile Guns N' Roses renditions on &quot;The Spaghetti Incident?&quot; are nowhere near as raw or unadulterated as the original songs, that's not really a problem. If you went into &quot;The Spaghetti Incident?&quot; expecting a straight-up punk album, I can see why you'd be disappointed. But rather than just paying homage to the artists that influenced them by doing a punk album note-for-note, GN'R gave the songs their own spin, their own interpretation. With &quot;The Spaghetti Incident?&quot; Guns N' Roses made these songs their own by adding their own signature. So while these songs aren't as raw as the originals, they have more melody, color, hooks, and are far more palatable than the originals. While I can appreciate the argument from punk fans that GN'R shouldn't have taken liberties on their beloved classics, I personally really like these renditions. \n\nHighlights include the Damned's excellent &quot;New Rose,&quot; The UK Subs &quot;Down on the Farm,&quot; (in which Axl Rose puts on a brilliant and somewhat hysterical faux British accent) the Misfits &quot;Attitude&quot; and Steve Jones' &quot;Black Leather.&quot; The album's big hit, the Skyliners' &quot;Since I Don't Have You&quot; is hauntingly morose, yet sublime in its rich melody and killer solos. The album is probably best known for the &quot;hidden track,&quot; Charles Manson's &quot;Look at your Game Girl,&quot; which is creepy with its bizarre lyrics and eerie sparseness. It should be noted that Manson himself received no royalties from sales of the album. \n\nThe timing, however, was really bad for this album. By the end of '93 grunge and alternative rock were all the rage. While Guns N' Roses still had an enormous fan base by the end of '93, the band was seen as outdated, and the backlash spawned by their conceptual videos and over-the-top personas and lifestyles was beginning to set in. While &quot;The Spaghetti Incident?&quot; was meant merely as a stop-gap to tide fans over until the next release, thirteen years later, the next release, the forever in-the-works &quot;Chinese Democracy&quot; still has not yet arrived. &quot;The Spaghetti Incident?&quot; left a bad taste in the public's mouth and temporally took GN'R's legacy down a notch, although with the passage of time the sour taste has all but disappeared. \n\nWhile &quot;The Spaghetti Incident?&quot; will ultimately be just a footnote in the legacy of GN'R, it is still a good album that is somewhat underrated. If you are new to GN'R, by all means, check it out. \n\nby Daniel Maltzman\n\nTRACKLIST:\n\n01 - Since I Don't Have You.wma                             \n02 - New Rose.wma                                           \n03 - Down On The Farm.wma                                   \n04 - Human Being.wma                                        \n05 - Raw Power.wma                                          \n06 - Ain't It Fun.wma                                       \n07 - Buick Makane (Big Dumb Sexy).wma                       \n08 - Hair Of The Dog.wma                                    \n09 - Attitude.wma                                           \n10 - Black Leather.wma                                      \n11 - You Can't Put Your Arms Around A Memory.wma            \n12 - I Don't Care About You.wma\n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:76e4e136bc91681eed1f7275f1ec64eef47a2594","amp;dn":"Guns+N%5C%27+Roses+-+The+Spaghetti+Incident+%281993%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76e4e136bc91681eed1f7275f1ec64eef47a2594","infoHashBuffer":{"type":"Buffer","data":[118,228,225,54,188,145,104,30,237,31,114,117,241,236,100,238,244,122,37,148]},"announce":[],"urlList":[]}}