{"title":"Judith of Bethulia (1914)","uid":4657560,"size":326242710,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:79ac186f3d10af3b68fe0fbd198076e66c1de386&amp;dn=Judith+of+Bethulia+%281914%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Willams","files":3,"time":1232261232,"description":"Judith of Bethulia (1914)\n\n\nJudith of Bethulia was a 1914 film and starred Blanche Sweet and Henry B. Walthall, and was produced and directed by D. W. Griffith in 1913. This was the first feature-length film made by pioneering film company Biograph, although the second that Biograph released. Shortly after its completion and a disagreement Griffith had with Biograph executives on making more future feature-length films, Griffith left Biograph, and took the entire stock company with him. Biograph delayed the picture's release until 1914, after Griffith's departure, so that it would not have to pay him in a profit-sharing agreement they had.\n\nThe film caused controversy with its inclusion of an orgy scene.\n\nThe story is from the Bible's Book of Judith about the siege of the Jewish city Bethulia by Assyrians. A widow named Judith (Blanche Sweet), has a plan to stop the war of the city when her people suffer starvation, and are ready to surrender. The widow disguises herself as a harem-girl, and goes to the enemy where she beguiles a general of King Nebuchadnezzar, whose army is destroying the city. Judith seduces Holofernes (Henry Walthall), then while he is drunk, cuts off his head with a sabre. She returns to her city, a heroine.\n\nThe reviews were favorable: Variety, March 27, 1914 wrote: &quot;It is not easy to confess one's self unequal to a given task, but to pen an adequate description of the Biograph's production of 'Judith of Bethulia' is, to say the least, a full grown man's job.&quot;\n\nThe Moving Picture World, March 7, 1914 described it as: &quot;A fascinating work of high artistry, 'Judith of Bethulia' will not only rank as an achievement in this country, but will make foreign producers sit up and take notice.&quot;\n\nIMDB: 7.9\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0004181/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0004181/&lt;/a&gt;\n\n\n*********************************** FREAKYFLICKS ************************************\n\nFreakyFlicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe FreakyFlicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n  &lt;a href=&quot;\nhttp://freakyflicks.proboards54.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freakyflicks.proboards54.com&lt;/a&gt;\n\nIf we all seed just 1:1, give at least what we take, this torrent will NEVER DIE\n\n*************************************************************************************","torrent":{"xt":"urn:btih:79ac186f3d10af3b68fe0fbd198076e66c1de386","amp;dn":"Judith+of+Bethulia+%281914%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79ac186f3d10af3b68fe0fbd198076e66c1de386","infoHashBuffer":{"type":"Buffer","data":[121,172,24,111,61,16,175,59,104,254,15,189,25,128,118,230,108,29,227,134]},"announce":[],"urlList":[]}}