{"title":"Rex Griffin - The Last Letter [1935-1955] Bear Family 3CD","uid":6874518,"size":345703639,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7c21edfb2aa32880ca0cde3b74b5e33c78186b36&amp;dn=Rex+Griffin+-+The+Last+Letter+%5B1935-1955%5D+Bear+Family+3CD++&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bonnie335","files":87,"time":1323365371,"description":"Rex Griffin - The Last Letter [1935-1955]\n\nBear Family Records. Release: 1996. With Covers.\n\n\n\nMany Bear Family releases seem like overkill, but this one is easy to justify. This triple CD is a truly wonderful collection, including every one of the 64 sides that Rex Griffin recorded between 1935 and 1946, and also 16 songs recorded as demos by his brother Buddy between 1948 and 1955. The repertory runs the gamut from Jimmie Rodgers-style yodel pieces to highly effective white blues (&quot;I'm Ready to Reform&quot;), and even the future rock &amp; roll standard &quot;Everybody's Tryin' to Be My Baby.&quot; Griffin only had six series recording sessions in his whole career, none lasting more than a day or two, and he recorded as many as ten songs at a time, in effect creating an album's worth of songs, more than 90 percent of it original material. The strange thing is that, despite the fact that each of these sessions pretty much meant using the same backgrounds on each song, they would work as albums -- the material is so strong that it didn't have to be trickled out as singles. The other thing that one notices about these sides is that, along with the quality of the material, the playing is also first-rate. The 1944 sides, radio transcription discs recorded with a band that may have included Red Foley on guitar, intended for broadcast, capture some of the excitement of a Griffin stage performance with his own early-'40s band. These are brisk, rippling, immediate live-in-the-studio honky tonk-style renditions of &quot;Everybody's Tryin' to Be My Baby,&quot; &quot;An Old Faded Photograph,&quot; &quot;Mean Woman Blues,&quot; and other 1930s vintage songs, as well as newer material. The set is worth the investment, even if that means saving up for it. \n\n3 CD's &amp; book from country music's first great songwriter, inc. all of his early sides for Decca, 1935-39, his last recordings for King in 1946, ultra-rare World transcriptions &amp; unrecorded compositions cut on 50s acetates by his brother, Buddy","torrent":{"xt":"urn:btih:7c21edfb2aa32880ca0cde3b74b5e33c78186b36","amp;dn":"Rex+Griffin+-+The+Last+Letter+%5B1935-1955%5D+Bear+Family+3CD++","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c21edfb2aa32880ca0cde3b74b5e33c78186b36","infoHashBuffer":{"type":"Buffer","data":[124,33,237,251,42,163,40,128,202,12,222,59,116,181,227,60,120,24,107,54]},"announce":[],"urlList":[]}}