{"title":"The Big Fix: The Hunt for the Match-Fixers Bringing Down Soccer","uid":10395544,"size":192189021,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7e19fcb03e503cfe759b4caacf971844195cfe42&amp;dn=The+Big+Fix%3A+The+Hunt+for+the+Match-Fixers+Bringing+Down+Soccer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1403261655,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Smart AudioBook Player or Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nThe Big Fix: The Hunt for the Match-Fixers Bringing Down Soccer\n\nWritten by: Brett Forrest\nNarrated by: Alexander Cendese\nLength: 6 hrs and 39 mins\nFormat: Unabridged\nRelease Date:05-06-14\nProgram Type: Audiobook\n\nCan the most beloved sport in the world beat the corruption that threatens to tear it apart?\n\nKnown as the &quot;beautiful game&quot;, soccer is the world's most popular sport, crossing borders and language barriers to entertain billions. But underneath it all - the raucous fans in the stadiums; the beloved players; and FIFA, the international governing body with a membership of 209 national associations - is a scandal that threatens to make soccer the ugliest sport in the world. An underworld of international gambling rings, corrupt players and officials, and shadowy figures preys on the far-flung edges of the game, making match-fixing in soccer one of organized crime's new, profitable businesses.\n\nNow, for the first time, journalist Brett Forrest takes us inside the $700 billion international soccer betting market. Forrest pulls back the curtain, exposing a web of nefarious dealings across the world, even on U.S. soil, with opportunistic fixers bribing players, influencing officials, and staging fake matchups, while Asian criminal syndicates pull the strings. No match is safe - not even the World Cup tournament - especially while local law-enforcement officials lack the resources and the will to investigate.\n\nBut one man has taken on this criminal enterprise: Chris Eaton, a hardheaded Australian, longtime Interpol director, and the former head of security for FIFA. Forrest follows Eaton's journey from local beat cop to FIFA's security chief for the 2010 World Cup in South Africa.\n\nFilled with headline-making revelations, The Big Fix is a must-hear for soccer fans and true-crime aficionados. The story brings us inside Chris Eaton's hunt for the world's biggest fixers and their backers - from the roots of fixing in Singapore and Kuala Lumpur, to FIFA headquarters in Zurich and World Cup preparation in South Africa and Qatar, to fixing's expansion into nearly every country in the world - and the fight to save the beautiful game. ","torrent":{"xt":"urn:btih:7e19fcb03e503cfe759b4caacf971844195cfe42","amp;dn":"The+Big+Fix%3A+The+Hunt+for+the+Match-Fixers+Bringing+Down+Soccer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e19fcb03e503cfe759b4caacf971844195cfe42","infoHashBuffer":{"type":"Buffer","data":[126,25,252,176,62,80,60,254,117,155,76,170,207,151,24,68,25,92,254,66]},"announce":[],"urlList":[]}}