{"title":"My So-Called Love (eng subs) [2008] Barbie Hsu","uid":6123671,"size":2199599025,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7ff906ae63778a4fe17c31155e36ae25f1a85082&amp;dn=My+So-Called+Love+%28eng+subs%29+%5B2008%5D+Barbie+Hsu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1295854047,"description":" &lt;a href=&quot;http://bayimg.com/DADPeAadh&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/DADPeAadh&lt;/a&gt;\n\nMy So-called Love (2008) \n\nAi de fa sheng lian xi (original title) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1329101/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1329101/&lt;/a&gt;\n\nMandarin Chinese with English subtitles\n\nRaised in a broken family, Cat (Barbie Hsu) runs away from home as a teenager to escape her stepfather. In high school, she begins living with boyfriend Liam (Eddie Peng), but puppy love eventually ends in betrayal. While Liam is in the army, Cat, feeling lonely and poor, meets an older man through the Internet; Xiao Gu (Joseph Chang) is looking for sex, Cat is looking for money. From lust comes love, until Cat discovers Xiao Gu is actually married. After ten years of ups and downs, Cat begins anew at age 28 when she meets the rich and kind-hearted Sunshine (Easton Tung), but is he really her heart's final home? \n\n  Barbie Hsu  ...  Xiao Mao  \n  Eddie Peng  ...  Ah Liang  \n  Hsiao-chuan Chang  ...  Xiao Ku  \n  Ming-hsiang Tung  ...  Sunshine (as Easton Dong)  \n\nStar Barbie Hsu also known as DÃƒÂ  S to fans is a Taiwanese actress and singer. She is most well known for her role in Taiwanese dramas, especially Meteor Garden, a Japanese manga adaptation that propelled her to fame. She also acted in movies, her first being the Chinese movie The Ghost Inside. Barbie has also appeared in the Taiwanese series Mars with Vic Zhou. Barbie also had a singing career prior to her acting career. She was in a duo group called &quot;S.O.S.&quot; (Sisters of Shu) with her sister Dee Hsu. Their last album was called Abnormal Girls. Due to the nature of the term S.O.S, they changed their group name to ASOS (A Sisters of Shu).\n\nThe film contains scenes considered shocking to Chinese audiences, but is beautifully photographed.  After Cape No. 7, Taiwan's most talked about movie of 2008 was probably My So-Called Love starring top actress Barbie Hsu (Connected, Meteor Garden). Casting off her reserved image, Hsu is willful and alluring in her portrayal of one woman's tumultuous search for love over a decade's time. Featuring an original score by Mavis Fan and love scenes that had the media buzzing, the film co-stars three of Taiwan's most popular actors as Hsu's romantic interests - Joseph Chang (Eternal Summer), Eddie Peng (Exit No. 6), and Easton Tung Ming Hsiang (Island Etude). Produced by Hsu Li Kong (Crouching Tiger, Hidden Dragon), My So-Called Love marks the feature-length debut of director Leading Lee, a rising star in the industry already well known as a writer and photographer. \n\n","torrent":{"xt":"urn:btih:7ff906ae63778a4fe17c31155e36ae25f1a85082","amp;dn":"My+So-Called+Love+%28eng+subs%29+%5B2008%5D+Barbie+Hsu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ff906ae63778a4fe17c31155e36ae25f1a85082","infoHashBuffer":{"type":"Buffer","data":[127,249,6,174,99,119,138,79,225,124,49,21,94,54,174,37,241,168,80,130]},"announce":[],"urlList":[]}}