{"title":"The Lady in Question (Charles Vidor, 1940) [RePoPo] DUAL","uid":4386710,"size":1468922886,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8050024cced12c82f9af3e0cc1fff292c5dcd841&amp;dn=The+Lady+in+Question+%28Charles+Vidor%2C+1940%29+%5BRePoPo%5D+DUAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"repopo","files":5,"time":1220956203,"description":"*******************************************************************************\n                  The Lady in Question (Charles Vidor, 1940)\n*******************************************************************************\n\n-------------------------------------------------------------------------------\n                              Technical Information\n-------------------------------------------------------------------------------\nType..................: Movie\nContainer file........: AVI\nVideo Format..........: XviD\nTotal Bitrate.........: 2289Kb/s\nAudio format..........: MP3 (CBR 128kb/s)\nAudio Languages.......: English 1.0, Spanish 1.0\nSubtitles Ripped......: Spanish (Forced only)\nSubtitles in Subpack..: Portuguese\nResolution............: 688x512\nAspect Ratio..........: 1.33:1\nOriginal Aspect Ratio.: 1.37:1\nColor.................: B&amp;W\nFPS...................: 25.000\nSource................: Pal DVD\nDuration..............: 1:16:32\nGenre.................: Comedy, Drama\nIMDb Rating...........: 6.5\nMovie Information.....: http://www.imdb.com/title/tt0032686/\nFilmaffinity..........: http://www.filmaffinity.com/en/film421420.html\nAllmovie..............:\n\n\n\n-------------------------------------------------------------------------------\n                                 Release Notes\n-------------------------------------------------------------------------------\nSynopsis: Columbia&amp;#039;s The Lady in Question is a remake of the French Gribouille, \na Raimu vehicle from 1939. Brian Aherne plays Andre Morestan, the seeming \ncontently paterfamilias of a bourgeois Parisian family. Summoned for jury duty, \nMorestan at first believes that accused murderess Natalie Rougin (Rita Hayworth) \nis guilty, but eventually takes pity on the homeless girl and invites her to \nlive with his family after her acquittal. Things get pretty dicey when \nMorestan&amp;#039;s impressionable young son Pierre (Glenn Ford) falls in love with the \nenigmatic Natalie and begins committing petty crimes to finance their \nelopement-leading to a situation not unlike the one that got the girl arrested \nin the first place! In the original Gribouille, it was abundantly clear that \nboth father and son had a yen for their pretty guest, but this menage a trois \nhas been toned down in the Hollywood version, with Morestan remaining more or \nless faithful to his long-suffering wife Michelle (Irene Rich, Filmaffinity).\n\n\nCAST:\n\nGlenn Ford              - Pierre Morestan\nRita Hayworth           - Natalie Rouguin\nBrian Aherne            - Andre Morestan\nIrene Rich              - Michele Morestan\nGeorge Coulouris        - Defense Attorney\nLloyd Corrigan          - Prosecuting Attorney\nEvelyn Keyes            - Francoise Morestan\nEdward Norris           - Robert LaCoste\nCurt Bois               - Henri Lurette\nFrank Reicher           - President of the Court\nSumner Getchell         - Fat Boy\nNicholas Bela           - Nicholas Farkas\nLouis Adlon             - Court Clerk\nRonald Alexander        - Juror\nLeon Belasco            - Barber\nMary Bovard             - Miss Morlet\nDorothy Burgess         - Antoinette\nJames B. Carson         - Wine Salesman\nWilliam Castle          - Juror\nGeorge Davis            - Customer\nVernon Dent             - Gendarme\nFern Emmett             - Nathalie Roguin\nHarrison Greene         - Jury Foreman\nCarlton Elliott Griffin\nEarl Gunn               - Angry Juror\nEddie Laughton          - Bit\nTheodore Lorch          - Juror\nHamilton MacFadden      - Guard\nAlex Palasthy\nRalph Peters            - Pedestrian\nFrank Pharr             - Juror\nFred Rapport            - Alternate Juror\nJack Raymond            - Expressman\nJack Rice               - Newly Married Juror\nWilliam Stack           - Mariner\nJulius Tannen           - Judge\nEmma Tansey             - Flower Woman \n\nCREW:\n\nCharles Vidor           - Director\nB.B. Kahane             - Producer\nLewis Meltzer           - Screenwriter\nLucien Andriot          - Cinematographer\nLucien Moraweck         - Composer (Music Score)\nMorris W. Stoloff       - Musical Direction/Supervision / Composer (Music Score)\nAl Clark                - Editor\nLionel Banks            - Production Designer\nRay Howell              - Costume Designer\nRobert Kalloch          - Costume Designer\nWilliam Knight          - Makeup\nCharles C. Coleman, Jr. - First Assistant Director\n\n\nSOME REVIEWS:\n\nBased on the French film Gribouille, a juror gives the woman acquitted a job and \na room while lying to his wife, and his son falls in love with her.\n\nAndre Morestan (Brian Aherne) leaves his bicycle shop for jury duty. Brash Andre \nis an alternate juror. Natalie Roguin (Rita Hayworth) is charged with murder, \nand the victim got her an apartment. Andre replaces an ill juror. Natalie says \nthe victim Gilbert struck her, was drunk, and tried to kill her; she struggled \nto get his gun. His father testifies that Gilbert took money from him for her. \nAndre asks a pertinent question. At home Francois Morestan (Evelyn Keyes) asks \nher father Andre if she can marry Robert LaCoste (Edward Norris). Another woman \ncalling herself Natalie Roguin testifies Gilbert threatened to kill her but was \nnot drunk. The jury cannot agree, and Andre argues she must be acquitted. When \nhe explains, they agree. Andre tells her lawyer he will help her.\n\nAndre trades a tandem for two bikes, and his wife Michele Morestan (Irene Rich) \ncomplains. Natalie calls Andre, and he goes to meet her. Natalie says she can&amp;#039;t \nget work. Andre offers her a job in his shop and a room; but he tells Michele \nshe is a friend&amp;#039;s daughter. Andre&amp;#039;s son Pierre Morestan (Glenn Ford) sees it is \nNatalie. Francois says Pierre is in love. Pierre finds Natalie reading his \nastronomy book. Michele hears Natalie talking Hungarian. Andre tries to keep \njuror Lurette (Curt Bois) from seeing Natalie. Lurette tells Michele they made a \nmistake on the case, and Andre tells Lurette not to come back. Robert wants to \nteach Natalie how to dance. Andre is worried but reassures Natalie. Andre tells \nMichele that she spoke a dialect, not Hungarian. At dinner they discuss the \nmurder case, and Natalie goes out, followed by Pierre, who tells her he knows \nwho she is and advises her to leave. Natalie defends Andre, and Pierre shows her \nthe moon and Venus.\n\nIn church Lurette sees Andre with Natalie, who leaves. Pierre tells Natalie she \nwill be his wife. Pierre tells Andre he is going to marry Natalie, but Andre \nsays no. Robert tells Natalie that Lurette informed him who she is. Robert tries \nto kiss her, and jealous Pierre fights Robert until Andre stops them. Michele \nlearns about Natalie, and Francois cries. Pierre takes money; but Natalie says \ngood-bye and that she does not love him. Andre accuses Pierre of robbing him and \nbreaks a cupid on Natalie&amp;#039;s head. Michele keeps Andre from telling a policeman. \nMichele doesn&amp;#039;t want Pierre to leave and says she&amp;#039;ll go too. Andre tells Lurette \nhe was right, and Lurette tells him to go to the court. Andre does and learns \nthat evidence proved her innocent. Andre tells Lurette that Natalie will be his \ndaughter-in-law.\n\nThis comedy-drama shows the power a beautiful woman has to motivate men to do \ngood and bad things. (Sanderson Beck)\n\n--------------------------------------------------------------------------------\n\nIt&amp;#039;s a remake of the 1937 French film Gribouille (&quot;Heart of Paris&quot;). The stagy \ndroll family drama/comedy is directed by Charles Vidor (&quot;Gilda&quot;/&quot;Cover \nGirl&quot;/&quot;Ladies in Retirement&quot;). It&amp;#039;s the first teaming up of the charismatic \nGlenn Ford and Rita Hayworth duo. Writer Lewis Meltzer bases it on the story by \nMarcel Achard. \n\nAndre Morestan (Brian Aherne) is the good-natured, middle-aged bourgeois \nshopkeeper patriarch of a Parisian family. His stern wife Michele (Irene Rich) \nlooks upon him with disdain that he&amp;#039;s so gleeful about going on jury duty and \nnot being in his bicycle shop. His naive daughter Francois (Evelyn Keyes) wants \nhis permission to marry pretentious dance instructor Robert LaCoste (Edward \nNorris), while his son Pierre (Glenn Ford) would rather watch his dad on jury \nduty than mind the store.\n\nWhen a juror gets sick, alternate juror Andre replaces him on the trial of \nNatalie Roguin (Rita Hayworth). She&amp;#039;s a young woman of questionable repute \naccused of murdering her lover who put her up in an apartment. The death, she \nsays, resulted when he was drunk and struck her; in the struggle to knock away \nhis gun, it accidently discharged. Most of the jury believes she&amp;#039;s a liar and is \nguilty, but the overbearing Andre convinces them there&amp;#039;s doubt and they acquit \nher. Andre feels sorry for her, and tells that to her lawyer (George Coulouris). \nHe then offers her a job in the shop and a room, and disguises her identity by \nsaying she&amp;#039;s the daughter of an old friend. Pierre believes his father was \nfooled by Nancy, but falls in love with her anyway. This leads to many domestic \ncomplications that have to be straightened out, including Andre now feeling he \nmade a mistake about Nancy&amp;#039;s innocence.\n\nIt serves as a showcase for Rita. But the film veers awkwardly from comedy to \ndrama, and seems vacuous as it&amp;#039;s more about the beauty of Rita causing men to \nmake fools of themselves than anything else.  (Dennis Schwartz)\n\n--------------------------------------------------------------------------------\n\nThe Lady in Question marked the first pairing of Rita Hayworth and Glenn Ford. \nIt firmly established their onscreen relationship. In this movie, as well as in \nGilda and Affair in Trinidad, Hayworth plays a woman with a mystery about her \nthat drives Ford to distraction.\n\nAs the movie opens, bicycle shop owner, Andre gets called to jury duty and \neagerly races off to do his civic duty. His wife and, college aged, son and \ndaughter find his enthusiasm for jury duty amusing. Andre finds himself sitting \non a jury in which Hayworth is accused of killing a man, with whom she may or \nmay not have been a mistress to.\n\nIn a ridiculous way, Andre helps to get Hayworth acquitted. He then offers the \npoor, innocent girl a job at his bicycle shop to help her out. He lies to his \nfamily that she is the daughter of an old friend. Ford, however, knows who she \nreally is, but it&amp;#039;s too late for him to tell mom as he has, of course, fallen in \nlove with her. Sure it is one of those love at first sight things, but hey, it \nis Rita Hayworth.\n\nRita would go on to become the hottest sex symbol of the 1940&amp;#039;s. It happened \nafter she started appearing in musicals where she was all dolled up in glamorous \nclothes, dancing around showing some skin. In The Lady in Question, Hayworth \nwears very conservative, I am too demure to be guilty, clothes. She walks around \nacting very melancholy. She is a mere shadow of her future mass appeal as a \nmovie star.\n\nFord made a dozen unmemorable movies before serving as a Marine in World War II. \nThis movie being one of them. His first film after coming back to Hollywood was \nopposite Hayworth in the classic Gilda. The first thing you notice about Ford, \nif you can actually tear yourself away from Hayworth, is just how much older he \nlooks in Gilda than in The Lady in Question. Whereas Hayworth got sexier, Ford \njust got older. In their first movie, Ford is a baby faced rube. In Gilda, he is \na mature man with some life experiences. Was it his acting, or did the war play \nit&amp;#039;s part? Either way, The Lady in Question is more of a foot note in the \npairing of Hayworth and Ford than it is an actual movie worth seeing.  (Eric \nNash)\n\n--------------------------------------------------------------------------------\n\nCheck you have installed the right codecs, as listed in this .nfo file, before\ntrying to play it.  VLC will play this file without having to install any codec.\n\nIf you don&amp;#039;t like the codec(s), container, resolution, file size, languages or\nany technical aspect on this rip, keep it to yourself and go and do your own.\n\nSerious feedback on quality will always be welcome\n\n--------------------------------------------------------------------------------\n--------------------------------------------------------------------------------\n","torrent":{"xt":"urn:btih:8050024cced12c82f9af3e0cc1fff292c5dcd841","amp;dn":"The+Lady+in+Question+%28Charles+Vidor%2C+1940%29+%5BRePoPo%5D+DUAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8050024cced12c82f9af3e0cc1fff292c5dcd841","infoHashBuffer":{"type":"Buffer","data":[128,80,2,76,206,209,44,130,249,175,62,12,193,255,242,146,197,220,216,65]},"announce":[],"urlList":[]}}