{"title":"Sunset Boulevard - The Classic Film Scores of Franz Waxman","uid":11499161,"size":365546937,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:80651a3110a08f079973e1b47d89097b9c763ef6&amp;dn=Sunset+Boulevard+-+The+Classic+Film+Scores+of+Franz+Waxman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"metro369","files":14,"time":1416320223,"description":"Get rid of preconceived ideas of what an orchestra should play, or of conventional forms, and your reward will be this album full of exciting overtures from classic Hollywood films. Waxman is no less gifted for having worked in the popular medium; he makes excellent use of tone color, phrasing, and dynamics (among other things) to evoke the emotional worlds of the films through the orchestra. Prince Valiant is indeed valiant, with a beginning worthy of Wagner. It is clear the orchestra really understands Waxman's music, with its attentive phrasing and sweeping lines. Waxman knows the strengths of each instrument, be it the mysterious saxophone beginning of A Place in the Sun, the slow bassoon of Taras Bulba, the frenetic strings that are like a monster pacing, and the thumping drum like a heartbeat in The Bride of Frankenstein. In the latter piece, science fiction fans might hear pre-Star Trek echoes in the music, whereas others might hear echoes of Gershwin at his Rhapsody in Blue or An American in Paris best in The Philadelphia Story. Naturally, the best film composers must give the listener a clear sense of the action while underscoring particular elements in the film. Waxman takes us on Norma Desmond's journey through Sunset Boulevard, with its ominous brass chords that forebode doom and its distorted-tango section in the middle. Charles Gerhardt and the National Philharmonic Orchestra give it their all, never hesitating with the extremes of emotion. Purists might complain that these overtures are over-the-top or sentimental, maudlin works best forgotten and left to the past. However, like classic films, there is nothing quite like them. For those who would have a lush orchestra over a rock &amp; roll soundtrack, this CD is a gem","torrent":{"xt":"urn:btih:80651a3110a08f079973e1b47d89097b9c763ef6","amp;dn":"Sunset+Boulevard+-+The+Classic+Film+Scores+of+Franz+Waxman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80651a3110a08f079973e1b47d89097b9c763ef6","infoHashBuffer":{"type":"Buffer","data":[128,101,26,49,16,160,143,7,153,115,225,180,125,137,9,123,156,118,62,246]},"announce":[],"urlList":[]}}