{"title":"Exploited College Girls - Brooke - 720p ","uid":12183192,"size":3096332468,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:80c87d362d3dc5da5ec191b8d3da11baaf7189ad&amp;dn=+Exploited+College+Girls+-+Brooke+-+720p+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Chinu685","files":1,"time":1438499507,"description":" Brooke is a girl who looks like a librarian or a court reporter but talks like the sex consultant on a 50 Shades movie. Shes an enthusiastic amateur with girl next door looks and a curvy, natural body. Shes bubbly and cute and brings a fresh attitude to Ex Co Gi this week. The contrast between her innocent face and her tryanything sexpot attitude is a rare and wonderful thing. Things start off with a little behind the scenes in car interview, where Brooke comes off as charming, fun loving and open to anything. Jay decides to test her on this which leads to a sexy behind the scenes car blowjob which turns Brooke on quite a bit and leads to one of the sexiest things weve ever heard during a shoot when she asks Jay if he wants to throw her across the back seat and fuck her. This 19 year old amateur is doing her best to look like a pro. At the start of the shoot Brooke hints that shes a little nervous, but really seems to get into it. After selecting an outfit she gets settled for a few more questions, but Jay cant keep his eyes off her clearly aroused pussy and he encourages her to strip and take care of herself. While Jay gets the cameras in position and finds a suitable vibrator, Brooke nearly gets herself off for you with just her fingers. After putting Brooke into a daze with a vibrator, Jay lays back to get another tongue treatment from her and then really gets things going by fucking her from behind as shes face down on the bed. He moves her into cowgirl and finally elicits a loud, gasping orgasm from her. Shes so grateful that she gets back to her knees to help Jay finish on her face and even takes a second to clean him off.\n &lt;a href=&quot;\nhttp://teenimage.org/img-55bda7080486c.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://teenimage.org/img-55bda7080486c.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://teenimage.org/img-55bda70ba700f.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://teenimage.org/img-55bda70ba700f.html&lt;/a&gt;","torrent":{"xt":"urn:btih:80c87d362d3dc5da5ec191b8d3da11baaf7189ad","amp;dn":"+Exploited+College+Girls+-+Brooke+-+720p+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80c87d362d3dc5da5ec191b8d3da11baaf7189ad","infoHashBuffer":{"type":"Buffer","data":[128,200,125,54,45,61,197,218,94,193,145,184,211,218,17,186,175,113,137,173]},"announce":[],"urlList":[]}}