{"title":"Apache (Western) {Lancaster, Bronson} [1954]","uid":7949214,"size":762975808,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:812355d1f1368e1793017230bd93ea0a9e62c1f7&amp;dn=Apache+%28Western%29+%7BLancaster%2C+Bronson%7D+%5B1954%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"alien99","files":-1,"time":1356211407,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0046719/?ref_=fn_al_tt_1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0046719/?ref_=fn_al_tt_1&lt;/a&gt;\n\nBurt Lancaster &amp; Jean Peters as blue-eyed Apaches  ???  hey maybe they had contacts lenses \n\nStoryline\n\nFollowing the surrender of Geronimo, Massai, the last Apache warrior is captured and scheduled for transportation to a Florida reservation. Instead, he manages to escape and heads for his homeland to win back his girl and settle down to grow crops. His pursuers have other ideas though.\n\n\nUser Review\n\nIf you can suspend disbelief that Burt Lancaster and Jean Peters are Apaches, then this isn't a bad western. If you can't, well then there's gonna be a lot of low ratings posted here.\n\nIn 1886, Geronimo and his braves surrender to the U.S. Calvary in New Mexico and are shipped off to Ft. Marion, Florida. All except one, an Apache named Massai (Burt Lancaster) who begins a one man war against the whites.\n\nMassai escapes from the train that is shipping the Apaches back east and makes his way back to New Mexico. From there, he attacks wagons, soldiers, bridges etc., making life hard for the authorities. He kidnaps Nalinle (Jean Peters) and takes her up to the hills with him while Indian scouts John McIntire and Charles Bronson hunt them down.\n\nMassai finds an isolated spot in the high country and starts to plant a small corn field from seed he got from a Cherokee farmer (Morris Ankrum). He also gets Peters pregnant with child.\n\nThe ending scene in Massai's little cornfield is pure Hollywood. The action scenes are tight as we see Lancaster jumping from rock to rock as he picks off at least 10 of the Indian scouts that have him surrounded. But then as Massai is wounded and runs into McIntire in the cornfield, disbelief occurs and the conclusion seems tacked on in order to make a happy ending out of it. You'll have to see it for yourself.\n\nStill, it's entertaining enough as it is. It's based on a true incident and Lancaster at least brings some dignity to his role as the noble warrior turned farmer who wants to be left in peace. It could've turned out a lot worse.\n","torrent":{"xt":"urn:btih:812355d1f1368e1793017230bd93ea0a9e62c1f7","amp;dn":"Apache+%28Western%29+%7BLancaster%2C+Bronson%7D+%5B1954%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"812355d1f1368e1793017230bd93ea0a9e62c1f7","infoHashBuffer":{"type":"Buffer","data":[129,35,85,209,241,54,142,23,147,1,114,48,189,147,234,10,158,98,193,247]},"announce":[],"urlList":[]}}