{"title":"Black Eyed Vermillion - Hymns for Heretics (2009)","uid":7949209,"size":84755260,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:83be79c6e85065c76ae8cae857ee68b26424da7f&amp;dn=Black+Eyed+Vermillion+-+Hymns+for+Heretics+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mr_Kurtz","files":-1,"time":1356211230,"description":"Black Eyed Vermillion - Hymns for Heretics (2009) mp3 \n\n\nAustin, Texas band Black Eyed Vermillion, comprised of Hank III screamo man Gary Lindsey, and at any time Stevie Tombstone, Killene Tombstone, Bircho Birch on drums, Joe Buck, Andy Gibson, and Fritz from Whiskeydick (and others)\n\nBlack Eyed Vermillion was originally conceived in the back of a tour bus by Gary Lindsey and Joe Buck of Hank (IIIs Damn Band) and Assjack. After moving to Austin Texas, Lindsey crossed paths with fellow expatriated Atlantan Stevie Tombstone and Tombstones bassist (and wife) Killene. Adding the Arkansas madman Bircho Birch on drums formerly of Trusty, completed the lineup. In 2008, Vermillion and Joe Buck Yourself were on tour in Texas where they played a show with local legends, Whiskey Dick. Everybody got along so well that Fritz and Johnson decided to join up and are now backing B.E.V. for some live shows.\n\nBlack Eyed Vermillion combines all the elements of roots music (Blues, Swing, Bluegrass) with the dark anger of punk and grindcore. The result is a primal and haunting sound both decadent and reverent. This (Hymns for Heretics) is their debut cd released on 1332 Records.\n\nGARY LINDSEYS ALTER EGO: I like to describe it as Louis Armstrong getting the shit kicked out of him by Black Flag.","torrent":{"xt":"urn:btih:83be79c6e85065c76ae8cae857ee68b26424da7f","amp;dn":"Black+Eyed+Vermillion+-+Hymns+for+Heretics+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83be79c6e85065c76ae8cae857ee68b26424da7f","infoHashBuffer":{"type":"Buffer","data":[131,190,121,198,232,80,101,199,106,232,202,232,87,238,104,178,100,36,218,127]},"announce":[],"urlList":[]}}