{"title":"Industrial High Pressure Applications - Processes, Equipment and","uid":12100254,"size":10882676,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8403cb103803d6da961266df5878fb24e4d38797&amp;dn=Industrial+High+Pressure+Applications+-+Processes%2C+Equipment+and&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1436278592,"description":"Industrial High Pressure Applications - Processes, Equipment and Safety (Wiley-VCH, 2012).pdf\n\nISBN 9783527325863\n\nIndustrial high pressure processes open the door to many reactions that are not possible under 'normal' conditions. These are to be found in such different areas as polymerization, catalytic reactions, separations, oil and gas recovery, food processing, biocatalysis and more. The most famous high pressure process is the so-called Haber-Bosch process used for fertilizers and which was awarded a Nobel prize. Following an introduction on historical development, the current state, and future trends, this timely and comprehensive publication goes on to describe different industrial processes, including methanol and other catalytic syntheses, polymerization and renewable energy processes, before covering safety and equipment issues. With its excellent choice of industrial contributions, this handbook offers high quality information not found elsewhere, making it invaluable reading for a broad and interdisciplinary audience","torrent":{"xt":"urn:btih:8403cb103803d6da961266df5878fb24e4d38797","amp;dn":"Industrial+High+Pressure+Applications+-+Processes%2C+Equipment+and","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8403cb103803d6da961266df5878fb24e4d38797","infoHashBuffer":{"type":"Buffer","data":[132,3,203,16,56,3,214,218,150,18,102,223,88,120,251,36,228,211,135,151]},"announce":[],"urlList":[]}}