{"title":"Hawkes, John - The Lime Twig.epub","uid":9547931,"size":271848,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:84be41e0007e381b8514ec0ddf04ff646f88d49d&amp;dn=Hawkes%2C+John+-+The+Lime+Twig.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Papushi","files":1,"time":1391173200,"description":"An English horse race, the Golden Bowl at Aldington, provides the background for John Hawkes' exciting novel, The Lime Twig, which tells of an ingenious plot to steal and race a horse under a false name.\nAn English horse race, the Golden Bowl at Aldington, provides the background for John Hawkes' exciting novel, The Lime Twig, which tells of an ingenious plot to steal and race a horse under a false name. But it would be unfair to the reader to reveal what happens when a gang of professional crooks gets wind of the scheme and moves to muscle in on this bettors' dream of a long-odds situation. Worked out with all the meticulous detail, terror, and suspense of a nightmare, the tale is, on one level, comparable to a Graham Greene thriller; on another, it explores a group of people, their relationships fears, and loves. For as Leslie A. Fiedler says in his introduction, &quot;John Hawkes.. . makes terror rather than love the center of his work, knowing all the while, of course, that there can be no terror without the hope for love and love's defeat . . . .&quot;","torrent":{"xt":"urn:btih:84be41e0007e381b8514ec0ddf04ff646f88d49d","amp;dn":"Hawkes%2C+John+-+The+Lime+Twig.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84be41e0007e381b8514ec0ddf04ff646f88d49d","infoHashBuffer":{"type":"Buffer","data":[132,190,65,224,0,126,56,27,133,20,236,13,223,4,255,100,111,136,212,157]},"announce":[],"urlList":[]}}