{"title":"The benefits of Vitamin C that could save your life! (M.D. PhD)","uid":6982559,"size":47938987,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:85ed3d9b32ec1fecdc817c226480f3edf5eeae65&amp;dn=The+benefits+of+Vitamin+C+that+could+save+your+life%21+%28M.D.+PhD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dead97gsx","files":4,"time":1327449102,"description":"Here is a comprehensive lecture on the numerous benefits of and scientific research on vitamin C by Dr. Thomas Levy, M.D., Ph.D., who also happens to be a lawyer as well (J.D). He is an highly respected cardiovascular doctor (HEART DOCTOR) and knows health law. What else could you ask for?\n\nThis is a 2 hour and 12 minute audio that came from one of his live medical conferences that doctors from all around the world came to attend. At the end of his lecture, your hear some amazing questions that are asked and answered by Dr. Levy.\n\n---------\n\nYou will learn things you did not know about the powers of Vitamin C. Dr. Levy discusses some of the most well known doctors who have also used Vitamin C to help save their patients lives like the great Dr. Fred Klenner MD, who probably saves thousands of lives, if not more... through the use of vitamin C. Back in the 1940's, Dr. Klenner used vitamin C to help cure 100% of his 60 POLIO patients and people from over  30 different diseases. These are all stated facts and are medically documented. In 1949 Dr. Fred Klenner published in and presented a paper to the American Medical Association about what he done.\n\nIf you are a doctor, a student, or just someone who is sick or knows of someone who is ill, then this is something you MUST listen to... You will learn so many things that you never knew...\n\nRemember, the most two important things your body needs is:\n1. Water\n2. Vitamin C...\n\nYou will not learn this in medical school, your doctors office or your dentist office and probably will never read about it either in most medical books either.\n\n\nGood health is the best wealth you can ever achieve!","torrent":{"xt":"urn:btih:85ed3d9b32ec1fecdc817c226480f3edf5eeae65","amp;dn":"The+benefits+of+Vitamin+C+that+could+save+your+life%21+%28M.D.+PhD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85ed3d9b32ec1fecdc817c226480f3edf5eeae65","infoHashBuffer":{"type":"Buffer","data":[133,237,61,155,50,236,31,236,220,129,124,34,100,128,243,237,245,238,174,101]},"announce":[],"urlList":[]}}