{"title":"Interconnecting Cisco Network Devices, ICND2 (640-816) [PDF]","uid":8285598,"size":2272199,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8608100151e9e66e10d745046c42692d97586f8e&amp;dn=Interconnecting+Cisco+Network+Devices%2C+ICND2+%28640-816%29+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"theBooks","files":-1,"time":1363936347,"description":"Interconnecting Cisco Network Devices, Part 2 (ICND2): (CCNA Exam 640-802 and ICND exam 640-816) (3rd Edition)\n\nAuthor(s): Stephen McQuerry\nPublisher: Cisco Press\nDate: 2008\nPages: 407\nFormat: PDF\nLanguage: English\nISBN-10: 1587054639\nISBN-13: 978-1587054631\nSize: 2.22 MB\n\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------\n\nDescription:\n\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------\n\nInterconnecting Cisco Network Devices, Part 2 (ICND2), is a CiscoÂ®-authorized, self-paced learning tool for CCNAÂ® foundation learning. This book provides you with the knowledge needed to install, operate, and troubleshoot a small to medium-size branch office enterprise network, including configuring several switches and routers, connecting to a WAN, and implementing network security.\n\nIn Interconnecting Cisco Network Devices, Part 2 (ICND2), you will study actual router and switch output to aid your understanding of how to configure these devices. Many notes, tips, and cautions are also spread throughout the book. Specific topics include constructing medium-size routed and switched networks, OSPF and EIGRP implementation, access control lists (ACL), address space management, and LAN extensions into a WAN. Chapter-ending review questions illustrate and help solidify the concepts presented in the book.\n\nWhether you are preparing for CCNA certification or simply want to gain a better understanding of how to build medium-size Cisco networks, you will benefit from the foundation information presented in this book.\n\nInterconnecting Cisco Network Devices, Part 2 (ICND2), is part of a recommended learning path from Cisco that includes simulation and hands-on training from authorized Cisco Learning Partners and self-study products from Cisco Press.\n\nSteve McQuerry, CCIEÂ® No. 6108, is a consulting systems engineer with Cisco focused on data center architecture. Steve works with enterprise customers in the Midwestern United States to help them plan their data center architectures. He has been an active member of the internetworking community since 1991 and has held multiple certifications from Novell, Microsoft, and Cisco. Before joining Cisco Steve worked as an independent contractor with Global Knowledge, where he taught and developed coursework around Cisco technologies and certifications.\n\n* Review the Cisco IOSÂ® Software command structure for routers and switches\n* Build LANs and understand how to overcome problems associated with Layer 2 switching\n* Evaluate the differences between link-state and distance vector routing protocols\n* Configure and troubleshoot OSPF in a single area\n* Configure and troubleshoot EIGRP\n* Identify and filter traffic with ACLs\n* Use Network Address Translation (NAT) and Port Address Translation (PAT) to conserve IPv4 address space and implement IPv6\n* Connect different sites over WANs or the Internet using IPsec VPN, SSL VPN, leased line, and Frame Relay connections\n\nThis volume is in the Certification Self-Study Series offered by Cisco PressÂ®. Books in this series provide officially developed self-study solutions to help networking professionals understand technology implementations and prepare for the Cisco Career Certifications examinations.\n\nCovers: ICND2 Exam 640-816.\n\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------\n\nAbout the Author:\n\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------\n\nSteve McQuerry, CCIE No. 6108, is a consulting systems engineer with Cisco focused on data center architecture. Steve works with enterprise customers in the Midwestern United States to help them plan their data center architectures. Steve has been an active member of the internetworking community since 1991 and has held multiple certifications from Novell, Microsoft, and Cisco. Before joining Cisco, Steve worked as an independent contractor with Global Knowledge, where he taught and developed coursework around Cisco technologies and certifications.\n\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------\n\nNo Password or Surveys. Guaranteed!!!\n\nPlease seed the torrent if you want to Help :)\n\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:8608100151e9e66e10d745046c42692d97586f8e","amp;dn":"Interconnecting+Cisco+Network+Devices%2C+ICND2+%28640-816%29+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8608100151e9e66e10d745046c42692d97586f8e","infoHashBuffer":{"type":"Buffer","data":[134,8,16,1,81,233,230,110,16,215,69,4,108,66,105,45,151,88,111,142]},"announce":[],"urlList":[]}}