{"title":"Knife Survival: Jim Wagner's Reality-based Personal Protectio","uid":4895388,"size":1467814276,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8623a303ea915b7359a60d0fbe928a3267825713&amp;dn=Knife+Survival%3A+Jim+Wagner%5C%27s+Reality-based+Personal+Protectio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"x_DontTreadOnMe_x","files":-1,"time":1242297990,"description":"&quot;The knife is the most common weapon used by criminals and terrorists, with the average knife attack lasting a mere five seconds. Knife Survival will take you step by step through the 12 angles of attack, the four primary blocks, the proper grip and the Jim Wagner knife-disarm rule. Includes proven conflict drills designed to increase your speed and reaction time: the feeding drill, the one-for-one drill and the freestyle drill.\n\nJim Wagner produced this DVD in conjunction with one of the top knife manufacturers in the world - Boker, who also sponsors his Reality-Based Personal Protection Knife Survival courses in Germany. This DVD will take you step-by-step through the Jim Wagner Knife Disarm Rule; the same techniques he taught to Germany's top counterterrorist unit GSG9. It will also guide you through the 10 primary angles of attack (the Jim Wagner Metric Striking and Blocking Angles).\n\nWhat makes this DVD different from all his other knife related DVDs is Jim Wagner explaining all of the features of the Jim Wagner Reality-Based Blade, a tactical folding knife which he designed for Boker and currently sold throughout North America, South America, and Europe.&quot;\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world's longest running largest explosives and weapons forum on the web!\t","torrent":{"xt":"urn:btih:8623a303ea915b7359a60d0fbe928a3267825713","amp;dn":"Knife+Survival%3A+Jim+Wagner%5C%27s+Reality-based+Personal+Protectio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8623a303ea915b7359a60d0fbe928a3267825713","infoHashBuffer":{"type":"Buffer","data":[134,35,163,3,234,145,91,115,89,166,13,15,190,146,138,50,103,130,87,19]},"announce":[],"urlList":[]}}