{"title":"Howard Stern great collection of prank calls, song parodies, pub","uid":3983262,"size":429416685,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:876b615d1b10d4202569a0815c2f0d0be0e3a259&amp;dn=Howard+Stern+great+collection+of+prank+calls%2C+song+parodies%2C+pub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Zifko","files":1,"time":1200671209,"description":"This is for any die hard Howard Stern fan. This collection was put together by two different torrents I downloaded from Demonoid. I searched this site and have not found anything like this at all so this is priceless for you fans and I don&amp;#039;t know if there&amp;#039;s even any other place to find these sets.  \n\nThere&amp;#039;s roughly 50-60 prank calls. The rest are song parodies, public announcements, and a mix of other random stuff. There are two rar files, the main one you&amp;#039;re downloading and one rar file inside of the main one. \n\nThe first set (first rar you unzip) will have 44 files that all have the same sound quality which is really nice and thats why I named that folder the way I did. The rar within that rar will have 200 files. The sound quality varies on these, someone sat down and listened to each of the shows and cut out all of these so thats why the sound isn&amp;#039;t normalized. If you plan on putting these mp3&amp;#039;s on a cd for you&amp;#039;re car head unit, try to use a program first to normalize the volume level on the second set of files. I didn&amp;#039;t do this but when I do listen in the car sometimes I need to crank it pretty high for some of these, then after it&amp;#039;s over all of a sudden the next track has good quality and it scares the shit out of me. \n\nSome of the pranks are the same ones in each folder but played on different shows so you will hear different Howard Stern crew members during the calls as they react to them. \n\nEnjoy! This is my first upload so let me know if theres any issues. (*^_^*)\n","torrent":{"xt":"urn:btih:876b615d1b10d4202569a0815c2f0d0be0e3a259","amp;dn":"Howard+Stern+great+collection+of+prank+calls%2C+song+parodies%2C+pub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"876b615d1b10d4202569a0815c2f0d0be0e3a259","infoHashBuffer":{"type":"Buffer","data":[135,107,97,93,27,16,212,32,37,105,160,129,92,47,13,11,224,227,162,89]},"announce":[],"urlList":[]}}