{"title":"Alvin Stardust - Alvin Stardust (1974)","uid":4819866,"size":67096737,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:88574f64f58650709439e99ac063b95bb76c638a&amp;dn=Alvin+Stardust+-+Alvin+Stardust+%281974%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Iron_Horse","files":13,"time":1238723920,"description":"Alvin Stardust - Alvin Stardust (1974)\nLP Rip To Mp3 VBR 267-275 mbit/s\nIncluded: Front Cover and this Info\n\nAlvin Stardust (born Bernard William Jewry, 27 September 1942, Muswell Hill, North London) is an English pop singer and stage actor.\n\nMoving to Mansfield, Nottinghamshire at a young age, he attended the Southwell Minster Collegiate Grammar School as a boarder. He made his stage debut in pantomime at the age of four.\n\nIn the early 1960s, Shane Fenton and The Fentones were an unknown teenage band who recorded a demo tape and mailed it in to a BBC programme with the hope of being picked to appear on TV. While awaiting a reply from the BBC, the band's 17 year old singer Shane Fenton (born Johnny Theakstone) died as a result of the rheumatic fever he had suffered in childhood. The rest of the band decided to break up, but then unexpectedly received a letter from the BBC inviting them to come to London to audition in person for the programme. Theakstone's mother asked the band to stay together, and to keep its name, in honour of her son's memory. Jewry, who was a roadie with the group at the time, was asked to become the new Shane Fenton. The combo had a handful of hits in the UK Singles Chart,[1] basing their sound on that of The Shadows. Jewry later also appeared in Billy Fury's movie, Play It Cool.\n\nJewry disappeared from the spotlight for a decade after the break-up of The Fentones, working in music management and performing at small venues with his wife Iris Caldwell, the sister of Rory Storm. During the early 1970s, however, Jewry acquired a new persona, Alvin Stardust, as he successfully cashed in on the glam rock bandwagon. His name was given to him by Michael Levy (later Lord Levy) who owned his record label. Magnet Records. His debut hit was &quot;My Coo-Ca-Choo&quot; in 1973. Stardust had other chart successes with the hits - &quot;Jealous Mind&quot; (UK No. 1), &quot;You, You, You&quot;, &quot;Red Dress&quot; and &quot;Good Love Can Never Die&quot;. In total, he amassed seven Top Ten entries, in a chart span lasting almost 25 years. &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Alvin_Stardust&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Alvin_Stardust&lt;/a&gt;\n\nTracklist:\n01. Red Dress\n02. Heartbeat\n03. Just Love Me Baby\n04. Where's She Gone\n05. You, You, You\n06. Chilli Willi\n07. Jump Down\n08. Shake On Little Roller\n09. Tell Me Why\n10. First Train Out\n11. Blind Fool","torrent":{"xt":"urn:btih:88574f64f58650709439e99ac063b95bb76c638a","amp;dn":"Alvin+Stardust+-+Alvin+Stardust+%281974%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88574f64f58650709439e99ac063b95bb76c638a","infoHashBuffer":{"type":"Buffer","data":[136,87,79,100,245,134,80,112,148,57,233,154,192,99,185,91,183,108,99,138]},"announce":[],"urlList":[]}}