{"title":"Arma 3 1.52 - NoSteam - Multiplayer - Easy Install - MultiLang","uid":12587927,"size":12645574754,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:889e4cefe5c9aecb92c26f7416a42805471932eb&amp;dn=Arma+3+1.52+-+NoSteam+-+Multiplayer+-+Easy+Install+-+MultiLang&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ownproxified","files":16,"time":1445052209,"description":"FEATURES:\r\nMultiplayer Ready!\r\nNo Steam!\r\nPrecracked with simple launcher to launch solo or multiplayer\r\nAll Dlcs included (Helicopters, Karts, Zeus, Marksmen)\r\nAltis life mod with server running (can be disabled if not wanted)\r\nVersion 1.52\r\nLanguage selection ability at launcher\r\n\r\nINFORMATION:\r\nYear: 2013\r\nGenre: Action, 3D, 1st Person, 3rd Person\r\nDeveloper: Bohemia Interactive\r\nPublisher: Bohemia Interactive\r\nPublisher in Russia: Buka\r\nPublication Type: Repack\r\nLanguage: RUS | ENG + Alot More\r\nSound language: ENG\r\nTablet: enclosing (3DM)\r\n\r\nSYSTEM REQUIREMENTS:\r\n✔ Operating System: Windows Vista / 7/8\r\n✔ Processor: Intel Dual Core processor with a clock speed of 2.4 GHz\r\n✔ Memory: 2 GB\r\n✔ Hard disk space: 14 GB\r\n✔ Sound device: compatible with DirectX 9.0\r\n✔ Video Card: 512 MB video RAM (NVIDIA GeForce 8800 GT / ATI Radeon HD 3830)\r\n\r\nDESCRIPTION:\r\nARMA 3 - a new milestone in the genre of tactical military simulation from independent studio Bohemia Interactive, creators of the acclaimed Operation Flashpoint. ARMA 3 has absorbed all the best from previous games in the series and has introduced many innovations. New physics engine allows the player with unprecedented realism to control the fighting. The new model of behavior technology, a wide range of weapons, from the already become classical M16 and AK74 up prototypes, not yet arrived in the widest, as well as the long-awaited fans of the series an opportunity to swim under water. After several years of exhausting war, Europe has become the last refuge in the fighting weakened NATO. Stratis island captured by the enemy in the Middle East and it will gain guaranteed superiority of NATO in the region. Start of operation &quot;Magnitude&quot;: a small group of specially trained soldiers with scientists undercover sent to the island in the Mediterranean Sea. Mission under the threat of collapse! The team is almost completely destroyed, and the main character, Captain Scott Miller washed ashore enemy island. Complete the operation in his power, but on his way there are all the dangers of modern warfare, ruthless environment and the numerical superiority of the enemy. Will have to think about every step!\r\n\r\nGame Features:\r\n- A new game engine allows you to control combat operations with unprecedented realism.\r\n- Now you can be submerged!\r\n- Variety of weapons - from the &quot;classic&quot; AK-74 and M-16 and not yet published in the mass production of prototypes.\r\n- By combining all the positive qualities of predecessors, with a new engine and evolutionary capabilities, ARMA 3 provides the player with nothing comparable experience in tactical combat.\r\n- Create your own game scenarios using a simple and intuitive mission editor.\r\n\r\nLauncher:\r\n[img]http://i.imgur.com/5a3ZFVA.png[/img]\r\n\r\nSetup:\r\n[img]http://i.imgur.com/nD5VRqx.jpg[/img]","torrent":{"xt":"urn:btih:889e4cefe5c9aecb92c26f7416a42805471932eb","amp;dn":"Arma+3+1.52+-+NoSteam+-+Multiplayer+-+Easy+Install+-+MultiLang","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"889e4cefe5c9aecb92c26f7416a42805471932eb","infoHashBuffer":{"type":"Buffer","data":[136,158,76,239,229,201,174,203,146,194,111,116,22,164,40,5,71,25,50,235]},"announce":[],"urlList":[]}}