{"title":"Supertramp - Discografia (1970-1985) [Lossy Mp3 256Kb] Pop Rock ","uid":4956824,"size":696786664,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:88d9c3c4741013bd9901a1a5939b35343a02063c&amp;dn=Supertramp+-+Discografia+%281970-1985%29+%5BLossy+Mp3+256Kb%5D+Pop+Rock+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pammy_71","files":102,"time":1245153014,"description":"Supertramp - Discografia (1970-1985) [Lossy Mp3 256Kb] Pop Rock [Tntvillage.Scambioetico]\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=Supertramp&amp;sb=1&amp;sd=0&amp;cat=0\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=Pammy71&amp;sb=1&amp;sd=0&amp;cat=0\n\nPammy71 - Presenta\n\n Visit this link: http://img44.Imageshack.us/img44/8879/supertramp.jpg\n\n\n:::&gt;Storia&lt;:::\n\nI Supertramp sono uno dei &quot;casi&quot; piÃƒÂ¹ strani della storia del rock. Nati in Inghilterra grazie ai fondi di un benefattore olandese, hanno vissuto per dieci anni nel semi-anonimato fino a quella colazione in America che li avrebbe sfamati per sempre, proiettandoli nelle classifiche dei dischi piÃƒÂ¹ venduti di tutti i tempi. Anche la loro identitÃƒÂ  nell'immaginario collettivo resta ad oggi piuttosto indefinita: un gruppo para-progressive per i piÃƒÂ¹ vecchi, un nostalgico souvenir delle feste delle medie per la generazione di mezzo, una reliquia muffosa per i piÃƒÂ¹ giovani. Per tutti, un enigma: una band che quasi per caso ÃƒÂ¨ entrata nel museo delle glorie del rock e ne ÃƒÂ¨ uscita in punta di piedi. La carriera dei Supertramp potrebbe essere presa e rimossa dalla storia del rock e non cambierebbe alcunchÃƒÂ©: pochissimi gli anelli di congiunzione con i gruppi che l'hanno preceduta, praticamente nessuno con i successori. Gli appassionati di musica e non di statistica, perÃƒÂ², si perderebbero un vagone di melodie e di ritornelli immortali, di quelli che semplicemente fanno bene al cuore, punto e basta.\nSarebbe comunque fuorviante relegare i Supertramp al rango di band easy listening: i loro dischi piÃƒÂ¹ ispirati, infatti, hanno svelato la fantasia e la versatilitÃƒÂ  di un ensemble di musicisti coi fiocchi, in grado di passare con disinvoltura da refrain spensierati a complesse suite strumentali, quasi opere rock in miniatura, degne di band ben piÃƒÂ¹ celebrate di loro. Con l'umiltÃƒÂ  dei clown di strada, di quei vagabondi cui si ispiravano fin nel nome, questi artigiani inglesi hanno aperto nuove porte al pop-rock degli anni 70, partorendo uno stile inconfondibile e inimitabile. Tanto che nessuno, infatti, ha mai cercato di riprodURLo, contribuendo, forse, a renderlo oggi retrÃƒÂ² e indissolubilmente legato a un'epoca. Curiosamente, quindi, la loro &quot;originalitÃƒÂ &quot; ha finito con l'avere un effetto-boomerang, venendo spesso (fra)intesa come un difetto.\n\nZio Sam e il vagabondo\n\nLa strana storia dei Supertramp inizia nel 1969, quando un miliardario olandese di nome Stanley August Miesegaes, detto &quot;Sam&quot;, impressionato da una performance del cantante-pianista Rick Davies con i Joint a Monaco, decide di offrirgli una possibilitÃƒÂ , elargendogli un finanziamento e invitandolo a formare un suo gruppo. Compare cosÃƒÂ¬ un annuncio su Melody Maker: &quot;C'ÃƒÂ¨ la genuina opportunitÃƒÂ  di entrare in una band. Contattatemi&quot;. Firmato Rick Davies. Superano le selezioni in tre: il bassista, cantante e compositore Roger Hodgson, il batterista Bob Miller e il chitarrista Richard Palmer, che a nome Palmer-James sarÃƒÂ  autore dei testi di capolavori dei King Crimson come &quot;Larks' Tongues In Aspic&quot;, &quot;Starless And Bible Black&quot; e &quot;Red&quot;. Il nome prescelto dal gruppo, proprio su suggerimento di Palmer, si rifÃƒÂ  a un romanzo d'inizio secolo di W.H. Davies, &quot;The Autobiography Of A Supertramp&quot;.\n\nIngaggiati dalla A&amp;M, i quattro pubblicano il loro omonimo disco d'esordio Supertramp (1970), promosso da un'esibizione presso il Revolution Club di Londra. La curiositÃƒÂ  suscitata dal gruppo, perÃƒÂ², si traduce presto in delusione: il loro para-prog-rock viene ritenuto troppo artigianale per competere con le produzioni del periodo. In realtÃƒÂ , a un ascolto piÃƒÂ¹ attento, il disco rivela giÃƒÂ  in nuce alcuni tratti caratteristici del loro sound migliore - la dolcezza (l'intro acustica di &quot;Surely&quot;), le tipiche ballate in falsetto di Hodgson, cantante dalla voce armoniosa qui ancora un po' in debito con Jon Anderson degli Yes (&quot;Home Again&quot;, &quot;Shadow Song&quot;), la predilezione di Davies per le jam blueseggianti (i dodici minuti di &quot;Try Again&quot;) - ma anche un'energica verve art-rock di stampo quasi psichedelico, che difficilmente si rivedrÃƒÂ  in seguito (&quot;Nothing To Show&quot;, &quot;It's A Long Road&quot;, &quot;Maybe I'm A Beggar&quot;). Le armonie e gli intrecci vocali, l'organo di Davies e la chitarra di Palmer fanno la parte del leone in un continuo interplay tra parti acustiche ed elettriche. Mai stampato in America e sempre ignorato dalle successive antologie, l'album resterÃƒÂ  una chicca per fan e cultori del gruppo.\nNello stesso anno la band, ingaggiato il sassofonista Dave Winthrop, suona al Festival dell'isola di Wight, uno dei raduni hippie-rock di culto dell'epoca. Ma la loro strada ÃƒÂ¨ ancora tutta in salita. La favola dei &quot;supervagabondi&quot; sembra sul punto di spegnersi, tormentata dagli insuccessi e dai continui abbandoni: dopo Palmer, che dÃƒÂ  forfait in seguito a un esaurimento nervoso, all'inizio del 1971 lascia anche Miller.\n\nPer il successivo album Indelibly Stamped (1971) subentrano Kevin Currie alla batteria e Frank Farrell al basso, mentre Hodgson passa alla chitarra, emergendo sempre piÃƒÂ¹ come l'altra &quot;mente&quot; della band. Abbandonata ogni velleitÃƒÂ  psichedelica, i Supertramp virano verso un jazz-pop-rock, con Davies che per la prima volta interpreta direttamente alcuni brani con la sua caratteristica voce ruvida da bluesman. La grinta rock dell'esordio lascia ancora qualche traccia (&quot;Remember&quot;, &quot;Potter&quot;), ma prevale soprattutto un mood malinconico (la nostalgia acustica di &quot;Travelled&quot;, ripescata tra i languori di Crosby, Stills &amp; Nash, la struggente love-song di &quot;Forever&quot;, la delicata &quot;Rosie Had Everything Planned&quot;, il numero anni 20 per piano e sax di &quot;Friend In Need&quot;).\nIl gusto per la jam, per l'ironia e il puro divertimento nel suonare comincia a farsi strada in brani come &quot;Coming Home To See You&quot; (dialogo tra due innamorati tradotto in pantomima per organo e armonica con tanto di trenino choo-choo mimato in conclusione), mentre Davies prova a mettere a fuoco il suo standard di ballata nella pianistica &quot;Times Have Changed&quot;. Il vero tour de force del disco, perÃƒÂ², ÃƒÂ¨ firmato Hodgson e si chiama &quot;Aries&quot;, una vorticosa piece acustica di oltre sette minuti che puÃƒÂ² rientrare a pieno titolo tra i classici del gruppo.\nNel complesso, un disco acerbo e zoppicante, ma con qualche impennata di classe pura.\nL'esito commerciale, perÃƒÂ², ÃƒÂ¨ ancora una volta deludente: l'album fa discutere soprattutto per la bizzarra copertina che ritrare un misterioso busto femminile nudo e tatuato. Ancor piÃƒÂ¹ disastrose saranno le esibizioni live. Esaurita la beneficenza ed estinto un debito di 60.000 sterline per strumenti e costi di registrazione, anche il munifico &quot;zio Sam&quot; prende cappello e se ne va. E' il preludio al primo big bang del gruppo: Davies e Hodgson restano malinconicamente soli, con tanti sogni in testa ma nulla piÃƒÂ¹\n\nResurrezione nella fattoria\n\nNei due anni successivi, perÃƒÂ², si compie l'incantesimo. SarÃƒÂ  merito di Ken Scott, ex produttore di David Bowie che scommette su di loro, sarÃƒÂ  merito dei giorni trascorsi in isolamento in una fattoria settecentesca del Somerset messa a loro disposizione dalla stessa A&amp;M, sarÃƒÂ  merito dei nuovi compagni d'avventura del duo fondatore, fatto sta che il quintetto risorto dalle ceneri dei Supertramp non ha piÃƒÂ¹ quasi niente a che vedere con la talentuosa ma insicura band dei primi due dischi. Entrano infatti in pianta stabile tre nuovi musicisti: il bassista Dougie Thompson, il batterista Bob Benberg e il sassofonista John Helliwell. E prende vita un sound magico, che sposa la grazia dei ritornelli pop alla maestositÃƒÂ  strumentale del progressive.\nE' il segreto di Crime Of The Century (1974), considerato da molti, e non a torto, il loro capolavoro.\nIntrodotto da una fanfara di fiati, il singolo &quot;Dreamer&quot; snocciola un ritornello allegro e appiccicoso, assecondato da quel piano elettrico WURLitzer destinato a divenire uno dei marchi di fabbrica del gruppo: sarÃƒÂ  il rompighiaccio nelle chart (l'album arriverÃƒÂ  al n. 4 in Gran Bretagna) insieme all'altro (e piÃƒÂ¹ banale) singolo estratto, la blueseggiante &quot;Bloody Well Right&quot;. Meglio di entrambi fa l'arguta ballata iniziale di &quot;School&quot;.\nMa il climax emotivo del disco ÃƒÂ¨ in un tris di suite ancora in qualche modo legate a un sentire &quot;progressive&quot;: &quot;Hide In Your Shell&quot;, stupenda ballata sentimentale di quasi sette minuti, incentrata su bruschi cambi di ritmo e su un dialogo in crescendo tra la voce struggente di Hodgson e la tastiera di Davies; &quot;Rudy&quot;, toccante meditazione sulla solitudine riscaldata dal piano luminoso e dalla voce sporca di Davies, ma anche da un chitarrismo quasi hard-rock (l'esperimento sarÃƒÂ  riproposto in &quot;Asylum&quot;); e infine la maestosa title track, con un bel riff di piano a far da prologo ai diversi pannelli sonori, prima del gran finale sinfonico con tripudio di tastiere e assolo di sax al fulmicotone.\nSorta di concept-album sui temi della follia, dell'alienazione e della paranoia, Crime Of The Century mette finalmente a fuoco la formula dei Supertramp: un singolare connubio tra certo heavy rock e r'n'b americano e la tradizione folk-pop inglese, rivisitati in chiave progressiva, attraverso l'approccio ritmico del piano e delle tastiere e i corposi fiati di John Helliwell, il cui sax assume sovente il ruolo che spetta alla chitarra solista nei gruppi rock. Al di lÃƒÂ  dei loro intrecci vocali e della doppia firma sui brani, Davies e Hodgson mettono in luce due differenti approcci musicali: il primo, patito di rock e rhyhthm and blues americano, predilige atmosfere rugginose e partiture piÃƒÂ¹ ostiche, il secondo, di formazione folk-pop, cesella i ritornelli piÃƒÂ¹ brillanti e le ballate piÃƒÂ¹ melodiche. Fatte le debite proporzioni, verrebbe da pensare a una riedizione del dualismo Lennon-McCartney.\n\nProprio lo spirito pop dei Beatles si annida tra i solchi di Crisis? What Crisis? (1975), insieme al rinnovato anelito blues di Davies, sublimato nella piece da musical di &quot;Ain't Nobody But Me&quot;. Si riduce, invece, il ricorso a stilemi progressive, con qualche piacevole eccezione, come nella romantica &quot;A Soapbox Opera&quot; che ammanta di arie barocche e arrangiamenti teatrali una melodia di razza (ancor piÃƒÂ¹ suggestiva sarÃƒÂ  la versione dal vivo eseguita nel live Paris); a metÃƒÂ  tra lieder leggero e operetta pop, il brano ÃƒÂ¨ un piccolo capolavoro di grazia e pathos. Ma il disco vive anche della luce riflessa di piccole gemme come &quot;Just A Normal Day&quot;, con i suoi arrangiamenti per archi e pianoforte in bilico tra Broadway e certe atmosfere da jazz-club degli anni 50, la multiforme &quot;Another's Man's Woman&quot;, in cui Hodgson si conferma anche sapiente chitarrista, la ballata agrodolce di &quot;Lady&quot; e l'acustica &quot;Two Of Us&quot;, saggio del songwriting delicato e intimista dello stesso Hodgson, menestrello hippie dal cuore tenero. La produzione di Scott contribuisce a forgiare un sound certosino ed elegante, anche se a tratti un po' lezioso.\n\nL'appeal melodico del disco frutta ai Supertramp un discreto successo di pubblico e una presenza assidua nei palinsesti delle radio Fm, spingendoli a tentare la sorte in America, dove i cinque si trasferiscono per incidere Even In The Quietest Moments. E' il 1977, e i Supertramp sono ormai fuori tempo massimo. La febbre punk sta giÃƒÂ  dilagando sulle due sponde dell'Oceano, di qua i Ramones, di lÃƒÂ  i Sex Pistols. Le suite sono ormai fuorilegge, perfino un assolo di chitarra viene visto con sospetto.\nQuasi ignari di tutto ciÃƒÂ², Davies e compagni proseguono per la loro strada e conversano placidamente di &quot;quietest moments&quot; mentre fuori c'ÃƒÂ¨ l'inferno. Non solo: arrivano addirittura a comporre una delle piÃƒÂ¹ lunghe ed epiche suite del loro repertorio, quella &quot;Fool's Overture&quot; di quasi 11 minuti che sarÃƒÂ  resa ancor piÃƒÂ¹ esplosiva nella versione live di Paris; il brano ha un andamento travolgente: dopo un avvio soffice, che richiama la &quot;Summer Soldier&quot; di Barclay James Harvest, ÃƒÂ¨ un estratto da un discorso di Winston Churchill (!) a introdurre il tema principale della tastiera prima che entri in scena la voce dolente di Hodgson, subito contrappuntata dal piano, quindi, l'apoteosi finale, con il coro e le tastiere che tornano a prendere il sopravvento. Ricorre uno degli espedienti tipici della band: l'idea di affidare inizialmente il ritornello al piano o alle tastiere, lasciando che la voce torni a intonarlo in un secondo momento, quando ÃƒÂ¨ giÃƒÂ  entrato nelle orecchie (e nel cuore) dell'ascoltatore.\nPer il resto, il disco continua a muoversi lungo le loro coordinate di sempre, ondeggiando tra delizie pop alla Hodgson (la tenerezza acustica del singolo &quot;Give A Little Bit&quot;, la melodia ossessiva di &quot;Babaji&quot;) e ballate blues-jazz alla Davies (l'avvolgente &quot;From Now On&quot;, la piÃƒÂ¹ contorta &quot;Downstream&quot;), con qualche reminiscenza bucolica dell'era hippie (la scampagnata della title track, con tanto di uccellini cinguettanti). Gli archi di Michel Colombier donano un tocco di struggimento in piÃƒÂ¹. Niente di particolare - si dirÃƒÂ  - ma tutto ÃƒÂ¨ dannatamente al suo posto: i Supertramp hanno ormai coniato una formula a prova di bomba, tanto emozionante negli episodi piÃƒÂ¹ &quot;freschi&quot;, quanto stucchevole in quelli piÃƒÂ¹ autoindulgenti. Possono vantare una pattuglia di fan che li segue con affetto e sembrano accontentarsene.\n\nAlla conquista dell'America\n\nOrmai insediatosi in California, il quintetto inglese attende due anni prima di far uscire il nuovo disco. C'ÃƒÂ¨ tempo per il declino del punk e per l'esplosione della new wave, per la fine del prog &quot;classico&quot; e per l'avvento del nuovo pop elettronico. Ma, come al solito, i Supetramp sono impermeabili all'avvicendarsi di mode e tendenze. Il nuovo album Breakfast in America (1979) dovrÃƒÂ  solo mettere a fuoco la scrittura &quot;pop&quot;, deponendo definitivamente l'ascia del progressive.\nPoco prima della pubblicazione del disco, Rick Davies scommette cento dollari con il batterista Bob Benberg sul fatto che negli Usa il disco non raggiungerÃƒÂ  le prime cinque posizioni: come puntare una fiche sul colore sbagliato dopo aver giocato tutte le altre sul numero vincente... L'album frantuma le classifiche, restando per sei settimane al n. 1 della top ten americana e, con diciotto milioni di copie vendute in tutto il mondo, si consacra uno dei piÃƒÂ¹ fortunati bestseller della storia del rock.\nLa triangolazione voce-tastiere-fiati gira a pieno ritmo, corroborata da arrangiamenti scintillanti e da una produzione tirata a lucido. I momenti sinfonici, piÃƒÂ¹ asciutti che in passato, sono sempre al servizio della resa melodica dei brani. Ma soprattutto i Supertramp hanno affinato la loro capacitÃƒÂ  di scrivere &quot;canzoni&quot; nel senso piÃƒÂ¹ semplice e nobile del termine. Questo ÃƒÂ¨ il loro album piÃƒÂ¹ beatlesiano e piÃƒÂ¹ classico; molti - anche tra i loro fan - continueranno a guardarlo con diffidenza, come una parziale abiura delle ambizioni sperimentali dei lavori precedenti (Crime Of The Century su tutti), come il disco che ha compromesso agli occhi del mondo il &quot;vero sound&quot; del gruppo. In realtÃƒÂ , da un'ottica ribaltata, Breakfast in America puÃƒÂ² essere letto come l'approdo finale della loro scienza del ritornello, della melodia, dell'armonia: il loro &quot;Pet Sounds&quot;.\n\nCome ogni album &quot;pop&quot; che si rispetti, c'ÃƒÂ¨ il singolo da ko, ovvero la hodgsoniana &quot;The Logical Song&quot;, che col suo ritmo bislacco (quasi &quot;disco&quot;) e le sue melodie struggenti cullerÃƒÂ  un'intera generazione. E' una canzone sul disincanto e sullo smarrimento (&quot;There are times when all the world's asleep/ the questions run too deep/ for such a simple man/ won't you please, please tell me what we've learned/ I know it sounds absurd/ but please tell me who I am&quot;), con una bella figura di piano elettrico ad accompagnare gli svolazzi del falsetto di Hodgson, in un tripudio di fischi e trilli di tastiere, prima del gran finale, con l'epico assolo jazz del sax di Helliwell. Un altro ritmo sghembo da circo, cadenzato dal piano e da un arrangiamento per armonica, chitarra, trombone e clarinetto, scandisce la marcia della title track, in cui Hogdson racconta il suo &quot;sogno americano&quot; (curiosamente, qualche hanno dopo dichiarerÃƒÂ  di aver sempre odiato il brano).\nL'America dei Supertramp ÃƒÂ¨ un eldorado tanto affascinante quanto illusorio, come testimonia anche la copertina: un fotomontaggio di Aaron Rapoport che mostra una rubiconda e sorridente cameriera in arancione sullo sfondo di una Manhattan dipinta in malinconiche tinte blu. E un senso di solitudine, se non di mestizia, pervade l'autobiografica &quot;Take The Long Way Home&quot;, ovvero l'altra faccia del successo: dopo le luci e l'adrenalina dello show, il ritorno a casa ha un sapore agro: &quot;When lonely days turn to lonely nights/ you take a trip to the city lights/ And take the long way home... Does it feel that you life's become a catastrophe?/ Oh, it has to be for you to grow, boy&quot;. Testo pessimista per musica apparentemente festosa (caratteristica ricorrente nei Supertramp): aperta e chiusa dagli umori country-blues dell'armonica, la traccia alterna fitti dialoghi strumentali (organo e chitarra che dettano il ritmo, piano e clarinetto che si inseriscono) e si libra nei cori in falsetto, sospinti da una robusta sezione d'archi. Apice di questa malinconia strisciante sono le vibrazioni quasi gospel di &quot;Lord Is It Mine&quot;, ballata pianistica di razza che sfoggia un delizioso assolo di sax e una coda lievemente increspata dalle figure di basso di Thomson.\nL'altro singolo &quot;Goodbye Stranger&quot; sfodera falsetti alla Bee Gees e la ripetizione di un ritornello accattivante e smielato al contempo, ma prende quota soprattutto in un vibrante assolo di chitarra. A funzionare sono anche tutti i brani &quot;di contorno&quot;, dall'iniziale e amara (nel testo) &quot;Gone Hollywood&quot;, che spalanca le finestre sulla metropoli al risveglio, alla ballata pensosa di &quot;Oh Darling&quot;, con l'ennesimo duetto Davies-Hodgson, fino al blues in sordina di &quot;Casual Conversation&quot; e al vigore rock di &quot;Just Another Nervous Wreck&quot;. Ma il vero colpo di teatro ÃƒÂ¨ in coda, con la suite profetica di &quot;Child Of Vision&quot;, che, a sorpresa, rispolvera la maestositÃƒÂ  strumentale di &quot;Crime Of The Century&quot;: tesa intro di piano, breve assolo di batteria, atmosfere post-prog, tastiere elettriche, intrecci vocali e un lungo assolo jazz al piano su cui s'insinua il sax di Helliwell.\n\nGli ex vagabondi di Zio Sam sono diventati improvvisamente delle star mondiali. L'ottimo doppio live Paris (1980) ne celebra i fasti e lo speciale feeling con quel pubblico francese che li ha sempre amati. La resa dal vivo di molti brani ÃƒÂ¨ talmente trascinante da riuscire a superare le esecuzioni in studio (&quot;School&quot;, &quot;Fool's Overture&quot;, &quot;Hide In Your Shell&quot;, &quot;A Soapbox Opera&quot;). E l'esuberanza rock del concerto parigino mostra sotto una luce nuova la musica di un gruppo che era stato spesso accusato di eccessiva leziositÃƒÂ . La parabola dei Supertramp ha toccato il suo definitivo apice.\n\nLe ultime parole famose\n\nL'attesissimo nuovo album in studio, infatti, delude in buona parte le attese. Anche la copertina di ...Famous Last Words... (1982) pare una profezia di sventura: una mano sta per tagliare la corda di un acrobata; quasi un'ammissione che il magico equilibrio compositivo del gruppo sta per essere spezzato. GiÃƒÂ  durante le session di Breakfast In America erano emersi i primi dissapori tra Davies e Hodgson. E il nuovo disco, registrato presso gli Unicorn Studios di proprietÃƒÂ  dello stesso Hodgson a Nevada City (California), non riesce a mascherare una tensione interna ormai latente.\nResta perÃƒÂ² una manciata di brani di classe, seppur sempre al di sotto dei loro vertici. Il singolo &quot;It's Raining Again&quot; tenta di rinverdire quell'impasto tra ritmo e melodia che aveva fatto la fortuna di &quot;The Logical Song&quot;: una stessa base armonica cadenzata dal piano accompagna strofa e refrain, con sporadici inserti di sax fino al coro finale di bimbi in festa. Meglio ancora fa &quot;My Kind Of Lady&quot;, lentone da mattonella stile anni 50, con tanto di coretti e assolo sax finale. Non manca la classica canzone esile e intimista alla Hodgson, la dolce &quot;Know Who You Are&quot;, calibrata sulle corde della chitarra. E la piÃƒÂ¹ vigorosa &quot;C'Est La Bonne&quot; ÃƒÂ¨ un'altra ballata di buon mestiere. Il resto dell'album, perÃƒÂ², si perde in un vano inseguimento del ritornello catchy e in un revival bluesy discretamente soporifero.\n\nE' il preludio alla fine dei &quot;veri&quot; Supertramp. Insoddisfatto della svolta blues propugnata da Davies, Roger Hodgson, l'inconfondibile voce e anima melodica della band, decide di lasciare i compagni, tentando un'avventura solista che si rivelerÃƒÂ  tanto sincera quanto sfortunata. Nel disco d'esordio In The Eye Of The Storm (1984), Hodgson fa praticamente tutto da solo: scrive, interpreta, suona, arrangia e produce sette brani, con discreti risultati. Il retaggio prog si avverte soprattutto nella durata dei brani, cinque dei quali superano i sei minuti, mentre per il resto Hodgson si conferma un buon autore di pop melodico, confezionando un singolo brillante come &quot;Had A Dream (Sleeping With the Enemy)&quot;, col suo elegante dialogo piano-chitarra su un cantato aggressivo, e tracce accattivanti come l'ossessivo shuffle di &quot;In Jeopardy&quot;, la soffice ballata di &quot;Lovers In The Wind&quot;, finemente arrangiata e interpretata, l'esuberante ode di &quot;Give Me Love, Give Me Life&quot; e lo strumentale ÃƒÂ -la Pink Floyd di &quot;Only Because Of You&quot;.\nIl successivo Hai Hai (1987) segna la definitiva rottura col passato: con l'aiuto di sessionmen d'eccezione, come Jeff Porcaro, batterista dei Toto, Hodgson s'imbarca in un maldestro tentativo di assemblare i generi piÃƒÂ¹ in voga nel decennio, dal synth-pop alla dance passando per il reggae. Ne scaturisce un confuso bricolage di suoni senz'anima: puntando tutte le carte sulla tecnologia e su una produzione pesantemente electro, Hodgson cerca di riscattare l'inaridimento della sua vena melodica e l'imbarazzante povertÃƒÂ  di testi come quelli di &quot;Who's Afraid&quot; o &quot;My Magazine&quot;. Qualche colpo di coda del menestrello di &quot;The Logical Song&quot; non manca (&quot;London&quot;, &quot;You Make Me Love You&quot;), ma la vetta del disco resta quella &quot;Land Ho&quot; giÃƒÂ  scritta insieme a Davies nel 1974 e dal tipico sapore-Supertramp.\nSuccessivamente, Hodgson si frattura entrambe le braccia in seguito a una caduta e resta fermo per diversi anni. Dagli anni 90 giungono soltanto sparuti segnali di vita: la scrittura di qualche brano per l'album &quot;Talk&quot; degli Yes (1994) e un disco solista dal vivo, Rites Of Passage, che vede la partecipazione anche del figlio Andrew. Nel 2000 il ritorno a un nuovo album in studio, Open the Door, in collaborazione col musicista bretone Alan Simon. Il disco ÃƒÂ¨ influenzato da atmosfere francesi (viene registrato Les Sorinieres) e improntato a un folk-pop acustico che risente del revival &quot;ethno&quot; in corso (la strumentazione spazia dal celebre piano elettrico WURLitzer al liuto, dall'arpicordo all'organo, dal piffero irlandese al banjo e alle voci bulgare). Nonostante qualche momento di buona intensitÃƒÂ  (la ballata celtica di &quot;Along Came Mary&quot;, la toccante &quot;The Garden&quot; e la melodiosa &quot;The More I Look&quot;, composta assieme a Trevor Rabin degli Yes), il disco passerÃƒÂ  inosservato: Roger Hodgson ÃƒÂ¨ ormai fuori moda, come la musica del suo ex-gruppo.\n\nSe la storia dei Supertramp &quot;veri&quot; era finita nel 1982 con ...Famous Last Words..., quella dei superstiti, tenacemente capeggiati da Rick Davies, proseguirÃƒÂ  nell'ombra per quasi vent'anni, senza mai risalire la china di un declino inesorabile. Brother Where You Bound (1985), con l'insulso singolo &quot;Cannonball&quot;, e Free As A Bird (1987), con il mezzo hit disco (!) di &quot;I'm Begging You&quot;, sono due album terribilmente noiosi. Quest'ultimo non arriva neanche al n.100 delle classifiche in America (ma stavolta Davies non doveva aver fatto scommesse...). Orfano delle melodie e dell'ugola squillante di Hodgson, il sound del gruppo s'impantana in un blues-jazz-pop di maniera, del tutto incapace di partorire &quot;canzoni&quot; degne di questo nome e reso ancor piÃƒÂ¹ anonimo dal canto, ormai del tutto monocorde, di Davies. L'insuccesso di Live 88 non fa altro che sottolineare il declino di una band senza ormai piÃƒÂ¹ niente da dire.\n\nMa Rick Davies ÃƒÂ¨ testardo come un mulo e non vuole arrendersi all'evidenza. CosÃƒÂ¬ nel 1997 ricontatta John Helliwell, strappandolo al college musicale cui si era iscritto, e Mark Hart (ex Crowded House), con cui aveva giÃƒÂ  collaborato in passato, facendo uscire a nome Supertramp l'ennesimo album insipido, quel Some Things Never Change che nei contenuti tradisce fatalmente l'illusione del titolo: le cose sono cambiate, e forse per sempre. Poi arriva anche l'elogio della lentezza di Slow Motion (2002), che tenta di sedimentare un sound &quot;classico&quot; alla Steely Dan (la jam blueseggiante di &quot;Dead Man's Blues&quot;), con qualche concessione al romanticismo del tempo che fu (&quot;Over You&quot;). Ma l'incantesimo si ÃƒÂ¨ ormai spezzato. Anche perchÃƒÂ© nel frattempo i Supertramp sono diventati un gruppo para-progressive per i piÃƒÂ¹ vecchi, un nostalgico souvenir delle feste delle medie per la generazione di mezzo, una reliquia muffosa per i piÃƒÂ¹ giovani...\n\n:::&gt;Discografia&lt;:::\n\n    * Supertramp (1970)\n    * Indelibly Stamped (1971)\n    * Crime of the century (1974)\n    * Crisis? What crisis? (1975)\n    * Even in the Quietest Moments... (1977)\n    * Breakfast in America (1979)\n    * Paris (1980, live)\n    * ...Famous Last Words... (1982)\n    * Brother Where You Bound (1985)\n    * The Autobiography of Supertramp (1986)\n    * Free As a Bird (1987)\n    * Live '88 (1988, live)\n    * Some Things Never Change (1997)\n    * It Was The Best Of Times (1999, live)\n    * Is Everybody Listening? (2001, live) - bootleg of 1975 concert also known as Dreamers\n    * Slow Motion (2002)\n    * Retrospectacle - The Supertramp Anthology (2005)\nIn rosso i titoli presenti in questa raccolta\n\n:::&gt;Note&lt;:::\n\nIn seed con 10/20KB 24 ore su 24\n\n Visit this link: http://img201.Imageshack.us/img201/5468/continuailseendingtq80alz1.gif\n\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:88d9c3c4741013bd9901a1a5939b35343a02063c","amp;dn":"Supertramp+-+Discografia+%281970-1985%29+%5BLossy+Mp3+256Kb%5D+Pop+Rock+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88d9c3c4741013bd9901a1a5939b35343a02063c","infoHashBuffer":{"type":"Buffer","data":[136,217,195,196,116,16,19,189,153,1,161,165,147,155,53,52,58,2,6,60]},"announce":[],"urlList":[]}}