{"title":"The Defection of Simas Kudirka (1978) (VHS Rip)","uid":5663387,"size":2328117248,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8925fc0e5aa9a4ca4b7fc05991f48bf464ae33ae&amp;dn=The+Defection+of+Simas+Kudirka+%281978%29+%28VHS+Rip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Clerknova","files":7,"time":1278048607,"description":"*********************************************************\n\n*   EXTREMELY RARE - PLEASE HELP SHARE - KEEP SEEDING   *\n\n*********************************************************\n\n\nThe Defection of Simas Kudirka is a 1978 television movie based on actual events, featuring Alan Arkin as Simas Kudirka, a Lithuanian merchant seaman in Soviet-era 1970 who attempts to defect to the United States by jumping onto a U.S. Coast Guard cutter. Among the movie's awards are two Emmys and another three Emmy nominations. The movie was directed by David Lowell Rich.\n\nPLOT\n\nBased on the true story of the attempted defection in 1970 by a Lithuanian seaman seeking political asylum in the United States. Kudirka was denied asylum and returned to the Soviets, charged with treason, and sentenced to ten years of hard labor. It was later discovered and verified that his mother had been born in Brooklyn and gone to Lithuania at a young age, which meant she was a U. S. citizen. As a result, Kudirka was declared a U. S. citizen and in 1974 released by the Soviets.\n \nThe movie revolves around real-life Lithuanian seaman Simas Kudirka, a radio operator on a Soviet fish processing vessel. When his ship meets at sea with a U.S. Coast Guard cutter near Martha's Vineyard in early 1970, Kudirka makes a dramatic leap from the deck, landing on the USCGC Vigilant. He announces that he wishes to defect, but confusion over U.S. policy on defections prevent the Americans from offering him asylum. As the crew of the Vigilant looks on helplessly, Soviet officers are allowed to board the cutter, beat and bind Kudirka, and drag him back to his own ship. This tinderbox political incident occurs during a Soviet/U.S. conference over fishing rights. The ultimate fate of Simas Kudirka provides the core of the script.\n\nCAST\n\nAlan Arkin as Simas Kudirka \nRichard Jordan as Commander Edward Devon \nDonald Pleasence as Vladimir Popov \nGeorge Dzundza as Gruzauskas \nNicholas Guest as Baltrunar \nShirley Knight as Genna Kudirka \nJohn McMartin as Phillip Chadway \nTed Shackelford as Blain \n\nPRODUCTION\n\nThe movie was filmed in Portsmouth, NH, the Portsmouth Naval Shipyard in Kittery, Maine, and off the coast of New Hampshire and southern Maine. The final scene shows Simas Kudirka (Arkin) and his wife Genna (Shirley Knight) reviewing the crew of the Coast Guard Cutter Vigilant, the ship onto which Kudirka jumped. The actual ship shown in the movie was the USCGC Decisive at its home port of New Castle, NH.\n\nAWARDS\n\nIn 1978, the movie won two Emmy's and was nominated for another three.\n\nWinners were:\n\nOutstanding Directing in a Special Program - Drama or Comedy: Director David Lowell Rich \n\nOutstanding Film Editing for a Special: John A. Martinelli \n\nThe nominated categories and nominees were:\n\nOutstanding Achievement in Music Composition for a Special (Dramatic Underscore): David Shire \n\nOutstanding Performance by a Supporting Actor in a Comedy or Drama Special: Donald Pleasence \n\nOutstanding Writing in a Special Program - Drama or Comedy - Original Teleplay: Bruce Feldman \n\nIn 1979, the movie won an &quot;Eddie&quot; from the American Cinema Editors, USA, for Best Edited Television Special, awarded to John A. Martinelli.\n\nHOME VIDEO\n\nThe movie has not been released on any home video format.\n\n\n*********************************************************\n\n*   EXTREMELY RARE - PLEASE HELP SHARE - KEEP SEEDING   *\n\n*********************************************************\n\n","torrent":{"xt":"urn:btih:8925fc0e5aa9a4ca4b7fc05991f48bf464ae33ae","amp;dn":"The+Defection+of+Simas+Kudirka+%281978%29+%28VHS+Rip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8925fc0e5aa9a4ca4b7fc05991f48bf464ae33ae","infoHashBuffer":{"type":"Buffer","data":[137,37,252,14,90,169,164,202,75,127,192,89,145,244,139,244,100,174,51,174]},"announce":[],"urlList":[]}}