{"title":"Hearts.and.Minds.(1974).Won.Oscar.for.Best.Documentary","uid":3391643,"size":748199936,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:89da41dc87dd17b9bdb61be9b141a539dd0b4d4d&amp;dn=Hearts.and.Minds.%281974%29.Won.Oscar.for.Best.Documentary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"smartypants","files":1,"time":1128355241,"description":"This is the most objective movie about the Vietnam war I've ever seen. It won the oscar for best documentary in 1974, it's quite a catch. It's also interesting to notice the parallels between the Vietnam war and the ongoing Irak War. \n\nBest Regards\n-smartypants-\n\nHer's some imdb.com info:\n^^^^^^^^^^^^^^^^^^^^^^^^^\n\nDirected by\nPeter Davis\n\nGenre: Documentary (more)\n\nPlot Outline: A documentary of the conflicting attitudes of the opponents of the Vietnam war. (more)\n\nUser Comments: Vietnam as a war of aggression and Ne-colonialism (more)\n\nUser Rating: *********_ 8.6/10 (453 votes) Vote Here\n\n\n\nUser comment:\n^^^^^^^^^^^^^\n\nVietnam as a war of aggression and Ne-colonialism, 10 April 2005\n10/10\nAuthor: fellini8 from United States\n\nThe only fully honest movie or documentary I've seen on the Vietnam War. Several movies show the suffering of U.S. soldiers who fought or were wounded in Vietnam, or readily admit that the war effort was flawed - e.g., former Secretary of Defense Bob McNamara in &quot;The Fog of War.&quot; But none that I know of tell us what was really behind the war and how it divided the country between the jingoist or conformist hawks and the people of conscience who could not support such a bloody Ne-colonial war of aggression - &quot;aggression,&quot; not an honest &quot;mistake&quot; that our media portray.\n\nIt showed the Vietnamese people in their humanity, patriotism, and incredible courage in the face of crucifixion by an utterly awesome U.S. war machine. Unfortunately, the documentary's message got lost or was never seen by millions of Americans who are still in denial about what Vietnam stood for - a denial that permits the kind of character assassination by the &quot;swiftboat veterans&quot; that may have cost John Kerry the election in 2004.","torrent":{"xt":"urn:btih:89da41dc87dd17b9bdb61be9b141a539dd0b4d4d","amp;dn":"Hearts.and.Minds.%281974%29.Won.Oscar.for.Best.Documentary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89da41dc87dd17b9bdb61be9b141a539dd0b4d4d","infoHashBuffer":{"type":"Buffer","data":[137,218,65,220,135,221,23,185,189,182,27,233,177,65,165,57,221,11,77,77]},"announce":[],"urlList":[]}}