{"title":"The Long Shadow by Dynolds - GHOST DOG","uid":11147929,"size":10021954,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8b64bd334c418e87e6f613d5416c7ca558f4c36f&amp;dn=The+Long+Shadow+by+Dynolds+-+GHOST+DOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"marxph","files":4,"time":1412286858,"description":"In Britain we have lost touch with the Great War. Our overriding sense now is of a meaningless, futile bloodbath in the mud of Flanders -- of young men whose lives were cut off in their prime for no evident purpose. But by reducing the conflict to personal tragedies, however moving, we have lost the big picture: the history has been distilled into poetry. In The Long Shadow, critically acclaimed author David Reynolds seeks to redress the balance by exploring the true impact of 1914-18 on the 20th century. Some of the Great War's legacies were negative and pernicious but others proved transformative in a positive sense. Exploring big themes such as democracy and empire, nationalism and capitalism and re-examining the differing impacts of the War on Britain, Ireland and the United States, The Long Shadow throws light on the whole of the last century and demonstrates that 1914-18 is a conflict that Britain, more than any other nation, is still struggling to comprehend. Stunningly broad in its historical perspective, The Long Shadow is a magisterial and seismic re-presentation of the Great War.\n\n\nghost dog...","torrent":{"xt":"urn:btih:8b64bd334c418e87e6f613d5416c7ca558f4c36f","amp;dn":"The+Long+Shadow+by+Dynolds+-+GHOST+DOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b64bd334c418e87e6f613d5416c7ca558f4c36f","infoHashBuffer":{"type":"Buffer","data":[139,100,189,51,76,65,142,135,230,246,19,213,65,108,124,165,88,244,195,111]},"announce":[],"urlList":[]}}