{"title":"Silicon Devices and Process Integration","uid":15525786,"size":15411385,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8beb57edddba36b32d210eb987ad90a4bfebcfe2&amp;dn=Silicon+Devices+and+Process+Integration&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1470783299,"description":"Silicon Devices and Process Integration - Deep Submicron and Nano-Scale Technologies - Badih El-Kareh (Springer, 2009).pdf\r\n\r\nSilicon Devices and Process Integration covers state-of-the-art silicon devices, their characteristics, and their interactions with process parameters. It serves as a comprehensive guide which addresses both the theoretical and practical aspects of modern silicon devices and the relationship between their electrical properties and processing conditions. The book is compiled from the author’s industrial and academic lecture notes and reflects years of experience in the development of silicon devices.\r\n\r\nFeatures include:\r\n\r\nA review of silicon properties which provides a foundation for understanding the device properties discussion, including mobility-enhancement by straining silicon;\r\nState-of-the-art technologies on high-K gate dielectrics, low-K dielectrics, Cu interconnects, and SiGe BiCMOS;\r\nCMOS-only applications, such as subthreshold current and parasitic latch-up;\r\nAdvanced Enabling processes and process integration.\r\nThis book is written for engineers and scientists in semiconductor research, development and manufacturing. The problems at the end of each chapter and the numerous charts, figures and tables also make it appropriate for use as a text in graduate and advanced undergraduate courses in electrical engineering and materials science","torrent":{"xt":"urn:btih:8beb57edddba36b32d210eb987ad90a4bfebcfe2","amp;dn":"Silicon+Devices+and+Process+Integration","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8beb57edddba36b32d210eb987ad90a4bfebcfe2","infoHashBuffer":{"type":"Buffer","data":[139,235,87,237,221,186,54,179,45,33,14,185,135,173,144,164,191,235,207,226]},"announce":[],"urlList":[]}}