{"title":"Oloneo PhotoEngine (Portable)","uid":9133470,"size":30636032,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8c3fb6517948e9dff8972e9f407804d758f747db&amp;dn=Oloneo+PhotoEngine+%28Portable%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TehForkinator","files":-1,"time":1383367341,"description":"HDR and Raw photo processing software by Oloneo, the reference in superior High Dynamics Range and digital photography.\n \nOloneo PhotoEngine and Oloneo HDRengine are the only application to offer digital photographers full control over light and exposure in real-time, as if they were still behind the lens.\n \nAt the core of Oloneo PhotoEngine and Oloneo HDRengine is a fully real-time, 32-bit floating-point per channel (96-bit per pixel), High Dynamic Range (HDR), ultra-wide gamut, full resolution and non-destructive image-editing engine. Oloneo's color model handles a range of colors that largely surpasses what printers or screens are capable of displaying today. Combined with the suppression of any color shifting and clipping, it guarantees photographers against any loss of image data during the HDR process.\n \nWith the addition of a simple, intuitive and responsive user interface, image controls that work in full real-time at a rate of 1/20 second or less on a general-purpose desktop or laptop computer, Oloneo PhotoEngine and Oloneo HDRengine offer the best possible HDR and Raw image processing workflow to the professional, amateur and novice digital photographers.\n \nOloneo PhotoEngine also comes with a Lightroom plug-in and direct export to other image processing applications such as Photoshop for a professional workflow.\n \nOloneo PhotoEngine and Oloneo HDRengine have already proved to be the best tools for most photography specialties including real estate, studio and catalog, panorama, architecture, interior, landscape and advertising to name a few.","torrent":{"xt":"urn:btih:8c3fb6517948e9dff8972e9f407804d758f747db","amp;dn":"Oloneo+PhotoEngine+%28Portable%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c3fb6517948e9dff8972e9f407804d758f747db","infoHashBuffer":{"type":"Buffer","data":[140,63,182,81,121,72,233,223,248,151,46,159,64,120,4,215,88,247,71,219]},"announce":[],"urlList":[]}}