{"title":"Dave Brubeck &amp; Paul Desmond - 1975: The Duets (FLAC)","uid":6913178,"size":198313640,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8c414625093a90fabff1525076111d463f343c26&amp;dn=Dave+Brubeck+%26amp%3B+Paul+Desmond+-+1975%3A+The+Duets+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiddler222","files":13,"time":1324923848,"description":"\n\nRecorded 1975. \n\nReview by Ken Dryden (AMG):\nAlthough Dave Brubeck and Paul Desmond made many rewarding recordings together, this was their only duo album; it was inspired by several duo performances on board a cruise ship. Their magical ESP is evident from start to finish. Brubeck's lyricism throughout these sessions will surprise critics who label him as &quot;bombastic,&quot; while Desmond, known for his pure dry-toned alto sax, throws a few curves to his longtime fans. The loping waltz treatment of &quot;Alice in Wonderland&quot; and a delicate interpretation of the Mexican folk song &quot;The Blue Dove&quot; contrast with their abstract approach to &quot;Stardust.&quot; The especially adventurous introduction to Brubeck's oriental blues &quot;Koto Song&quot; opens with Desmond providing percussion by tapping on his instrument's keys without blowing; the piece then slowly evolves from random-sounding fragments into its haunting theme. Their return visit to &quot;Balcony Rock,&quot; a collaborative effort from the 1950s, is an absolutely buoyant miniature. Brubeck performs his &quot;Summer Song&quot; alone in a mood of celebration, unlike the wistful flavor of his first recording of it with Louis Armstrong. The audio source for &quot;You Go to My Head&quot; is a BBC videotape made during the concert which inspired the making of this album, but the memorable interaction between the two musicians during this performance should be considered one of the high points of their respective careers. This 2002 CD reissue improves upon the wretched sound of the original LP (caused by use of recycled vinyl) and an earlier CD which omitted Desmond's liner notes and most of the photos. This limited-edition disc is beautifully packaged in a mini-LP gatefold cover with a soft cloth sleeve for the disc. This is an essential acquisition for fans of Dave Brubeck and Paul Desmond. \n\n01. Alice In Wonderland    \n02. These Foolish Things   \n03. Blue Dove   \n04. Stardust    \n05. Koto Song   \n06. Balcony Rock \n07. Summer Song  \n08. You Go To My Head\n\n","torrent":{"xt":"urn:btih:8c414625093a90fabff1525076111d463f343c26","amp;dn":"Dave+Brubeck+%26amp%3B+Paul+Desmond+-+1975%3A+The+Duets+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c414625093a90fabff1525076111d463f343c26","infoHashBuffer":{"type":"Buffer","data":[140,65,70,37,9,58,144,250,191,241,82,80,118,17,29,70,63,52,60,38]},"announce":[],"urlList":[]}}