{"title":"Piers Compton - The Broken Cross - The Hidden Hand in the Vatica","uid":3846807,"size":704481,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8c51fa7c06ce3955bb902bd7a61e6c6ce3b8d751&amp;dn=Piers+Compton+-+The+Broken+Cross+-+The+Hidden+Hand+in+the+Vatica&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"undeceived","files":1,"time":1192696394,"description":"Is the Pope a Catholic? \nHenry Makow Ph.D.\n\nOn New Years Day 2004 Pope John Paul II called for a &quot;new world order... based on the goals of the United Nations.&quot; http://edition.cnn.com/2004/WORLD/europe/01/01/pope.ny.ap/ \n\nWhen a world leader uses this terminology, it can only mean one thing. He is a part of the Luciferian conspiracy to create a totalitarian world government. \n\nAccording to Piers Compton, a former Catholic priest, the Papacy was actually subverted by the Illuminati in 1958 when John XXIII became Pope. This was the culmination of a 200-year campaign to infiltrate and destroy the Catholic Church. \nPiers Compton was the Literary Editor of the Catholic Weekly &quot;The Universe&quot; for 14 years. He documents his claims in &quot;The Broken Cross,&quot; (1981) a book that is almost impossible to find because it was mysteriously withdrawn a few weeks after its release. \n\nCompton traces the modern phase of the Luciferian Conspiracy to Adam Weishaupt who established the Illuminati on May 1, 1776. \n\n&quot;[Weishhaupt] was backed financially, as are most if not all anarchistic leaders, by a group of bankers under the House of Rothschild. It was under their direction that the long range and worldwide plans of the Illuminati were drawn up.&quot; (8) \n\nIn 1783, the Illuminati assumed control of much of Freemasonry, which secretly coordinated the revolutionary movement (Liberalism, Socialism, and Communism.) According to David Bay, &quot;secret societies like the &quot;Skull and Bones&quot; have always functioned as Satan&amp;#039;s church, as the only way to pass the baton from generation to generation.&quot; www.cuttingedge.org/ce1089.html \n\nThe Illuminati regarded the Catholic Church as their chief obstacle and marked it for ruin. In 1818, their Italian lodge issued a set of &quot;Permanent Instructions&quot; that included: &quot;We require a Pope for ourselves...to march more securely to the storming of the church....&quot; The goal was &quot;the complete annihilation of the Catholicism and even ultimately of Christianity. If Christianity were to revive, even upon the ruins of Rome, it would, a little late revive and live.&quot; (13-14) \n\nPope Leo XIII\n\nIn an Encyclical Dec. 8, 1892 Pope Leo XIII identified two Kingdoms. &quot;The one is the kingdom of God on earth, namely, the true Church of Jesus Christ; and those who desire from their heart to be united with it...The other is the kingdom of Satan...those who refuse to obey the divine and eternal law, and who have many aims of their own in contempt of God, and many aims also against God.&quot; \n\nThroughout history they have been in conflict. \n\n&quot;At this period, however, the partisans of evil seems to be combining together, and to be struggling with united vehemence, led on or assisted by that strongly organized and widespread association called the Freemasons. No longer making any secret of their purposes, they are now boldly rising up against God Himself.&quot; http://papal-library.saint-mike.org/LeoXIII/Encyclicals/Custodi_Di_Quella_Fede.html \n\nIronically, when Leo XIII died in 1903, a Freemason, Cardinal Mariano Rampolla, was almost elected Pope. Emperor Franz Joseph of Austria vetoed his appointment in the last moment. . \n\nThe Illuminists had to wait another 55 years to gain control of the Papacy. When Pope Pius XII died in 1958, a Freemason Cardinal Angello Roncalli, became Pope John XXIII. \n\nPredictably, his first act was to begin to remove the element of Divine Revelation from Catholic teaching, and to embrace naturalism, materialism and Communism. These steps were taken at the Ecumenical Council in 1962 and Vatican Two in 1965. \n\nAs a result, Malachi Martin, a former Jesuit, predicted the Roman Catholic Church would no longer be recognizable by the year 2000. &quot;There will be no centralized, control, no uniformity in teaching, no universality in practice and worship, prayer, sacrifice and priesthood.&quot; (63) \n\nPope Paul VI\n\nCardinal Giovanni Montini, who succeeded John XXIII as Pope Paul VI in 1963, was also a Freemason and socialist. (In 1944 Pope Pius XII had dismissed him as Vatican Secretary of State for conducting secret negotiations with the Communists.)(53) \n\nPaul VI revealed his true colors in a speech to the United Nations in 1965: &quot;It is your task here to proclaim the basic rights and duties of Man.You are the interpreters of all that is permanent in human wisdom; we could almost say of its sacred character.&quot; (67) \n\nThis repudiation of the church&amp;#039;s spiritual authority was symbolized by giving the Papal Ring and his Pectoral Cross to Secretary General U Thant who sold them at an auction. (71) \n\nThe United Nations was set up on land donated by the Rockefellers as a front for the elite&amp;#039;s Luciferian dictatorship. Its Charter was based on the Constitution of Soviet Russia and its leaders were Communists. It&amp;#039;s Chapel is dedicated to paganism and run by the Lucis Trust (formerly Lucifer Trust) which also handles all its publications. \n\nThe Broken Cross\n\nPaul VI also embraced a sinister symbol used by Satanists in the Sixth Century, which had been revived by Vatican Two. \n\nThis was a bent or broken cross on which was displayed a repulsive and distorted figure of Christ. Black magicians and sorcerers in the Middle Ages had used it for occult purposes. It represented the &quot;Mark of the Beast.&quot;\n","torrent":{"xt":"urn:btih:8c51fa7c06ce3955bb902bd7a61e6c6ce3b8d751","amp;dn":"Piers+Compton+-+The+Broken+Cross+-+The+Hidden+Hand+in+the+Vatica","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c51fa7c06ce3955bb902bd7a61e6c6ce3b8d751","infoHashBuffer":{"type":"Buffer","data":[140,81,250,124,6,206,57,85,187,144,43,215,166,30,108,108,227,184,215,81]},"announce":[],"urlList":[]}}