{"title":"Fallout New Vegas Gun Runners Arsenal DLC","uid":6710688,"size":52922717,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8ce80fcc9b3f0b6021a1943d3d699ccbdb75ad05&amp;dn=Fallout+New+Vegas+Gun+Runners+Arsenal+DLC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"marco699","files":-1,"time":1317342844,"description":"English version:\n\nABOUT: \n\nThe famous weapons manufacturer, Gun Runners, has opened up their exclusive cache of armaments, including new weapons, weapon mods, ammo types and recipes. Their inventory doesn?t come without a price, though. Trek far and wide throughout the Mojave Wasteland in search of this elite class of weapons that range from the outrageously potent to the bizarrely impractical.\n\nINCLUDES:\n\nNew Weapons and Weapon Mods:\n\nIt's time to free up some of that inventory weight. Waiting to be uncovered in the Mojave Wasteland is a plethora of new unique weapons such as the Bozar, an all-powerful 5.56mm Light Machine Gun, the Smitty Special, an overwhelming variant of the Plasma Caster,, the MFC Cluster mine, the Esther, a unique Mini Nuke Launcher, and the ridiculous Nuka Breaker ? a new melee weapon made from a Nuka-Cola neon sign. If the 27 new weapons aren?t enough, upgrade your existing weapons with 40 new weapon modifications.\n\nNew Ammo Types and Recipes:\n\nTry out 18 new recipes and 29 new ammo types such as 12 Ga. Dragon?s Breath, Hive Missiles and 25mm/40mm Plasma Grenades, all of which make choosing diplomacy a less appealing option.\n\nNew Challenges: Over twenty new challenges await the most diligent of completionists. \n\nIf you thought that you?ve done and seen everything New Vegas has to offer, think again!\n\nINSTALLATION:\n\nExtract the files to your &quot;New Vegas/Data&quot; folder. Open the New Vegas launcher and select the .esm file for this pack under data files. It should add these items to any existing character as well as any newly created character.\n","torrent":{"xt":"urn:btih:8ce80fcc9b3f0b6021a1943d3d699ccbdb75ad05","amp;dn":"Fallout+New+Vegas+Gun+Runners+Arsenal+DLC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ce80fcc9b3f0b6021a1943d3d699ccbdb75ad05","infoHashBuffer":{"type":"Buffer","data":[140,232,15,204,155,63,11,96,33,161,148,61,61,105,156,203,219,117,173,5]},"announce":[],"urlList":[]}}