{"title":"Vegetables, Whole Grains, and Their Derivatives in Cancer Preven","uid":6509466,"size":2028413,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8dfa2e0a030e4e565597e94a3626d206833302ad&amp;dn=Vegetables%2C+Whole+Grains%2C+and+Their+Derivatives+in+Cancer+Preven&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1309562076,"description":"Marja Mutanen, Anne-Maria Pajari, &quot;Vegetables, Whole Grains, and Their Derivatives in Cancer Prevention&quot;\nS rin er | ISBN: 9048197996 | 2010-12-17 | PDF | 250 pages | 2,3 MB\n\nVegetables, Whole Grains and their Derivatives in Cancer Prevention looks in detail at the evidence regarding the effects and mechanisms of action of potentially cancer-preventive components and their sources from plant kingdom. The book covers current knowledge on certain foods and their constituents in cancer prevention, such as cruciferous and green leafy vegetables, nuts and seeds, whole grains, tomato lycopene and carotenoids, alliums and their sulphur and selenium constituents, and capsaicinoids from chilli peppers. It focuses not only on single compounds but aims to widen the view by discussing a whole-diet approach in cancer prevention.\n\nA single component may lose its chemopreventive efficacy when isolated from the food matrix and in many cases isolated and concentrated components as supplements may actually induce tumor development. Apart from describing the effects and mechanisms of action, the chapters also contain information on intake, bioavailability, metabolism and possible toxic effects of foods and components presented. Evaluation and comparison of the data from mechanistic studies in vitro with those from animal experiments in vivo form a basis for applying the current knowledge to human nutrition in the field of carcinogenesis. With contributions from leading experts in the field, this book is an invaluable resource for scientists and professionals working in cancer research, as well as individuals involved in food and nutrition.","torrent":{"xt":"urn:btih:8dfa2e0a030e4e565597e94a3626d206833302ad","amp;dn":"Vegetables%2C+Whole+Grains%2C+and+Their+Derivatives+in+Cancer+Preven","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dfa2e0a030e4e565597e94a3626d206833302ad","infoHashBuffer":{"type":"Buffer","data":[141,250,46,10,3,14,78,86,85,151,233,74,54,38,210,6,131,51,2,173]},"announce":[],"urlList":[]}}