{"title":"INXS - X (2011 Remastered) (FLAC-EAC)","uid":6523551,"size":337100665,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:90bbb40f61247d5abf968d5d739cf1c533094fac&amp;dn=INXS+-+X+%282011+Remastered%29+%28FLAC-EAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1310078734,"description":"INXS: Biography\n\nINXS hailed from the pubs of Australia, which is part of the reason the band never comfortably fit in\nwith new wave. Even when they branched out into synth pop on their early recordings, they were\nunderpinned by a hard, Stonesy beat and lead singer Michael Hutchence's Jagger-esque strut.\nUltimately, these were the very things that made INXS into international superstars in the late '80s.\nBy that time, the group had harnessed its hard rock, dance, and new wave influences into a sleek,\nstylish groove that made its 1987 album, Kick, a multi-million-selling hit. While that sound was their\nkey to stardom, it also proved to be their undoing; INXS became boxed in by their Stonesy pop-funk\nin the early '90s, when their audience became entranced by harder-edged alternative rock. In spite\nof declining sales, they soldiered on, continuing to tour and record for a dedicated fan base until\nHutchence's 1997 death brought the band's heyday to a close.\n\nAppropriately for a band that featured three brothers, INXS had their roots in a family act, the\nFarriss Brothers. The group came together while keyboardist Andrew Farriss, the middle brother,\nwas attending high school with vocalist Michael Hutchence. The two formed a band with bassist\nGary Beers. Simultaneously, guitarist Tim Farriss was playing in various groups with his friend,\nguitarist/saxophonist Kirk Pengilly. Eventually, the two groups merged in 1977, with Jon Farriss\njoining the unified lineup as drummer. Two years later, when Jon graduated from high school,\nthe band renamed itself INXS, moved from Perth to Sydney, and began to play the pub circuit.\nWithin a year, the group landed an Australian record contract and released an eponymous\ndebut on Deluxe in 1980.\n\nINXS and Underneath the Colours (1981) became Australian hits, leading the band to an American\ncontract with Atco Records. In 1983, they released their U.S. debut, Shabooh Shoobah, and embarked\non an extensive tour which, thanks to the hit single &quot;Don't Change,&quot; made them minor new wave stars.\nFor their next album, INXS recorded a few sessions with producer Nile Rodgers, which resulted in the\nsleek, funky &quot;Original Sin,&quot; the first inclination that the band was making a move toward a fusion of\nStonesy rock and dance music. &quot;Original Sin&quot; made 1984's The Swing a minor hit, yet the group didn't\nhave a genuine mainstream breakthrough until 1985's Listen Like Thieves, which climbed to number 11\nin the U.S. on the strength of the single &quot;What You Need.&quot;\n\nListen Like Thieves laid the groundwork for Kick, the album that made INXS international superstars.\nReleased late in 1987, Kick worked its way to multi-platinum status over the course of 1988,\nas four singles -- the number one &quot;Need You Tonight,&quot; &quot;Devil Inside,&quot; &quot;New Sensation,&quot; and\n&quot;Never Tear Us Apart&quot; -- climbed into the U.S. Top Ten. In the wake of the album's success,\nHutchence was hailed in some quarters as the heir to Jagger's throne, and the group was considered\nto rival U2 in terms of international popularity. However, such success went to the group's head.\nHutchence released the &quot;experimental&quot; side project Max Q in early 1990, and the record tanked.\nX, INXS' follow-up to Kick, appeared in the fall of 1990 to mostly negative reviews. While the album\ngenerated several hits, including &quot;Disappear&quot; and &quot;Bitter Tears,&quot; only its first single, &quot;Suicide Blonde,&quot;\nreached the Top Ten in the U.S., and the sales of X were disappointing when compared to Kick.\n\nX hurt INXS' momentum considerably. Although the group was still quite popular on its accompanying tour --\nthe 1991 live album Live Baby Live was recorded at Wembley Stadium, the second largest stadium in Europe --\nthe group could no longer be considered in the same league as U2 or R.E.M. Hutchence continued to live a\njet-setting lifestyle, dating Kylie Minogue and various supermodels, which did not wear well in the wake of\nalternative rock's commercial breakthrough in 1992. By the time INXS released Welcome to Wherever You Are,\ntheir most adventurous record, they were out of date in 1992, and even a rash of reviews that favorably\ncompared the record to U2's Achtung Baby couldn't make it a hit. Full Moon, Dirty Hearts followed in 1993 and was\ngenerally ignored. Following its release, INXS left Atlantic's roster, releasing Greatest Hits as their last album for the label.\n\nINXS signed with PolyGram in 1994, yet it took them three years to release a new album. During that time, Hutchence\nwas involved in several tabloid scandals, most notably his love affair with British TV personality Paula Yates\n(which brought an end to her marriage to Bob Geldof), and he hinted that he was recording a solo album.\nThat record didn't materialize, but INXS returned in the spring of 1997 with Elegantly Wasted. While the album\nwas greeted with poor reviews, its hedonistic dance-rock was better suited to the late '90s than the early '90s,\nwhich made the record the group's biggest hit since X. On November 22 of that year, however, Hutchence was\nfound dead in his Sydney hotel room, the victim of an apparent hanging. His long-in-the-works solo debut was\nposthumously issued in late 1999.\n\nTerence Trent D'Arby took the frontman role for an abbreviated set at the opening of Sydney's Stadium Australia\nin 1999, and Jon Stevens filled the spot for occasional gigs that took place through the end of 2003. The latter\nsinger eventually left to pursue a solo career. INXS remained quiet throughout the following year, but in 2005\nthey teamed up with reality show maverick Mark Burnett to launch Rock Star: INXS, a global TV show that aimed\nto find a permanent replacement for Hutchence. The winner was J.D. Fortune, a former Elvis impersonator from\nCanada. Fortune joined INXS, sang on their 2005 album Switch, and participated in the accompanying world tour.\nSwitch only charted well in Fortune's native Canada, though, and his cocaine habit drove a wedge between\nFortune and his bandmates as the tour wound down. Another period of inactivity followed. When INXS returned\nin 2010, they did so with a long list of guest vocalists, retaining Fortune as the official frontman but enlisting stars\nlike Rob Thomas and Ben Harper to appear on their next album, Original Sin, which featured reworked versions\nof the band's past hits.\n\n\n\n\n\n\n\n\nAlbum Review (c/o Amazon)\n\n&quot;X&quot; was the natural follow-up to the outstanding breakthrough album of INXS, &quot;Kick&quot;.\n&quot;X&quot; is more polished, less spontaneous. As if the sextet is really wanting to do &quot;the right thing&quot;.\nBut this may exactly be the weakness of this album! 'Cause the refreshingly youthful spontanity\nof the songs on &quot;Kick&quot; is missing here.\n\nStill, there are a number of really great rock compositions on this one. Like the powerful hit and opener\nSuicide Blonde with the crispy harmonica, the nearly symphonic semi-ballad By My Side, or the album's\nbest track The Stairs where Michael Hutchences great way of singing comes through even more catching\nthan on the other songs.\n\n&quot;X&quot; is one of the two INXS albums you MUST own!\n\n\n\n\n\n\n\n---------------------------------------------------------------------\nINXS - X (2011 Remastered)\n---------------------------------------------------------------------\n\n\nArtist......................................: INXS\nAlbum........................: X (2011 Remastered)\nGenre.....................,.................: Rock\nSource........................................: CD\nYear........................................: 2011\n\nRipper: Exact Audio Copy V1.0 b1 &amp; HP DVD RW AD-7701H\n\nCodec...........: Free Lossless Audio Codec (FLAC)\nVersion.........: reference libFLAC 1.2.1 20070917\nQuality.......: Lossless, (avg. compression: 72 %)\nChannels..............: Stereo / 44100 HZ / 16 Bit\nTags...............................: VorbisComment\n\nInformation..: 2011 Remastered Edition of INXS 1990 album &quot;X&quot;\n\nRipped by..............: BSW on 7/7/2011\nPosted by..............: BSW on 7/7/2011\nNews Server..........: news.astraweb.com\n\nNews Group(s).: alt.binaries.sounds.mp3.metal.full.albums\n\nIncluded....: NFO, SFV, M3U, LOG, CUE\nCovers................: Front Back CD\n\n\n\n\n---------------------------------------------------------------------\nTracklisting\n---------------------------------------------------------------------\n\n\n\n1. Suicide Blonde [03:53]\n2. Disappear [04:10]\n3. The Stairs [04:56]\n4. Faith In Each Other [04:09]\n5. By My Side [03:06]\n6. Lately [03:37]\n7. Who Pays The Price [03:37]\n8. Know The Difference [03:18]\n9. Bitter Tears [03:49]\n10. On My Way [02:55]\n11. Hear That Sound [04:07]\n\n\nPlaying Time.................: 41:43\nTotal Size...............: 303.52 MB\n\nNFO generated on.....: 7/7/2011 9:02:24 PM\n\n\n\n---------------------------------------------------------------------\n\nBarcode (Text): 6 02527 70641 2\n\n---------------------------------------------------------------------\n\n\n:: Generated by Music NFO Builder v1.21a - www.nfobuilder.com ::\n\n\n","torrent":{"xt":"urn:btih:90bbb40f61247d5abf968d5d739cf1c533094fac","amp;dn":"INXS+-+X+%282011+Remastered%29+%28FLAC-EAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90bbb40f61247d5abf968d5d739cf1c533094fac","infoHashBuffer":{"type":"Buffer","data":[144,187,180,15,97,36,125,90,191,150,141,93,115,156,241,197,51,9,79,172]},"announce":[],"urlList":[]}}