{"title":"Troma Triple B-Header Collection","uid":4067228,"size":10883279720,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:90d195ec628c62082200ac8f3b7f1fe813ca1377&amp;dn=Troma+Triple+B-Header+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HangoverMS","files":15,"time":1204858728,"description":"15 complete films from Troma&amp;#039;s B-Header DVD Series!\n\nAlien Blood (1999) - How far would a Mother go, to get her child safely home, if home were another planet? On the last day of the 20th Century, a story of motherly love and extreme violence is brought to life in Alien Blood. \n\nBlades (1989) - People are showing up sliced and diced at Tall Grass Country Club. Norman, the owner of the club, wants to avoid undue publicity on the eve of the televised pro-am tournament, and encourages new pro Roy to get to the bottom of the killings quietly. Roy has a history of alcohol problems since he choked while playing a big tournament years before, and Kelly, who feels she should have been hired as the new pro, isn&amp;#039;t making the situation easier for him, insisting they cancel the tournament until the killer can be stopped. After a seedy character named Deke Slater is arrested, the owner relaxes, but Roy and Kelly begin to feel that Deke&amp;#039;s rantings about a runaway lawnmower aren&amp;#039;t so far-fetched after all, and after Deke is released the three of them prepare for a battle to the death out on the uncharted fairways. \n\nBlood Hook (1987) - It&amp;#039;s time for the annual &quot;Muskie Madness&quot; fishing contest, and the lake is packed with hopeful fishermen. It soon becomes apparent, however, that a psychotic serial killer has also decided to join the festivities. Although the police have determined that the killer is claiming his victims by landing them with giant fishhooks, no clear suspects can be found since everyone is using the exact same hook! What is the killer&amp;#039;s goal? And more importantly, can the murders be stopped? \n\nBloodspell (1988) - Young Daniel has been sent away to a home for troubled teens by his mother, who claims it&amp;#039;s to protect him from his long- missing father. The father eventually returns and, despite his wife&amp;#039;s plans, discovers where his son is being hidden away. It turns out that Daniel&amp;#039;s father is actually a demon who wants to take possession of his body and begin a murderous rampage. As the body count starts to rise, only fellow inmate Charlie notices the change that has come over Daniel, but will he be able to convince anyone of what is happening before he becomes the next victim?\n\nButtcrack (1998) - Starring and featuring the music of the legendary Mojo Nixon, Buttcrack follows the exploits of a man who seeks the assistance of a Bible-banging preacher man to help ward off his obnoxious butt-cleavaged zombie roommate Wade after inadvertently killing him.\n\nDrawing Blood (1999) - A vampire artist forces her brother to bring her victims so she kill them then paint them with their own blood. The brother falls in love with a young hooker, the vampire&amp;#039;s next intended victim, and must choose between sacrificing the girl or killing his vampire sister.\n\nFrostbiter (1996) - A duo of gun happy redneck hunters stupidly break a sacred circle in a hunting spree, which releases the deadly wendigo. The wendigo kills many of the hunters gruesomely, leaving the chosen woman and a gun toting idiot to destroy the deadly beast.\n\nGarden of the Dead (1974) -  In a remote prison work camp, the prisoners have taken a liking to getting high on toxic fumes. When they die during an attempted escape, the warden discovers these dangerous criminals are now unstable zombies! The labor camps have been transformed into a Garden of the Dead and it&amp;#039;s time for the harvest!\n\nIgor and the Lunatics (1985) - Horror movie about a Charles Manson-like cult leader and his deranged, sex-mad, murderous followers who were captured and sent to prison, only to make probation 16 years later and launch a bloody revenge. Igor and his flock set out to smite the townspeople who sent them up, the former members who betrayed them to the law, and just about anyone else who gets in their way.\n\nRockabilly Vampire (2001) - A woman obsessed with Elvis Presley is having problems with her job, her landlord and her landlord&amp;#039;s scummy son. One day she meets a man who looks and dresses just like Elvis. She immediately falls in love, but there&amp;#039;s one thing she doesn&amp;#039;t realize--&quot;Elvis&quot; is a vampire. \n\nSucker (1998) - One hundred years after Bram Stoker&amp;#039;s Dracula comes a new kind of vampire story. Anthony is a modern-day bloodsucker who uses his popular rock band as a front to lure beautiful young groupies to his lair.\n\nTainted (1998) - Tainted follows the adventures of a group of film geeks on their way to a midnight movie, when they get sidetracked and stumble onto a unscrupulous vampire&amp;#039;s plot to taint the local hospital&amp;#039;s blood supply with undead homglobin. Blood-soaked mayhem ensue!\n\nThe Nightmare Never Ends (1980) - Police detective, Mitchell, investigating the death of a victim of a Nazi concentration camp discovers a nightclubbing playboy who has strange powers over women and is seemingly ageless.\n\nUnspeakable (2000) - Impotent and unhappy middle-aged James Fhelleps goes murderously around the bend after an automobile accident claims the life of his beloved daughter Heather and turns his nagging wife Alice into a pathetic grotesquely disfigured cripple. James embarks on a savage killing spree, brutally butchering such low-life scum as hookers and drug dealers so he can reach Heather from the other side.\n\nZombie Island Massacre (1984) - Americans on vacation in the Caribbean take a tour of a nearby island at night and watch a local voodoo ritual. Soon after, they find themselves stranded on the island and under attack by unseen foes. One by one they meet violent ends.\n\n","torrent":{"xt":"urn:btih:90d195ec628c62082200ac8f3b7f1fe813ca1377","amp;dn":"Troma+Triple+B-Header+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90d195ec628c62082200ac8f3b7f1fe813ca1377","infoHashBuffer":{"type":"Buffer","data":[144,209,149,236,98,140,98,8,34,0,172,143,59,127,31,232,19,202,19,119]},"announce":[],"urlList":[]}}