{"title":"The Unnamable by Samuel Beckett","uid":8426651,"size":90324987,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:917d647a0b31ef080f871cf1ad3292d23225227d&amp;dn=The+Unnamable+by+Samuel+Beckett&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tyl3rdurd3n","files":-1,"time":1367364466,"description":"The Unnamable consists entirely of a disjointed monologue from the perspective of an unnamed (presumably unnamable) and immobile protagonist. There is no concrete plot or setting - and whether the other characters (&quot;Mahood&quot; (formerly &quot;Basil&quot;) and &quot;Worm&quot;) actually exist or whether they are facets of the narrator himself is debatable. The protagonist also claims authorship of the main characters in the two previous novels of the Trilogy and Beckett's earlier novels Murphy, Mercier and Camier, and Watt. The novel is a mix of recollections and existential musings on the part of its narrator, many of which pertain specifically to the possibility that the narrator is constructed by the language he speaks. Other 'characters' (a stretch to call them distinctly different than the narrator) serve as the passive recipient of the dialogue and in many places (as the narrator suggests) the dialogue's genesis. The novel builds in its despairing tone until the ending, which consists mainly of very long run-on sentences. It closes with the phrase &quot;I can't go on, I'll go on,&quot; which was later used as the title of an anthology of Beckett works.\n\nThe Unnamable is a 1953 novel by Samuel Beckett. It is the third and final entry in Beckett's &quot;Trilogy&quot; of novels, which begins with Molloy followed by Malone Dies. It was originally published in French as L'Innommable and later translated by the author into English. Grove Press published the English edition in 1958.","torrent":{"xt":"urn:btih:917d647a0b31ef080f871cf1ad3292d23225227d","amp;dn":"The+Unnamable+by+Samuel+Beckett","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"917d647a0b31ef080f871cf1ad3292d23225227d","infoHashBuffer":{"type":"Buffer","data":[145,125,100,122,11,49,239,8,15,135,28,241,173,50,146,210,50,37,34,125]},"announce":[],"urlList":[]}}