{"title":"UB40 - The Way You Do the Things You Do [promo].VOB","uid":7807388,"size":199878656,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9183daa57f0a23a3c1bf89ee7e7d3f86726f13ab&amp;dn=UB40+-+The+Way+You+Do+the+Things+You+Do+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1352437966,"description":"UB40 - The Way You Do the Things You Do [promo].VOB\n\n\nVery HQ rare promo music video from a promo DVD. &quot;The Way You Do the Things You Do&quot; was covered in 1989 by the band UB40. It was the sixth single from their 1989 album Labour of Love II. The song was released in 1989 in the major of the European countries (in July 1990 in France). \n\n&quot;The Way You Do the Things You Do&quot; is a 1964 hit single by The Temptations for the Gordy (Motown) label. Written by Miracles members Smokey Robinson and Bobby Rogers, the single was The Temptations' first charting single on the Billboard Hot 100, peaking in the Top 20 at number eleven and also went to number one on the Cash Box R&amp;B chart. \n\nUB40 are a British reggae band formed in 1978 in Birmingham. The band has placed more than 50 singles in the UK Singles Chart, and has also achieved considerable international success. One of the world's best-selling music artists, UB40 have sold over 70 million records. \n\nThe band members began as friends who knew each other from various schools across Birmingham. The name &quot;UB40&quot; was selected in reference to the document issued to people claiming unemployment benefit from the UK government's Department of Health and Social Security (DHSS) at the time of the band's formation. The designation UB40 stood for Unemployment Benefit, Form 40. \n\nUB40 is one of the most commercially successful reggae acts of all time in terms of record sales, chart positions and touring schedule. During their three-decade long career, they have been performing sell-out shows worldwide and headlining the Reggae Sunsplash music festival in Jamaica, as well as spreading reggae to Russia, South America, etc. They have performed twice at the Night of the Proms, in 2000 and in 2006. In 2006 UB40 was nominated for a Grammy Award (Reggae category) for their album Who You Fighting For. \n\nAll three of their UK number one hits and four of their five U.S. top ten hits were cover versions.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Way_You_Do_the_Things_You_Do#UB40_cover&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Way_You_Do_the_Things_You_Do#UB40_cover&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/aafdJAAEm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/aafdJAAEm&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x576 (4:3) 25fps 9282kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 384kbps\n   Duration: 00:03:00\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.6.4\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:9183daa57f0a23a3c1bf89ee7e7d3f86726f13ab","amp;dn":"UB40+-+The+Way+You+Do+the+Things+You+Do+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9183daa57f0a23a3c1bf89ee7e7d3f86726f13ab","infoHashBuffer":{"type":"Buffer","data":[145,131,218,165,127,10,35,163,193,191,137,238,126,125,63,134,114,111,19,171]},"announce":[],"urlList":[]}}