{"title":"An Introduction to Quantitative Finance","uid":10188182,"size":1160498,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:92194423a9578b1d6a7069a8bf4da53be338ce5e&amp;dn=An+Introduction+to+Quantitative+Finance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moneymakestheworldgoround","files":-1,"time":1400608439,"description":"ABOUT THIS BOOK\nAn Introduction to Quantitative Finance concerns financial derivatives - a derivative being a contract between two entities whose value derives from the price of an underlying financial asset - and the probabilistic tools that were developed to analyse them. The theory in the text is motivated by a desire to provide a suitably rigorous yet accessible foundation to tackle problems the author encountered whilst trading derivatives on Wall Street. The book combines an unusual blend of real-world derivatives trading experience and rigorous academic background. \n\n\nTABLE OF CONTENTS\nI Introduction and Preliminaries\n1: Introduction\n2: Preliminaries\nII Forwards, Swaps and Options\n3: Forward contracts and forward prices\n4: Forward rates and libor\n5: Interest rate swaps\n6: Futures contracts\n7: No-arbitrage principle\n8: Options\nIII Replication, risk-neutrality and the fundamental theorem\n9: Replication and risk-neutrality on the binomial tree\n10: Martingales, numeraires and the fundamental theorem\n11: Continuous time limit and Black-Scholes formula\n12: Option price and probability duality\nIV Interest Rate Options\n13: Caps, floors and swaptions\n14: Cancellable swaps and Bermudan swaptions\n15: Additional topics in interest rate derivatives\nV Through Continuous Time\n16: Rough guide to continuous time\n\n\nABOUT THE AUTHOR\nStephen Blyth, Professor of the Practice of Statistics and Managing Director of Harvard Management Company, Harvard University\n\nStephen Blyth is managing director and head of public markets at the Harvard Management Company, the subsidiary of Harvard University responsible for the management of the University's endowment. He is also Professor of the Practice of Statistics at Harvard University. Before joining Harvard in 2006, Professor Blyth was managing director and head of the Global Rates proprietary trading group at Deutsche Bank in London, and managing director in the Interest Rate Group at Morgan Stanley in New York. Professor Blyth is a frequent speaker at international finance conferences and has written widely on issues facing practitioners in applied quantitative finance and in derivative markets. He holds a PhD in Statistics from Harvard University and an MA in Mathematics with first class honours from Christ's College, Cambridge University, where he is a Lady Margaret Beaufort Fellow. He was formerly a Lecturer in Mathematics at Imperial College London.","torrent":{"xt":"urn:btih:92194423a9578b1d6a7069a8bf4da53be338ce5e","amp;dn":"An+Introduction+to+Quantitative+Finance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92194423a9578b1d6a7069a8bf4da53be338ce5e","infoHashBuffer":{"type":"Buffer","data":[146,25,68,35,169,87,139,29,106,112,105,168,191,77,165,59,227,56,206,94]},"announce":[],"urlList":[]}}