{"title":"Supernatural S01E17, 18, 19, 20, 21 &amp; 22 DVDrip DutchReleaseTeam","uid":6438048,"size":1881176228,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:92b98e7fbb32097148d2315a7a567e58662e48fe&amp;dn=Supernatural+S01E17%2C+18%2C+19%2C+20%2C+21+%26+22+DVDrip+DutchReleaseTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"MtotheAtiash","files":-1,"time":1306865445,"description":"USA\nGenre: Horror\nTaal: Engels\nOndertitels: vaste Nederlandse ondertitelingIMDB\n-Aflevering nummer 17-22\n\nHell House\nSam and Dean investigate the case of a maniacal ghost inhabiting a long abandoned Texas farmhouse known as &quot;Hell House.&quot; They believe the ghost is the spirit of a deceased Depression-era farmer who killed his family, but they soon realize it is something far more powerful.\n\nSomething Wicked\nSam and Dean investigate a small town in Wisconsin where children are falling into comas for no apparent reason. The brothers discover that a witch is creeping into the bedrooms of the children and stealing their &quot;life force.&quot; While battling the witch, Dean recalls a past mistake that almost cost Sam his life at the hands of the very same witch, an event which has fueled Dean's protectiveness over Sam and his blind obedience to his father.\n\nProvenance\nA young couple is murdered in their home shortly after buying an antique painting of a family portrait circa 1910. Upon reviewing the painting's provenance, Sam and Dean learn that everyone who has ever bought the painting has been murdered and race to discover how the portrait is causing the deaths before it can claim its next victim.\n\nDead's Mean Blood\nAfter Daniel Elkins, a vampire hunter and John's mentor, is murdered, Sam and Dean are surprised when John himself shows up to solve the case. John discovers the vampires have taken an antique gun, which has the power to kill all supernatural beings. The Winchester family sets out to retrieve the gun from the vampires so they can use it to kill the demon that took Sam and Dean's mother.\n\nSalvation\nMeg turns to killing John's friends in order to get the Colt. Sam and Dean stakeout the Demon's next target; a family with a six month old baby showing signs of special abilities. John heads off alone to confront Meg\n\nDevil's Trap\nSam and Dean seek help from Bobby Singer, an old family friend in their mission to save their father from Meg. The brothers set a trap for Meg.\n\nhardcoded dutch subs\n\ndeze review wordt u aangeboden door het DutchReleaseTeam\nVoor de reviews van de nieuwste films, muziek, series, games etc ga dan eens naar &lt;a href=&quot;\nhttp://www.hetmultimediacafe.be/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hetmultimediacafe.be/&lt;/a&gt;","torrent":{"xt":"urn:btih:92b98e7fbb32097148d2315a7a567e58662e48fe","amp;dn":"Supernatural+S01E17%2C+18%2C+19%2C+20%2C+21+%26+22+DVDrip+DutchReleaseTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92b98e7fbb32097148d2315a7a567e58662e48fe","infoHashBuffer":{"type":"Buffer","data":[146,185,142,127,187,50,9,113,72,210,49,90,122,86,126,88,102,46,72,254]},"announce":[],"urlList":[]}}