{"title":"EnigmaT Set Rips { Cuts } - January 24th, 2014","uid":9517977,"size":694986589,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:92c5125fb96b0e376ba82769f018926c8024622b&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+January+24th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":81,"time":1390523613,"description":"ADSR - Stars (Cut From Graham Set)-enTc.mp3\nAizen Zuflet - As We Are (Cut From Angry Set)-enTc.mp3\nAlex Fixed &amp; Paul Denton - Mirrors (Original Mix) (Cut From Nadz Set)-enTc.mp3\nAlex Rusin vs. Sound Fusion - Shadows of Us (GDJB Rip)-enTc.mp3\nAlistair Albrecht, Steven Cole Feat Matt Heanes - Reaching The Headlights (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nAmbassador - The Fade (Danilo Ercole Remix) (GDJB Rip)-enTc.mp3\nAmos Feat. Sarah-Jane Neild - If It Happens (Steve Morley Remix) (ASOT 649 Rip)-enTc.mp3\nAndre Sobota with Jamie Kemp - Polarity (ASOT 649 Rip)-enTc.mp3\nArmin van Buuren Feat. Cindy Alma vs. Sneijder &amp; Bryan Kearney - Proper Life (Fady &amp; Mina Mashup) (ASOT 649 Rip)-enTc.mp3\nArtra &amp; Holland - Inner Impulse (ASOT 649 Rip)-enTc.mp3\nBlamma Blamma feat. Kristina Train - Zsa Zsa (Eelke Kleijn Remix) (Cut From O'Neil Set)-enTc.mp3\nBluefire - Dreamnasia (Photographer Remix) (ASOT 649 Rip)-enTc.mp3\nChakra - Home (Alexander Popov Remix) (ASOT 649 Rip)-enTc.mp3\nChris Forward &amp; Mace V feat. Eva Kade - Next Day (Michael Retouch Remix) (Cut From Del Mar Set)-enTc.mp3\nCold Rush &amp; Tiff Lacey - Cry Wolf (Dan Chase Remix) (Cut From Del Mar Set)-enTc.mp3\nCraig London - Liberar Su Mente (Original Mix) (Cut From London Set)-enTc.mp3\nDennis Sheperd &amp; Cold Blue &amp; Ana Criado - Every Word (Club Mix) (Cut From Two&amp;One Set)-enTc.mp3\nDennis Sheperd &amp; Cold Blue &amp; Ana Criado - Every Word (Dub Mix) (Cut From Graham Set)-enTc.mp3\nDivision One - Colapsar (Cut From Valentine Set)-enTc.mp3\nE&amp;G - The Days After (Andromedha Intro - Kings Of Addiction Remix) (Cut From Valentine Set)-enTc.mp3\nE.T Project - Fallout (Hypaethrame Remix) (Cut From Del Mar Set)-enTc.mp3\nEastern Sound - Nothing To Lose (Michael Retouch Remix) (Cut From Romel Set)-enTc.mp3\nEDU &amp; Kristoffer Ljungberg - Around the Sun (LTN Remix) (Cut From Graham Set)-enTc.mp3\nEmanuele Congeddu - Fable Of Love (Original Mix) (Cut From Suzy Set)-enTc.mp3\nET Project - Shadows (Original Mix) (Cut From El Jay Set)-enTc.mp3\nFabio Piletto - Here Comes The F (Cut From Graham Set)-enTc.mp3\nFerry Tayle - Laidback Sunday (Cut From Ronde Set)-enTc.mp3\nFire &amp; Ice - Out Of Darkness (Matt Harrison Remix) (Cut From Angel Ace Set)-enTc.mp3\nIce Upon Fire - Hypnotic Katie (Original Mix) (Cut From TranceEye Set)-enTc.mp3\nInnerSync - A Gift Of Love (Original Mix) (Cut From Romel Set)-enTc.mp3\nIRA &amp; Sarah Russell - Constant Invasion (Purelight Remix) (ASOT 649 Rip)-enTc.mp3\nJadin Recks - Deep December (Cut From Enlusion Set)-enTc.mp3\nJadin Recks - Deep December (Original Mix) (Cut From Falcon Set)-enTc.mp3\nJadin Recks - Second Guesses (Cut From Enlusion Set)-enTc.mp3\nJadin Recks - Second Guesses (Original Mix) (Cut From Falcon Set)-enTc.mp3\nJames Rigby - Indigo Delta (Original Mix) (Cut From Sneijder Set)-enTc.mp3\nJohn Askew - Shine (ASOT 649 Rip)-enTc.mp3\nJonas Stenberg - Overworld (Cut From Ferry Set)-enTc.mp3\nKenneth Thomas - Heart on Fire (Dub Mix) (Cut From Rank 1 Set)-enTc.mp3\nLedo - Things (Original Mix) (Cut From Sneijder Set)-enTc.mp3\nLedo - Things (Original Mix) (Cut From Suzy Set)-enTc.mp3\nLian July feat. Eli - Surrender (Dub Mix) (Cut From Graham Set)-enTc.mp3\nLirrik - Forgotten Worlds (Original Mix) (Cut From Colonial One Set)-enTc.mp3\nLope &amp; Kantola - Kakadu (Cut From O'Neil Set)-enTc.mp3\nMark Sixma &amp; Jerome Isma-Ae - Refused (David Gravell Remix) (ASOT 649 Rip)-enTc.mp3\nMassai One - My Hideaway (Chasing the Sun Remix) (ASOT 649 Rip)-enTc.mp3\nMassai One - My Hideaway (Cut From O'Neil Set)-enTc.mp3\nMassai One - My Hideaway (Talamanca Remix) (Cut From Graham Set)-enTc.mp3\nMax Freegrant &amp; Paul Thomas - End of the Night (GDJB Rip)-enTc.mp3\nMenno De Jong - Creatures Of The Night (Chris Porter Remix) (Cut From Romel Set)-enTc.mp3\nMisja Helsloot - B.O.T.S. (Signum Remix) (Cut From Signum Set)-enTc.mp3\nMonada - Teleport (Original Mix) (Cut From Fonarev Set)-enTc.mp3\nMyon &amp; Shane 54 feat. Late Night Alumni - Under Your Cloud (ASOT 649 Rip)-enTc.mp3\nNab Brothers - When We Were Young (UDM Remix) (Cut From Saux Set)-enTc.mp3\nNaian - Zero Motion (Original Mix) (Cut From Ferry Set)-enTc.mp3\nNY Fan - Illusion (10dens Dub Remix) (Cut From Ronde Set)-enTc.mp3\nO.B.M Notion - Indescribable Feeling (ASOT 649 Rip)-enTc.mp3\nPaul Gallagher - Home (Nick Rowland Dub Mix) (Cut From Nilsson Set)-enTc.mp3\nRadiohead and Eliza Lumley - Street spirit (Arthur Volt Remix) (Cut From Feel Set)-enTc.mp3\nRene Ablaze &amp; Global Influence - Sunshine Girl (Rene Ablaze &amp; Dima Krasnik Remix) (Cut From Del Mar Set)-enTc.mp3\nRobert Vadney - Devil's Rock (Cut From Bjorn Set)-enTc.mp3\nSamvel - Arctic Echoes (Another World Repimp) (Cut From Suzy Set)-enTc.mp3\nSeltigma - Level Up (Cut From Bjorn Set)-enTc.mp3\nSneijder &amp; Cate Kanell - Letting Me Go (ASOT 649 Rip)-enTc.mp3\nSolis &amp; Sean Truby - Sectioned (Cut From Camz Set)-enTc.mp3\nSolis &amp; Sean Truby - Sectioned (Original Mix) (Cut From Feel Set)-enTc.mp3\nSolis &amp; Sean Truby and Fisherman &amp; Hawkins - Code Breaker (ASOT 649 Rip)-enTc.mp3\nSouhail Semlali - Second Chance (Original Mix) (Cut From Nadz Set)-enTc.mp3\nSpace RockerZ &amp; Cathy Burton - Lead You Back (Kaimo K Dub) (Cut From Graham Set)-enTc.mp3\nSpeed Limits - Remember The Good Times (Original Mix) (Cut From Tritonal Set)-enTc.mp3\nStereojackers vs. Mark Loverush feat. Seri - Come and Go (Two&amp;One Remix) (Cut From Two&amp;One Set)-enTc.mp3\nStevy Forello - Fondly (Somna Remix) (ASOT 649 Rip)-enTc.mp3\nSystem F feat. Armin Van Buuren - Exhale (Pobsky Rework) (Cut From Pobsky Set)-enTc.mp3\nTepes &amp; Harry Square - Magia (GDJB Rip)-enTc.mp3\nTepes &amp; Harry Square - Magia (Original Mix) (Cut From Suzy Set)-enTc.mp3\nThe Chain Gang Of 1974 - Sleepwalking (Juventa Remix) (Cut From Tritonal Set)-enTc.mp3\nThe Cloudy Day - Over Emotion (TrancEye Remix) (Cut From TranceEye Set)-enTc.mp3\nTrilucid - Aria (-Short- GDJB Rip)-enTc.mp3\nUDM - Purple Skies (Original Mix) (Cut From Angel Ace Set)-enTc.mp3\nVenSun -The Dragon Flies (Stereojackers vs Mark Loverush Remix) (Cut From Two&amp;One Set)-enTc.mp3\nW&amp;W - Bigfoot (ASOT 649 Rip)-enTc.mp3\n","torrent":{"xt":"urn:btih:92c5125fb96b0e376ba82769f018926c8024622b","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+January+24th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92c5125fb96b0e376ba82769f018926c8024622b","infoHashBuffer":{"type":"Buffer","data":[146,197,18,95,185,107,14,55,107,168,39,105,240,24,146,108,128,36,98,43]},"announce":[],"urlList":[]}}