{"title":"Fried Chicken- An American Story by John T Edge (retail) {dwg}","uid":11210648,"size":1688081,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:92d987917fff4367955d8f4b7f1c63411eeb5c00&amp;dn=Fried+Chicken-+An+American+Story+by+John+T+Edge+%28retail%29+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1413271399,"description":"What could be a more fun and delicious way to celebrate American culture than through the lore of our favorite foods? That's what John T. Edge does in his smart, witty, and compulsively readable new series on the dishes everyone thinks their mom made best. If these are the best-loved American foods-ones so popular they've come to represent us-what does that tell us about ourselves? And what do the history of the dish and the regional variations reveal?\n\nThere are few aspects of life that carry more emotional weight and symbolism than food, and in writing about our food icons, Edge gives us a warm and wonderful portrait of America -by way of our taste buds. After all, &quot;What is patriotism, but nostalgia for the foods of our youth?&quot; as a Chinese philosopher once asked.\n\nIn Fried Chicken, Edge tells an immensely entertaining tale of a beloved dish with a rich history. Freed slaves cooked it to sell through the windows of train cars from railroad platforms in whistle-stop towns. Children carried it in shoe boxes on long journeys. A picnic basket isn't complete without it. It is a dish that is deeply Southern, and yet it is cooked passionately across the country. And what about the variations? John T. Edge weaves a beguiling tapestry of food and culture as he takes us from a Jersey Shore hotel to a Kansas City roadhouse, from the original Buffalo wings to KFC, from Nashville Hot Chicken to haute fried chicken at a genteel Southern inn. And, best of all, he gives us fifteen of the ultimate recipes along the way","torrent":{"xt":"urn:btih:92d987917fff4367955d8f4b7f1c63411eeb5c00","amp;dn":"Fried+Chicken-+An+American+Story+by+John+T+Edge+%28retail%29+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92d987917fff4367955d8f4b7f1c63411eeb5c00","infoHashBuffer":{"type":"Buffer","data":[146,217,135,145,127,255,67,103,149,93,143,75,127,28,99,65,30,235,92,0]},"announce":[],"urlList":[]}}