{"title":"Mighty MAC: Airlift, Rescue, Special Operations","uid":11533464,"size":13781465,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9417e5b8644c7a5a880d18c47368f380f721538c&amp;dn=Mighty+MAC%3A+Airlift%2C+Rescue%2C+Special+Operations&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":-1,"time":1416600766,"description":"Headquartered at Scott AFB, Illinois, the Military Airlift Command is proudly called The Backbone of Deterrence'. It possesses more than 1000 aircraft and has a personnel strength of over 94,000 active duty people, both military and civilian. It exercises direct command over 13 bases in the United States and controls US facilities at Lajes Field in the Azores and Rhein-Main AB in West Germany. Upon mobilization of Air Force Reserve (AFRES) and Air National Guard (ANG) forces, MAC will gain an additional 63,000 people and approximately 390 aircraft. Moreover, MAC's assets are supplemented in peacetime by those ot commercial air carriers operating under military contracts and in time of emergency by those of carriers participating in the Civil Reserve Air Fleet (CRAF) programme.\nMAC flying units are distributed among three numbered Air Forces. The Twenty-First Air Force, headquartered at McGuire AFB, New Jersey, has 11 Military Airlift Squadrons (two with C-5A/Bs, six with C-14lBs, one with C-22As and C-130Es, one with C-23As, and one with a mix of light transports and helicopters), four Tactical Airlift Squadrons with C-130Es, one Aeromedical Airlift Squadron with C-9As, and one Air Base Squadron with C-12s and C-21s. \nThe Twenty-Third Air Force, headquartered at Hurlburt Field, Florida, conducts special operations as its primary mission. Its other missions include combat rescue, peacetime rescue coordination, security support for intercontinental ballistic missile sites, aeromedical evacuation, facility flight check operations, weather","torrent":{"xt":"urn:btih:9417e5b8644c7a5a880d18c47368f380f721538c","amp;dn":"Mighty+MAC%3A+Airlift%2C+Rescue%2C+Special+Operations","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9417e5b8644c7a5a880d18c47368f380f721538c","infoHashBuffer":{"type":"Buffer","data":[148,23,229,184,100,76,122,90,136,13,24,196,115,104,243,128,247,33,83,140]},"announce":[],"urlList":[]}}