{"title":"Malwarebytes Chameleon 3.1.28","uid":12627350,"size":6392336,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:94ba19c65b26379ae910bf18f0a3e0ec6178e8f7&amp;dn=Malwarebytes+Chameleon+3.1.28+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"V3N0Ms","files":3,"time":1445790193,"description":"Malwarebytes Chameleon 3.1.28 \r\n\r\nimage\r\n\r\nSize: 6 MB\r\n\r\nRequires: Win All \r\n\r\nimage\r\n\r\nIf a virus manages to bypass your defences and infect your PC then it's easy to assume that you'll just download some other security tool to remove it, but life may not be so straightforward. Once malware is installed on your system then it will sometimes block access to common antivirus websites and tools, making it much more difficult to tackle - unless you have Malwarebytes Chameleon.\r\n\r\nThe package is essentially just a collection of files, each of which will try to do the same thing: download, install and run Malwarebytes Anti-Malware. But it tries to do this using various disguised names&quot;iexplore.exe&quot;, &quot;svchost.exe&quot;, making it much more difficult for any infection to figure out what's going on.\r\n\r\nAnd so all you have to do, then, is double-click each name in turn until one of them works.\r\n\r\nThis plainly isn't a perfect scheme. &quot;Winlogon.exe&quot;, for instance, is the name of a key Windows system file, and Malwarebytes are presumably hoping that any virus won't dare to prevent it from launching. But malware could check its location, first, and block any executables which aren't in your system folders, which will keep most PCs running while also disabling this particular Chameleon option.\r\n\r\nStill, most viruses aren't going to go to that trouble, and so Chameleon could still be very useful. It's certainly convenient: just double-clicking a file is all it takes to download, install and run Malwarebytes Anti-Malware on a PC, making the tool very handy for any portable security toolkit.\r\n\r\n* Just Run to use...\r\n\r\n*Enjoy!","torrent":{"xt":"urn:btih:94ba19c65b26379ae910bf18f0a3e0ec6178e8f7","amp;dn":"Malwarebytes+Chameleon+3.1.28+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94ba19c65b26379ae910bf18f0a3e0ec6178e8f7","infoHashBuffer":{"type":"Buffer","data":[148,186,25,198,91,38,55,154,233,16,191,24,240,163,224,236,97,120,232,247]},"announce":[],"urlList":[]}}