{"title":"The Day the Earth Stood Still (Robert Wise, 1951) [RePoPo]","uid":4446616,"size":1688423693,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:96599ecc974424abffcd74b7285de283e5358e14&amp;dn=The+Day+the+Earth+Stood+Still+%28Robert+Wise%2C+1951%29+%5BRePoPo%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"repopo","files":-1,"time":1224031848,"description":"*******************************************************************************\n               The Day the Earth Stood Still (Robert Wise, 1951)\n*******************************************************************************\n-------------------------------------------------------------------------------\n                              Technical Information\n-------------------------------------------------------------------------------\nType..................: Movie\nContainer file........: AVI\nVideo Format..........: H.264\nTotal Bitrate.........: 2402 Kbps\nBits/(Pixel*Frame)....: 0.299\nAudio format..........: AC3 192 Kbps (DVD Untouched)\nAudio Languages.......: English 1.0\nSubtitles Ripped......: English, Spanish\nSubtitles in Subpack..: English HoH, Spanish, French\nResolution............: 640x480\nAspect Ratio..........: 1.33:1\nOriginal Aspect Ratio.: 1.37:1\nColor.................: B&amp;W\nFPS...................: 23.976\nSource................: NTSC DVD\nDuration..............: 01:32:06\nGenre.................: Sci-Fi\nIMDb Rating...........: 8.1\nMovie Information.....: http://www.imdb.com/title/tt0043456/\n\n-------------------------------------------------------------------------------\n                                 Release Notes\n-------------------------------------------------------------------------------\nSynopsis\tby Hal Erickson\nAll of Washington, D.C., is thrown into a panic when an extraterrestrial \nspacecraft lands near the White House. Out steps Klaatu (Michael Rennie, in a \nrole intended for Claude Rains), a handsome and soft-spoken interplanetary \ntraveler, whose &quot;bodyguard&quot; is Gort (Lock Martin), a huge robot who spews forth \nlaser-like death rays when danger threatens. After being wounded by an \noverzealous soldier, Klaatu announces that he has a message of the gravest \nimportance for all humankind, which he will deliver only when all the leaders of \nall nations will agree to meet with him. World politics being what they are in \n1951, Klaatu's demands are turned down and he is ordered to remain in the \nhospital, where his wounds are being tended. Klaatu escapes, taking refuge in a \nboarding house, where he poses as one &quot;Mr. Carpenter&quot; (one of the film's many \nparallels between Klaatu and Christ). There the benign alien gains the \nconfidence of a lovely widow (Patricia Neal) and her son, Bobby (Billy Gray), \nneither of whom tumble to his other-worldly origins, and seeks out the gentleman \nwhom Bobby regards as &quot;the smartest man in the world&quot; -- an Einstein-like \nscientist, Dr. Barnhardt (Sam Jaffe). The next day, at precisely 12 o'clock, \nKlaatu arranges for the world to &quot;stand still&quot; -- he shuts down all electrical \npower in the world, with the exception of essentials like hospitals and planes \nin flight. Directed by Robert Wise, who edited Citizen Kane (1941) and The \nMagnificent Ambersons (1942) for director Orson Welles before going on to direct \nsuch major 1960s musicals as West Side Story (1961) and The Sound of Music \n(1965), The Day the Earth Stood Still was based on the story Farewell to the \nMaster by Harry Bates.\n-------------------------------------------------------------------------------\nCAST\nMichael Rennie             - Klaatu\nPatricia Neal              - Helen Benson\nHugh Marlowe               - Tom Stevens\nSam Jaffe                  - Dr. Barnhardt\nBilly Gray                 - Bobby Benson\nFrances Bavier             - Mrs. Barley\nLock Martin                - Gort\nDrew Pearson               - Himself\nH.V. Kaltenborn            - Himself\nJohn Brown                 - Mr. Bradley\nJohn Burton                - British Radio MC\nWheaton Chambers           - Jeweler\nFrank Conroy               - Harley\nJames Craven               - Businessman\nMarjorie Crossland         - Hilda\nEdith Evanson              - Mrs. Crockett\nBobby Gray \t \nHarry Harvey               - Taxi Driver\nGil Herman                 - Government Agent\nHarry Lauter               - Platoon Leader\nFreeman Lusk               - Gen. Cutler\nGeorge Lynn                - Col. Ryder\nTyler McVey                - Brady\nDorothy Neumann            - Barnhardt's Secretary\nRobert Osterloh            - Major White\nHouse Peters, Jr.          - MP Captain\nMarshall Bradford          - Newscaster\nFay Roope                  - Major General\nJames Seay                 - Government Man\nOlan Soule                 - Mr. Krull\nStuart Whitman \t \nRush Williams              - MP Sergeant\nCarleton Young             - Colonel \n\nCREW\nRobert Wise                - Director\nJulian Blaustein           - Producer\nEdmund H. North            - Screenwriter\nLeo Tover                  - Cinematographer\nBernard Herrmann           - Composer (Music Score)\nWilliam H. Reynolds        - Editor\nAddison Hehr               - Art Director\nLyle Wheeler               - Art Director\nDarryl F. Zanuck           - Executive Producer\nClaude E. Carpenter        - Set Designer\nThomas K. Little           - Set Designer\nWilliam Travilla           - Costume Designer\nArthur L. Kirbach          - Sound/Sound Designer\nHarry M. Leonard           - Sound/Sound Designer\nBen Nye, Sr.               - Makeup\nFred Sersen                - Special Effects\nHarry Bates                - Short Story Author\n-------------------------------------------------------------------------------\n-------------------------------------------------------------------------------\nTRIVIA (from IMDb)\n\n    * he role of Klaatu was originally intended for Claude Rains.\n\n    * The role of Gort was played by Lock Martin, the doorman from Grauman's \nChinese Theater, because he was extremely tall. However, he was unable to pick \nup Helen because he was so weak and had to be aided by wires (in shots from the \nback where he's carrying her, it's actually a lightweight dummy in his arms). He \nalso had difficulty with the heavy Gort suit and could only stay in it for about \na half-hour at a time.\n\n    * There were two Gort suits: one that laced up down the back for when he had \nhis front to the camera, another that laced up in the front for the shots of his \nback.\n\n    * To give the appearance of seamlessness to the space ship, the crack around \nthe door was filled with putty, then painted over. When the door opened the \nputty was torn apart, making the door seem to simply appear.\n\n    * During the early phases of preproduction, 20th Century Fox's studio chief \nDarryl F. Zanuck suggested that Jack Palance could be used for the role of the \nrobot Gort.\n\n    * Patricia Neal has admitted in interviews that she was completely unaware \nduring the filming that the film would turn out so well and become one of the \ngreat science-fiction classics of all time. She assumed it would be just another \none of the then-current and rather trashy flying saucer films that were popular \nat the time, and she found it difficult to keep a straight face while saying her \nlines.\n\n    * One of the reasons that Michael Rennie was cast as Klaatu was because he \nwas generally unknown to American audiences, and would be more readily accepted \nas an &quot;alien&quot; than a more recognizable actor.\n\n    * In the original story, the robot, Gort, was the master - Klaatu was merely \none of a series of doubles, or maybe clones, that died after a short time.\n\n    * In the original story, &quot;Farewell to the Master&quot;, the robot's name was \nGnut, not Gort.\n\n    * Doubles were used for Klaatu and Bobby in long shots of them walking \naround Washington, DC. In reality, none of the principal cast ever went to \nWashington, and the scenes with Klaatu and Bobby at the Lincoln Memorial and at \nArlington Cemetary were shot in front of background screens using footage shot \nby the second unit crew in Washington, DC.\n\n    * All of the scenes of Helen Benson and Klaatu in the taxi also feature \nfootage from the second unit of Washington, DC as we see background vehicles in \nthe rear and side windows of the taxi.\n\n    * To depict the seamless closing of the ship and its ramp, they just \nreversed the film of the shot of the ship's ramp and door appearing.\n\n    * The original choice of actor to play the alien visitor was Spencer Tracy.\n\n    * Darryl F. Zanuck was the one who first suggested Michael Rennie for the \npart of Klaatu, having seen him perform on the London stage.\n\n    * Robert Wise was attracted to the project because of its overt \nanti-military stance and also because he believed in UFOs.\n\n    * In line with the film's Christian allegory, Klaatu adopts the name \n&quot;Carpenter&quot; when hiding out from the authorities. Robert Wise hadn't considered \nthe Christian implications until it was pointed out to him several years later.\n\n    * The spaceship was made of wood, wire and plaster of Paris.\n\n    * The Army refused to co-operate after reading the script. The National \nGuard had no such qualms and gladly offered their co-operation.\n\n    * The screenplay was based on the story &quot;Farewell to the Master&quot; by Harry \nBates. It was originally published in the pulp magazine &quot;Astounding \nScience-Fiction.&quot;\n\n    * Three years after this was made, it was adapted for the &quot;Lux Radio \nTheatre&quot;. Michael Rennie and Billy Gray reprised their roles. Jean Peters played \nthe role of Helen.\n\n    * Bernard Herrmann's music for the film is scored for two theremins, pianos, \nharps, different electrical organs, percussion, amplified solo strings and a \nlarge brass section including four tubas.\n\n    * Although he was already signed to play the Einstein-like Professor \nBarnhardt, the studio wanted to remove Sam Jaffe as a result of the political \nwitch hunts that were then underway. Producer Julian Blaustein appealed to \nstudio chief Darryl F. Zanuck. Zanuck allowed Jaffe to play the role, but it \nwould be Jaffe's last Hollywood film until the late 1950s.\n\n    * Bernard Herrmann used two Theremins to create his creepy score, one \npitched higher, the other lower, making this one of the first films to feature a \nlargely electronic score.\n\n    * Ranked #5 on the American Film Institute's list of the 10 greatest films \nin the genre &quot;Sci-Fi&quot; in June 2008.\n\n    * To increase the sense of reality, some of the most famous broadcast \njournalists of the time were hired to do cameos as themselves. These included \nGabriel Heatter, H.V. Kaltenborn and Drew Pearson.\n\n    * Originally Klaatu's death and resurrection at the end of the movie was \nmeant to be permanent, reinforcing his God-like powers, but at the time the \nBreen Office--the film industry's censors--didn't like the ending, suggesting it \nwas too left-wing, and insisted that director Robert Wise and writer Edmund H. \nNorth put in the line, &quot;That power is reserved for the Almighty Spirit&quot;. Both \nWise and North hated the line and thought it completely inappropriate--negating \nthe concept of Klaatu's race being all-knowing and all-powerful--but the studio \nwouldn't back them up and they were forced to put it in.\n\n    * In the scene where Gort is seen carrying Klaatu's body (inside the ship), \nMichael Rennie was actually sitting on a dolly out of camera angle to support \nhis weight during this brief scene, since Lock Martin (Gort) was unable to do so \nhimself.\n\n    * In the scenes of Gort carrying both Helen Benson and Klaatu up the ramp \nand into the ship, lightweight look-alike dummies were used because of Lock \nMartin's inability to actually carry either actor himself.\n\n    * One scene was cut from the movie before it was released. The original \nscript called for Klaatu to be taken to a police station by the government man \nwho came for him at the boarding house, not directly to Barnhart's home. At the \nstation, men were being dragged in from all over and questioned, and Klaatu \nbecomes upset when he sees how a man was beaten up by a crowd because they \nthought he was the spaceman. The scene was cut because director Robert Wise \nrealized that the audience was interested in the Klaatu/ Barnhart meeting and \nthe scene at the police station was unnecessary, but on the DVD there are stills \nfrom that deleted scene.\n\n    * Because the stationary Gort could not stand on the angled ramp, Lock \nMartin had to wear the Gort suit in the background during the final sequence. \nMartin, who was frail, had to wear the suit for so long that he began having \nspasms in his arms. During Klaatu's final speech, Gort's arms can be seen moving \nslightly.\n\n    * Harry Bates was paid a mere $500 by 20th Century-Fox for the rights to his \nshort story &quot;Farewell to the Master&quot;.\n\n    * The name &quot;Richard Carlson&quot; - another leading sci-fi actor of the 1950s - \nappears at the bottom of the glass door to Hugh Marlowe's office.\n\n    * Some reference works state that &quot;Adventures of Superman&quot; (1952) star \nGeorge Reeves appeared as a television news reporter with eyeglasses in one \nsequence. This is not true. The actor playing the role bears no resemblance to \nReeves, and in a 1995 interview with Reeves biographer Jim Beaver, director \nRobert Wise stated unequivocally that it is not Reeves in the role. It appears \nthat someone jumped to conclusions based on the image of a reporter wearing \nglasses and thus resembling roughly the image of Superman alter-ego Clark Kent. \nReeves had nothing to do with the film in any capacity.\n\n    * The phrase &quot;Klaatu barada nikto&quot; has become a popular phrase among sci-fi \nfans over the years and has been featured in other movies, such as Army of \nDarkness (1992).\n\n    * The film was shot on the 20th Century-Fox back lot, which is now an \nupscale office complex known as Century City.\n\n    * Writer Edmund H. North was a former army officer who wrote the script in \nresponse to the proliferation of nuclear weapons during the Cold War.\n\n    * In 1951, 20th Century Fox theatrically distributed this with the short \nfilm The Guest (1951).\n\n-------------------------------------------------------------------------------\n                                 PLEASE NOTICE\n-------------------------------------------------------------------------------\n\nSize has been calculated in order to get the optimum PQ without oversizing the\nfile, hence the irregular size of the file (not the usual 700Mb/1.4Gb rip).  \nA rate of Bits/(Pixel*Frame) around 0.3 is perfect, above that point, picture\nquality becomes virtually the same to the original source.\n\nCheck you have installed the right codecs, as listed in this .nfo file, before\ntrying to play it.  VLC will play this file without having to install any codec.\n\nIf you don't like the codec(s), container, resolution, file size, languages or\nany technical aspect on this rip, keep it to yourself and go and do your own.\n\nSerious feedback on quality will always be welcome.  IF you can/can't play it\non standalone players, PS3, Xbox, etc etc, that'd be of interest so I can\nenhance future rips.\n\n-------------------------------------------------------------------------------\n","torrent":{"xt":"urn:btih:96599ecc974424abffcd74b7285de283e5358e14","amp;dn":"The+Day+the+Earth+Stood+Still+%28Robert+Wise%2C+1951%29+%5BRePoPo%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96599ecc974424abffcd74b7285de283e5358e14","infoHashBuffer":{"type":"Buffer","data":[150,89,158,204,151,68,36,171,255,205,116,183,40,93,226,131,229,53,142,20]},"announce":[],"urlList":[]}}