{"title":"Snappy Driver Installer R139-=TEAM OS=-{HKRG}","uid":11206558,"size":8060792689,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:968ffbacf66415d2bc098bec490e4397ff3f225e&amp;dn=Snappy+Driver+Installer+R139-%3DTEAM+OS%3D-%7BHKRG%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"OnlyByTheRain","files":130,"time":1413226663,"description":"[img]http://i.imgur.com/HQTbukL.jpg[/img]   \n  \n[b]What is this release different from SamDrivers 14.10?\n\nThis distribution is made on the basis SamDrivers 14.10 with the following features:\n\nRemoved all third party software (folder soft).\nRemoved alternative program to install the drivers.\nDistribution is made in the form of a folder, rather than ISO, allowing you to choose the drivers for download.\nThis distribution will be used for program updates and drayverpakov directly from Snappy Driver Installer. It is therefore important not only for the distribution of user trackers, but also for those who drayverpaki pumps directly from the program.\n\nWhy should I use this program instead of DriverPack Solution?\n\nTo install the drivers recommend using Snappy Driver Installer and below will explain why.\n\nBadPointer (software developer Snappy Driver Installer) previously worked on DriverPack Solution (DPS), so he knows the possibilities DPS, as well as its limitations. DPS is written in Java, which is very slow and has many limitations. Since DPS should work even under the outdated IE 6.0, use new and effective design of the latest browsers in order to avoid unacceptable appearance of various scripting errors when you run the program on older IE.\n\nIt should be noted that the whole of the current code selection and installation DPS written BadPointer'om and since he stopped working on DPS, no one has devised DPS, as those who remained in the DPS did not have a sufficient understanding of the code and therefore could not fix it. Therefore, in the last year in DPS changes mainly affect the interface and optional software kit, and chronic problems DPS (such as installing Intel USB 3.0, Tatsch on desktops, selection of the sound driver) remained unsolved all this time and now hardly ever be corrected .\n\nSnappy Driver Installer was originally developed as a solo BadPointer'om DPS rewriting from scratch in C / C ++. But in the end it was decided to promote it, regardless of DPS and under a different name.\n\nIn Snappy Driver Installer already corrected the problems with the selection of drivers, a complete programming language C / C ++ can achieve an order of magnitude better performance and stability due to the absence of any dependencies like IE. Snappy Driver Installer produces a quality selection of drivers due to the inclusion of many more characteristics of drivers and devices and drivers on the ranking of the degree of compatibility, while the DPS could prematurely discard the driver and did not know how to compare the drivers of different drayverpakov.\n\nLet's compare the 3 installation program that is available on SamDrivers\nDriverPack Solution (DPS)\nDrivers Installer Assistant (DIA)\nSnappy Driver Installer (SDI)\n\nsize of the program\nDPS - 34 MB (291 files)\nDIA - 44 MB (189 files)\nSDI - 1,3 MB (43 files) No transfers and so - less than one MB (one file).\n\nautonomy\nDPS - Depends on IE. May fail to IE6.0. Leaves registry entries and can change the logo OEM (assembly SamDrivers is disabled).\nDIA - Depends on the vb library and automatically installs them into the system.\nSDI - has no external dependencies, and works even in Windows PE. Leaves no residue in the system.\n\nthe indexing\nDPS - 280 seconds (4:40)\nDIA - 123 seconds (2:03)\nSDI - 19 seconds (13 seconds and 6 seconds indexing compression)\n\nNote: DPS and DIA were recovered and only handles inf files (v 1.2 GB), and SDI - inf files and in addition to them another cat files. The total volume of all the files - 2GB. Thus, SDI is necessary to treat a much greater volume of information.\n\nStartup time\nDPS - 10 sec\nDIA - 3 sec\nSDI - 0,5 sec\n\nThe method of installing the drivers\n\nDPS - devcon.exe. Identical to the unit via the Device Manager.\nDIA - DPInst.exe. Decides which drivers to update and may refuse to install the appropriate drivers. Copies files itself, sometimes leading to an incomplete installation.\nSDI - Win32API. Identical to the unit via the Device Manager. Automatically clicks &quot;continue&quot; during the installation of unsigned drivers.\n\n\nranking drivers\n\nDPS - For each device selected only one driver. Rest are discarded at an early stage and are not even mentioned in the logs.\nDIA - to create a common list of eligible drivers within drayverpak. Ranking of drivers from different drayverpakov not performed.\nSDI - For each device creates a list of all the drivers found drayverpak. The list is sorted so that the most appropriate drivers are closer to the top, and the first driver, and just offered to the default setting.\n\n\nLoading drayverpakov from the Internet\n\nDPS - Configurator allows you to select what you need to upload drayverpaki. Update drayverpakov and the need to update the definition is not provided.\nDIA - None.\nSDI - It is possible to upgrade the program and drayverpaki (old replaced by new ones). If the load indices, we can determine what drayverpaki contain updated drivers and upload them only.\n\nHow to get an update on the distribution?\n\nSince the update occurs in the same folder where already downloaded the previous version, requires a few additional steps in order to avoid possible problems.\n\nMethod 1 (easy)\n\nTake away the old torrent with downloaded data.\nDownload new torrent and start the download.\n????\nPROFIT !!!\n\n\nMethod 2 (wiser)\n\nTake away the old torrent, but the data is stored.\nDownload new torrent.\nUncheck &quot;Start download&quot; or stop the download if it has already begun.\nIn the context menu, select the action at hand &quot;Force re-check&quot; (Calculate the hash).\nUpon completion of testing, you can start the download.\nTo delete old drayverpakov can run the file del_old_driverpacks.bat.\n\nHow to burn to a DVD collection?\n\nTo write assembly on DVD does not necessarily create an ISO image (although you can do it), as Man About Town program and staffing the Windows disc recorder able to record directly from a folder.\n\n\nStart the program and in the required settings.\nRemove from folder logs.\nIf you are recording on a single-layer DVD, it should be removed from my drivers:\nDP_Biometric_14091.7z\nDP_Printer_14084.7z\nDP_Telephone_14091.7z\nDP_Touchpad_Alps_14092.7z\nDP_Touchpad_Cypress_14060.7z\nDP_Touchpad_Elan_14092.7z\nDP_Touchpad_Others_14084.7z\nDP_Touchpad_Synaptics_14092.7z\nDP_TV_Others_14060.7z\nDP_Video_Others_14074.7z\nDP_Video_Server_14092.7z\nTransfer the files to a DVD, and then click &quot;Write these files to CD.&quot;\n\nPlatform: Windows 2000/2003 / XP / Vista / 2008/7/8 / 8.1\nBit depth: 32bit + 64bit\nLanguage: Multilingual\n\nSystem Requirements: Windows 2000 and the presence of a pair of gigabytes of free space on the system hard drive to unpack temporary files [/b]","torrent":{"xt":"urn:btih:968ffbacf66415d2bc098bec490e4397ff3f225e","amp;dn":"Snappy+Driver+Installer+R139-%3DTEAM+OS%3D-%7BHKRG%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"968ffbacf66415d2bc098bec490e4397ff3f225e","infoHashBuffer":{"type":"Buffer","data":[150,143,251,172,246,100,21,210,188,9,139,236,73,14,67,151,255,63,34,94]},"announce":[],"urlList":[]}}