{"title":"Calvin Harris - Ready For The Weekend  (2nafish)","uid":5207197,"size":138444804,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:972b93acf9a3eb67282eda285e830d57cb70028e&amp;dn=Calvin+Harris+-+Ready+For+The+Weekend++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1260428091,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Ready for the Weekend&quot; is a song recorded by Scottish born DJ, producer, and vocalist, Calvin Harris. It is the second single released from his second studio album, Ready for the Weekend.\n\nA music video for the song was shot and released. It premiered on July 4, 2009, broadcast in the United Kingdom on T4 at 11:00 am. FHM model, Lauren Pope makes an appearance in the video. Several dancing females appear wearing red leotards to match Harris' magic portal, shirt and furniture. They next &quot;change into blue and yellow zip-up bathing suits, expanding the palette and multiplying endlessly, just in time for the weekend.&quot;\n\nOn July 23, 2009, it was reported that the video was removed fromdue to a copyright claim from another party. Harris stated that he was upset it had occurred and believed that the British Phonographic Industry had prompted the removal.\n\nThe song features guest vocals by British singer Mary Pearce, who previously worked as a backup vocalist for Beverley Knight, Lionel Richie and Chaka Khan. Remixes by High Contrast, Fake Blood and Dave Spoon were also announced. It made its world debut on June 12, 2009 with Pete Tong on BBC Radio 1. On July 13, 2009 it was the Popjustice song of the day. Harris performed the song at the iTunes Live Festival '09 on July 18, 2009 in London. It debuted on the UK Singles Chart at number three on August 16, 2009.\n\nReady for the Weekend is the second album by Scottish Pop musician Calvin Harris. It was first released in Australia on August 14, 2009 and was released in the United Kingdom on August 17, 2009. It was released on August 18, 2009 on digital format and on October 6, 2009 in CD format in the United States by Ultra Records. It was certified as Gold in the UK October 16, 2009 for sales of 100,000 copies.\n\nCalvin Harris (born Adam Richard Wiles on 17 January 1984 in Dumfries, Scotland) is a Scottish electronic musician, singer-songwriter and record producer. His gold-selling debut album, I Created Disco, was released in 2007 and contained the Top 10 singles &quot;Acceptable in the 80s&quot; and &quot;The Girls&quot;. He has written and produced records for other recording artists including Kylie Minogue's X and his number 1 collaboration with British rapper Dizzee Rascal, &quot;Dance Wiv Me&quot;.\n\nHis second studio album Ready for the Weekend was released on 17 August 2009 and reached number 1 in the UK Album Charts on 23 August. It contains the number 1 single &quot;I'm Not Alone&quot; the UK Top 5 Single &quot;Ready for the Weekend&quot;, which was released on 10 August and the track &quot;Flashback&quot; which was released as the third single from the album on 2 November.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:972b93acf9a3eb67282eda285e830d57cb70028e","amp;dn":"Calvin+Harris+-+Ready+For+The+Weekend++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"972b93acf9a3eb67282eda285e830d57cb70028e","infoHashBuffer":{"type":"Buffer","data":[151,43,147,172,249,163,235,103,40,46,218,40,94,131,13,87,203,112,2,142]},"announce":[],"urlList":[]}}