{"title":"Sexually Broken--Thick and juicy MILF Mellanie Monroe drilled de","uid":9391768,"size":844072926,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:974e019a07e45f4e0b1f25e7e359645e37471161&amp;dn=Sexually+Broken--Thick+and+juicy+MILF+Mellanie+Monroe+drilled+de&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1387897015,"description":"Thick and juicy MILF Mellanie Monroe drilled deep by 10 inches of BBC, merciless sucking &amp; fucking! | Mellanie Monroe | Matt Williams\n\nDecember 23, 2013\n\n\nMP4 only.\n\n\nBlonde and bubbly Mellanie Monroe is about to get the dicking down of her life. We have 10 inches of chocolate thunder by the name of Jack Hammer that is going to fuck her into next week. Even an experienced cock slut like Mellanie isn't going to be forgetting today anytime soon.\n\nBound in a strict box tie that perfectly displays her juicy breasts and a leather blindfolded cinched over her face, Mellanie awaits her fate on the legendary Sexuallybroken bed. She is about to be rag dolled fucked all over this mattress. Jack walks up and owns the back of her throat in one clean thrust. She can't see or anticipate the next stroke, the blindfold keeps her guessing. Her whole world is blackness and dick. Jack flips her back and forth, using whichever hole he is nearest to for his satisfaction as Mellanie moans and gasps with pleasure.\n\nEventually the blindfold is ripped off so that we can look her in the eyes while she is choking on our dick. Mellanie is woozy, fucked limp and cross-eyed. We don't let up. The dicking down is bone-rattling and relentless. Jack is tattooing his name onto her pussy with his cock. A vibrator is added to the mix and sends Mellanie spiraling into sexual subspace as she cums helplessly. She does't even remember her own name at this point, she is just an animal in heat.\n\nTo properly finish her off, we cranks this bound beauty into a challenging hogtie and leave her languishing and suffering on the well used bed. Mellanie suffers, unable to move or shift for even a sliver of relief. What a well trained pet this one is. Good girl Mellanie. We will be back later... \n \nScreens  &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2013/12_23mmonroe2/SexuallyBroken-Mellanie-Monroe-Matt-Williams-Thick-and-juicy-MILF-Mellanie-Monroe-drilled-deep-by-10-inches-of-BBC-merciless-sucking--fucking.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2013/12_23mmonroe2/SexuallyBroken-Mellanie-Monroe-Matt-Williams-Thick-and-juicy-MILF-Mellanie-Monroe-drilled-deep-by-10-inches-of-BBC-merciless-sucking--fucking.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:974e019a07e45f4e0b1f25e7e359645e37471161","amp;dn":"Sexually+Broken--Thick+and+juicy+MILF+Mellanie+Monroe+drilled+de","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"974e019a07e45f4e0b1f25e7e359645e37471161","infoHashBuffer":{"type":"Buffer","data":[151,78,1,154,7,228,95,78,11,31,37,231,227,89,100,94,55,71,17,97]},"announce":[],"urlList":[]}}