{"title":"Young As They Cum 6 (xvid) - anal, Taylor Rain + Shyla Stylez !","uid":4693655,"size":730417189,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:98a472060018c33769b23d3e256f3871cef8a928&amp;dn=Young+As+They+Cum+6+%28xvid%29+-+anal%2C+Taylor+Rain+%2B+Shyla+Stylez+%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mechanixx","files":3,"time":1233482776,"description":"Young As They Cum 6 \n\n\n\n\nscreens + large DVD-covers:\n &lt;a href=&quot;\nhttp://pix4porn.blogbugs.org/6380121/Young-As-They-Cum-6---screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pix4porn.blogbugs.org/6380121/Young-As-They-Cum-6---screens.html&lt;/a&gt;\n\n\n\n\n\n\n\n\nActresses\n\n    * Felix Vicious             \n    * Gen Padova                \n    * Lacey Barnes              \n    * Shyla Stylez              \n    * Taylor Rain               \n\n\n\n\n   \nScene Breakdowns\n\n    * Scene 1. Lee Stone, Shyla Stylez\n    * Scene 2. Mario Rossi, Taylor Rain\n    * Scene 3. Dillon Day, Felix Vicious\n    * Scene 4. Gen Padova, Julian\n    * Scene 5. Lacey Barnes, Tony Tedeschi\n\n\n1&gt; Shyla &amp; Lee Stone. On bed. Topless. Handjob. BJ. No hands BJ. Kisses.    \n     Eats &amp; fingers her. Nude. Screwing on her back &amp; clit solo, doggy      \n     position, on her belly, cowgirl riding, reverse cowgirl &amp; clit         \n     solo, on her back. He strokes off on her chin.                     8.80\n2&gt; Taylor &amp; Mario. On sofa. Nude. Eats her. Rims her. Fingers her ass.      \n     BJ. 2 fingers her ass. Anal doggy position, rev cowgirl as he fing-    \n     ers her, on her back, side saddle. Open mouth facial. BJ cleanup.  8.90\n3&gt; Felix &amp; Dillion. In room. Touching. Topless. Titty play. Nude. Eats      \n     her, 2 fingers her. Titty sucking. No hands BJ. Screwing reverse       \n     cowgirl, from behind her, on her back. P2M. Screwing on her back,      \n     side saddle &amp; clit solo. Open mouth facial. BJ clean off.          8.80\n4&gt; Gen &amp; Julian. On sofa. BJ. Nude. Screwing her from behind, on her        \n     back, on her back with both legs up, side ways. He strokes off on      \n     her face &amp; in her open mouth. BJ clean off.                        8.70\n5&gt; Lacey &amp; Tony Tedeschi. On sofa. Topless. Eats her. Nude. Eats her.       \n     BJ. Large back tattoo. Screwing reverse cowgirl, doggy position,       \n     from behind her, on her back, side ways. He strokes off on the         \n     side of her face.                                                  8.70\n\n\nLength: \t90 Minutes\nLanguage: \tEnglish \nStudio: \tDigital Sin catalog\nSeries: \tYoung As They Cum\nRelease Date: \t09/11/2002\n\n\n\nREVIEW:\n\n\n So in our first scene we see Canadian cutey Shyla sporting her new boobs which look good to me just don't think she needed the work but it is up to her so if it makes her feel better then I am all for it. Here she is working with Lee Stone and Shyla starts off taking his cock into her mouth expertly using her tongue and hands to pleasure his cock. Shyla goes fast then slow in sucking Lee's cock. Next Shyla's pretty pussy gets some attention both with Lee's tongue as well as a few fingers. The penetrations start with a nice missionary and Shyla looks fabulous with her legs spread wide open!!! She rubs her pussy with her fingers to accentuate the pleasure and we get to see her tits bounce around pretty good even if they are enhanced. After mish they switch to doggy and now we get a nice view of Shyla's curvacious ass. Shyla then climbs on in cowgirl which again shows off her great ass. The action soon shifts to one of my favorite positions, reverse cowgirl. You get a great shot of Shyla's rack and a wide open pussy shot. This goes on for a bit before they go back to mish briefly as he soon pulls out for a nice big pop on her face. A nice opening scene.\n\nOur next little setup takes place in a bar and features Taylor Rain working with Mario. We see Taylor flirting with the bar keep, Mario, and soon enough his tongue is buried in her pussy!!! The two then switch positons and Taylor starts sucking Mario's cock all the while glancing up with her eyes every so often. The penetrations start with doggy and Mario thrusts fast and then slow in this position. We next see Taylor in reverse cowgirl anal and Mario really has her legs spread as his cock spears her ass. They next move to missionary anal and this is an ok position, I think it would look better if she had larger breasts so they could sway around as he enters her ass, but here he certainly pounds her ass hard nonetheless. After moving to a kinda sideways anal he pulls out and shoots a load in her left eye,lol, and then the rest makes it into her mouth and on her face. Taylor does some nice cleanup.\n\nOur next scene will feature a petite blond named Felix and her she is working with Dillon Day. Felix looks quite fetching as she walks down the stairs. Soon she is sitting on a couch flirting with Dillon and soon enough he is rubbing her shoulders. Not long after her top is removed showing off two very nice breasts. Dillon then rubs them a bit before removing her panties and he gets down there for some nice pussy loving. This leads into the blowjob portion of the scene and Felix looks great with a cock going in and out of her mouth. She pays attention to his whole cock including his balls. Felix also gives some great eye contact. The penetrations begin with a great bouncing reverse cowgirl. The action then moves to doggy and this really shows off her nice ass. We even get some skull fucking for a brief period before Dillon enters her in mish. We also get a nice sideways penetration on the couch and this really showcases her great looking pussy. Soon there is a pullout and Dillon delivers a pretty weak pop for Felix, a not so great ending to a pretty good scene.\n\nOur next vixen is called Gen and here she gets to work with Julian. After getting a knock at the door Gen hangs up the phone and goes to answer the door. She is quite pleased with who is out there as she is almost immediately sucking his cock,lol. Soon the action moves to the doggy position. We then see a very wet cock entering Gen's pussy in missionary. This lasts for a brief time before Julian enters her in a sideways penetration. This too is brief in duration before we see a pull out and a good pop on her face. Gen also does nice cleanup.\n\nThe next scene features Lacey and she is studyin with Tony Tedeshi and I think we know what is on his mind,lol. However, it is Lacey who makes the first move by standing up and lifting up her shirt revealing some nice pert breasts. Sensing study time is over the tow get a lot more nude,lol, and Tony finds himself between Lacey's legs licking her pussy. I like the way Lacey's hair looks in this scene. Tony really works her pussy over with his tongue. Soon it is Lacey's turn to wrap her lips around some cock and she does so in a nice deliberate pace. Lacey sucks cock for a bit more then she climbs on in reverse cowgirl and Tony's cock really fills her tight pussy. The action then shifts to a semi-standing doggy. They then move to mish with Lacey lying on a couch as Tony pounds away at her pussy. We get another sideways penetration leading to a pop on her face but she keeps her mouth closed and there is no cleanup sucking. This was a fairly standard teen themed film with the action being good for the most part but not great. There was only one anal that I recall and then in the last scene the girl kept her mouth closed like she didn't want the facial so that lessened the enjoyment for that scene. I have seen Shyla do much better scenes but she still looks fabulous here. I would recommend this as a rental and if you can find this film in the $10 range then you might consider a purchase if you're a fan of a couple of the girls. \n\n\n\n\n\n\n.","torrent":{"xt":"urn:btih:98a472060018c33769b23d3e256f3871cef8a928","amp;dn":"Young+As+They+Cum+6+%28xvid%29+-+anal%2C+Taylor+Rain+%2B+Shyla+Stylez+%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98a472060018c33769b23d3e256f3871cef8a928","infoHashBuffer":{"type":"Buffer","data":[152,164,114,6,0,24,195,55,105,178,61,62,37,111,56,113,206,248,169,40]},"announce":[],"urlList":[]}}