{"title":"[PSX] Metal Gear Solid [2-Disc] [NTSC]","uid":7556762,"size":847693734,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:98dc554ae95375f24f856c9a0eef1854aa425742&amp;dn=%5BPSX%5D+Metal+Gear+Solid+%5B2-Disc%5D+%5BNTSC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big_dude","files":-1,"time":1345593947,"description":"Metal Gear Solid for Playstation One                  Rel. 09/03/1998\n\n \n\nFormat:        CD-R NTSC-USA\nLang.:         English\nDiscs:         2\nImage:         CCD/IMG/SUB\nRating:        Mature\nRequirements:  Modded/Chipped Playstation or Ps2, Breaker Pro/Boot-cd, \n               Game Enchancer/Built-in Mod, or psx emulator.\n               (You only need to use one of these mentioned methods)\n\n\nCompressed with 7zip. Game was tested and works.\n\n\n\nNote: No Psone Backup Disc/game or copy will work unless your Psone or Ps2 \n      Console is modded, or if you use a Boot Disc like Breaker Pro, or\n      Use a Game Enchancer Plug in Port which is like a boot disc and\n      Can Load Backups.\n\n\n\nRelease Notes - Psx emulator is included if you need it.\n\n\n\nGame Description:\n\nMetal Gear Solid is a sequel to Metal Gear 2: Solid Snake. After the tragic confrontation with Big Boss, the hero, special agent Solid Snake, decided to retire and has since then lived in a secluded region in Alaska. But the US government recruits him once again for a dangerous mission. The members of Foxhound, a renegade special forces unit, threaten to use a devastating nuclear weapon if the government doesn't hand them the mortal remains of Big Boss, their former commander. Foxhound is now led by a talented, ambitious young man with the codename Liquid Snake. Knowing that the visual resemblance between this new terrorist mastermind and himself can not be coincidental, Solid Snake agrees to infiltrate the new Foxhound base, destroy the unknown nuclear weapon, and find the truth about his own identity.\n\nThe gameplay in Metal Gear Solid follows the prototype established in the two earlier Metal Gear games. Solid Snake has a limited arsenal of weapons and cannot allow himself to pave his way to the goal by killing all the enemies. He has to stay unnoticed, hide, crawl, wait for the right moment, sneak, and use various gadgets that will prevent him from alerting the enemy. Boss battles and some other sequences are played out as action-oriented set pieces, with the player having to figure out the weakness of the enemy in order to succeed. \n\nThe game utilizes traditional top-down view, but the graphics in this installment are real 3D. Conversations with Snake's allies and cutscenes are used extensively to advance the plot and gain more insight into it. \n\n\nGame Pics Included.\n\n\nBurn with Alcohol 120% (Included).\n\n\nSet DataType to Playstation (Write Method Raw/Dao) and burn at 8x Speed.\n\nUse Verbatim or Tayio Yuden CD-R Media for best quality, or if other media isn't\nworking.\n\n\nIf this is working fine for you let us know post a comment.\n\n\nPlease Seed This When your done.\n\n(I Can't seed 24/7 do your part and seed to keep the torrent healthy).\n\n\n\n\nEnjoy!\t\t","torrent":{"xt":"urn:btih:98dc554ae95375f24f856c9a0eef1854aa425742","amp;dn":"%5BPSX%5D+Metal+Gear+Solid+%5B2-Disc%5D+%5BNTSC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98dc554ae95375f24f856c9a0eef1854aa425742","infoHashBuffer":{"type":"Buffer","data":[152,220,85,74,233,83,117,242,79,133,108,154,14,239,24,84,170,66,87,66]},"announce":[],"urlList":[]}}