{"title":"Anthrax - Alive 2 (2005)DVD9 NLtoppers","uid":7276186,"size":8207911993,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9a1f5e7a880a8c1573832173058df465d4a5da8a&amp;dn=Anthrax+-+Alive+2+%282005%29DVD9+NLtoppers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ChickieChicken","files":-1,"time":1337289411,"description":"Earlier this year Anthrax reformed the classic lineup which was at the forefront of thrash metal for most of the 1980's. This lineup has not existed since since 1992, when singer Joey Belladonna was asked to leave the band, due to their wanting to go in a different direction. Three years later, lead guitarist Danny Spitz departed. John Bush (formerly of Armored Saint) joined up as their vocalist for the next thirteen years, creating some great new Anthrax music. But, that era will never replace the Belladonna era in my heart as the Anthrax I love most. So, back to 2005, It is the 20th anniversary of the release of their seminal album Spreading the Disease and seemed like the perfect time to get together and see what would happen. This DVD, and subsequent tour are some of the results of that fateful moment.\n \nThis concert was recorded on June 3, 2005 at the Starland in Sayreville, NJ and is completely comprised of material from the first era of Anthrax. The band took to the stage, announcing that they were filming for the DVD, and started into &quot;Among the Living.&quot; They sounded very good, as if they had never parted ways so long ago.\n \nFrank Bello was stomping back and forth across the stage, acting the madman. Scott Ian was jumping and stomping, while Danny Spitz played the straight man to his antics. Charlie Benante, steady as ever behind the drum kit, continuing to show his prowess, proving that he is one of the best in the business. Meanwhile, Joey Belladonna is like a kid in a candy store. He looked so happy to be back with his old crew, and still having a great voice. It may not be as strong as it was 15 years ago, but it is still great.\n \nEach of their albums is represented here, from Spreading the Disease through Persistence of Time. We even get their crossover hit, &quot;I'm the Man.&quot; Old school thrashers &quot;Deathrider&quot; and &quot;Medusa&quot; mixed in with mainstays &quot;Caught in a Mosh&quot; and &quot;Indians.&quot; Their Joe Jackson cover, &quot;Time,&quot; is not to be left out.\n\nTracklist:\n \n 01. Among the living\n 02. Caught in a mosh\n 03. A.I.R.\n 04. Madhouse\n 05. Efilnikufesin (N.F.L.)\n 06. Deathrider\n 07. Medusa\n 08. In my world\n 09. Indians\n 10. Time\n 11. I`m the man\n 12. Be all end all\n 13. I am the law\n 14. Credits\n \nExtra`s:\n \n01. Documentary\n 02. State of Euphoria\n 03. Juliya interview\n 04. Touring tales\n 05. The vaccine\n 06. Photo gallery\n\nFormat: DVD-9\nSource: DVD-9\nAudio: DD-5.1\nSubs: None\nLanguage: English\nGenre: Music\n\nVoor jullie van Ons\n\nBy Chickie :D ","torrent":{"xt":"urn:btih:9a1f5e7a880a8c1573832173058df465d4a5da8a","amp;dn":"Anthrax+-+Alive+2+%282005%29DVD9+NLtoppers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a1f5e7a880a8c1573832173058df465d4a5da8a","infoHashBuffer":{"type":"Buffer","data":[154,31,94,122,136,10,140,21,115,131,33,115,5,141,244,101,212,165,218,138]},"announce":[],"urlList":[]}}