{"title":"Jim Hall - Jazz Guitar (1957 - TOCJ 9318)","uid":8635035,"size":161509065,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9acd4ead2464180ee117c13c23f9efe20925b542&amp;dn=Jim+Hall+-+Jazz+Guitar+%281957+-+TOCJ+9318%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"froogAL","files":-1,"time":1372721703,"description":"eac secure cue log scans\n\nJim Hall's debut as a leader has a somewhat tortured history. The original LP had ten tracks, though producer Richard Bock edited six of them for a later pressing and also inexplicably overdubbed Larry Bunker's drums (he wasn't originally present) on a third pressing. Over time the complete versions of the six edited tunes were lost or discarded, and the master of &quot;This Is New&quot; suffered the same fate. By the time of this 1988 reissue, none of the missing material could be located, although &quot;Too Close for Comfort&quot; and a longer alternate take of &quot;Things Ain't What They Used to Be,&quot; both of which had been issued on separate Pacific Jazz anthologies but not on the original LP or subsequent reissues, were added to the CD, which has long since lapsed from print as well. The music deserved a better fate. Jim Hall grew into one of the most respected guitarists in jazz, and his original concept was damaged by Bock's senseless tinkering, since it was the solos of bassist Red Mitchell and pianist Carl Perkins (whose discography is already limited enough due to his premature death) that shortened or removed by the original producer. Nevertheless, what remains is still a valuable introduction to the long, successful career of Jim Hall. The music sticks to familiar standards from the swing era and is often low key, much like the man himself. A waltzing &quot;Thanks for the Memory&quot; is a fine example of Hall's lyricism, while other unedited songs, like the lively &quot;9:20 Special,&quot; gives us a glimpse of what the overall album sound might have been like. The original LP will continue to command high prices in jazz auctions, but this CD will also command a premium unless it is eventually reissued, even in its shortened form. ","torrent":{"xt":"urn:btih:9acd4ead2464180ee117c13c23f9efe20925b542","amp;dn":"Jim+Hall+-+Jazz+Guitar+%281957+-+TOCJ+9318%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9acd4ead2464180ee117c13c23f9efe20925b542","infoHashBuffer":{"type":"Buffer","data":[154,205,78,173,36,100,24,14,225,23,193,60,35,249,239,226,9,37,181,66]},"announce":[],"urlList":[]}}