{"title":"Talk Talk - I Believe in You [promo].VOB","uid":7807385,"size":94324736,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9b90dfe6a4e4c9119758f09ae87d1d40685e6932&amp;dn=Talk+Talk+-+I+Believe+in+You+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1352437936,"description":"Talk Talk - I Believe in You [promo].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;I Believe in You&quot; is a song from Spirit of Eden, an album by the English band Talk Talk, released in 1988. Critical reception on release was mixed, and it was not a commercial success; though its reputation has improved over the years, and it is now seen by some critics as influential to post-rock, a music genre that developed in Britain and North America in the 1990s. \n\nThe songs were written by Mark Hollis and Tim Friese-Greene, and performed by numerous musicians using a diverse combination of instruments. The album developed from a lengthy recording process at Wessex Studios, London during 1987 and 1988: often working in darkness, the band recorded many hours of improvised performances, edited them down heavily, then arranged the remaining pieces into an album using digital equipment. The end product includes elements of rock, jazz, classical, and ambient music. The album, the fourth by the band, was released on the Parlophone record label, an imprint of EMI. \n\nIn 2008, Alan McGee of the Guardian wrote: &quot;Spirit of Eden has not dated; it's remarkable how contemporary it sounds, anticipating post-rock, The Verve and Radiohead. It's the sound of an artist being given the keys to the kingdom and returning with art.&quot; \n\nTalk Talk began as a quartet consisting of Mark Hollis (vocals), Simon Brenner (keyboards), Lee Harris (drums) and Paul Webb (bass guitar). They were generally associated with the New Romantic movement; more specifically, in their early years, they were often compared with Duran Duran, as both bands sported a name which was a single word repeated twice, a Roxy Music-inspired musical direction, and shared the same record label (EMI) and producer (Colin Thurston). \n\nIn their later years the band's commercial appeal receded, but their critical reputation increased as they moved from synthpop to a more experimental form. Their final two albums, Spirit of Eden and Laughing Stock, were highly acclaimed and remain influential to experimental alternative rock genres, especially post-rock. \n\nTalk Talk's influence upon musicians has exceeded the band's visibility among the general public. Along with the band Slint, Talk Talk are credited with inventing post-rock in their last two albums, Spirit of Eden and Laughing Stock. Sigur Ros has played Talk Talk songs before their shows. \n\nBands and artists that have claimed to be influenced by and/or a fan of Talk Talk include Portishead, Bark Psychosis, The Catherine Wheel, Lights, Radiohead and DJ Shadow. The band Weezer covered their song &quot;Life's What You Make It&quot; and No Doubt scored a hit with a cover of &quot;It's My Life&quot; in 2003. John Taylor of Duran Duran also has expressed fondness for the group; Talk Talk opened for Duran Duran back in 1982. \n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Spirit_of_Eden&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Spirit_of_Eden&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/AAfDdAAEM&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/AAfDdAAEM&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x576 (4:3) 25fps 9000kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 320kbps\n   Duration: 00:03:44\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.6.4\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:9b90dfe6a4e4c9119758f09ae87d1d40685e6932","amp;dn":"Talk+Talk+-+I+Believe+in+You+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b90dfe6a4e4c9119758f09ae87d1d40685e6932","infoHashBuffer":{"type":"Buffer","data":[155,144,223,230,164,228,201,17,151,88,240,154,232,125,29,64,104,94,105,50]},"announce":[],"urlList":[]}}