{"title":"The Training of O----ToO-31100 Bailey Blue","uid":8553114,"size":3640291738,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:9c04a66e0f24205cefdbe87b97fb8fe542e016c2&amp;dn=The+Training+of+O----ToO-31100+Bailey+Blue&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"merzedes","files":-1,"time":1370698180,"description":"\nTraining a Slut Girl to Fuck Better, Day One\n\nJun 7, 2013 - Performers: Bailey Blue \n\n\nMP4 and WMV + Pics.\n \n\nthe Interview\nSitting across from me, long, toned legs rise up and disappear under a short white skirt. Underneath, sheer black panties two sizes too small stretch across firm ass cheeks, and they fail to completely contain her thick pussy lips. A tight waist gives way to lush natural tits tipped with tender nipples. Cleavage leads to the nape of her delicate neck and up to pouty, slutty lips that beg to be fucked. Her gaze is submissive and she cannot hold it for long before looking down. Her pheromones are pulsing, inflating her aroused anticipation. She is excited and nervous. I can almost smell her cunt. \n\nAs we talk about her desires the sound of her voice falls on me like a fine linen, soft and comforting. The meter and tone are sultry, pretty, soothing. When I ask about her past failures, that pretty voice breaks a little. Her gaze stiffens slightly. She knows exactly what I am talking about. She has failed me before. \n\nthe Sticks\nDown the rabbit hole we go, picking up sticks along the way. Dragging her down the castle corridors to the set, I watch her sexy gait. She has poise. Maybe too much poise for day one. Almost there, her arms are already aching, full of heavy wooden sticks. Dots of perspiration appear on her brow. \n\nOn the set she realizes there are many, many more sticks. Dozens of post cut offs strewn through the room require her immediate and orderly attention. However, she seems to finds it hard to be orderly when stripped half naked and whipped by a horny sadist. \n\nShe fails me again. \n\nthe Dicks\nHer pouty lips look so sexy as they struggle to stretch across the thick rubber cock that I am slowly working into her mouth. Her eye lids tremble and her cunt goes wet. I tighten the fist in her hair and tell her to drool. \n\nWhen she squats over the tip of the floor mounted dildo, her pussy just brushes the tip. Her thighs are parallel to the floor. I give the order: stay. The stress of the position has her crumbling in seconds. I guess there is a difference between having toned thighs and actual strength. I make her a deal: I want 30 seconds of suffering, but I don't get it. She fails me again. \n\nI send her to a corner along with her two failures to reconsider just what she thinks she is doing here in My World. \n\nthe Begging\nShe wants to play again. I want to see submission. Not lip service. I want the concrete manifestation of a slave offering a piece of herself to me. \n\nShe says she hates the cattle prod, but she doesn't say no. I want to see her beg for something she hates. \n\nthe Eleven\nBailey has given up so much to us today, what more could we ask for. I want to see her on her back, legs spread, pussy stuffed and reamed. I stretch that tight cunt with the steel cock named &quot;The Eleven&quot;. \n\nthe Homework\n- identify five instances of failure that have led to notable success.\n- summarize the Where, What, Who, When and Whys of the Stonewall Riots.\n\nScreens &lt;a href=&quot;\nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=31100&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=31100&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:9c04a66e0f24205cefdbe87b97fb8fe542e016c2","amp;dn":"The+Training+of+O----ToO-31100+Bailey+Blue","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c04a66e0f24205cefdbe87b97fb8fe542e016c2","infoHashBuffer":{"type":"Buffer","data":[156,4,166,110,15,36,32,92,239,219,232,123,151,251,143,229,66,224,22,194]},"announce":[],"urlList":[]}}