{"title":"Boy Still Missing - John Searles.epub","uid":9089182,"size":274893,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9ddca5e7cfe0c5d044042e87dadd0cacb6ab35c4&amp;dn=Boy+Still+Missing+-+John+Searles.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"Mohammad_AT","files":1,"time":1382556802,"description":"Boy Still Missing. It is June 1971 and Dominick Pindle, a tenderhearted but aimless Massachusetts teenager, spends his nights driving around with his mother and dragging his wayward father out of bars. Late one evening Dominick's search puts him face-to-face with his father's seductive mistress, Edie Kramer. Instantly in lust, he begins a forbidden relationship with this beautiful, mysterious woman. Before long, though, their erotic entanglement leads to a shocking death, and Dominick discovers that the mother he betrayed had secrets as dark and destructive as his own.\n\nRapt with confusion and guilt as the startling facts about his family begin to emerge, Dominick heads to New York City in search of retribution and the truth about his mother's disquieting past. He soon finds refuge with Jeanny Garvey, a young, soulful idealist who might save him from his dire fate, but not before he makes a desperate choice that endangers everything he holds clear -- and puts both their lives at risk.\n\nCharged with the exhilarating narrative pace of a thriller and set during a complicated and explosive era, &quot;Boy Still Missing&quot; is a stunning debut novel. It renders a deeply affecting portrait of a boy whose passage into adulthood proves as complex and impassioned as the history that unfolds before his eyes.","torrent":{"xt":"urn:btih:9ddca5e7cfe0c5d044042e87dadd0cacb6ab35c4","amp;dn":"Boy+Still+Missing+-+John+Searles.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ddca5e7cfe0c5d044042e87dadd0cacb6ab35c4","infoHashBuffer":{"type":"Buffer","data":[157,220,165,231,207,224,197,208,68,4,46,135,218,221,12,172,182,171,53,196]},"announce":[],"urlList":[]}}