{"title":"Willis Alan Ramsey - Willis Alan Ramsey [1972][EAC,log,cue. FLAC","uid":8135325,"size":226730337,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9eb3e18cbefc87dfc16982a87bedadfcfd75c892&amp;dn=Willis+Alan+Ramsey+-+Willis+Alan+Ramsey+%5B1972%5D%5BEAC%2Clog%2Ccue.+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":13,"time":1360700459,"description":"MOJO Magazine: Buried Treasure &quot;Album That Time Forgot.&quot;\n\nArtist: Willis Alan Ramsey\nRelease: Willis Alan Ramsey\nDiscogs: 3750302\nReleased: 1972 / 1999\nLabel: Shelter Records / Koch Records\nCatalog#: SR2124 / KOC-CD-8019\nFormat: FLAC / Lossless / Log (100%) / Cue / CD, Reissue\nCountry: US\nStyle: Rock, Folk Rock, Country Rock\n\nTracklisting:\n\n01. Ballad Of Spider John\n02. Muskrat Candlelight\n03. Geraldine And The Honeybee\n04. Wishbone\n05. Satin Sheets\n06. Goodbye Old Missoula\n07. Painted Lady\n08. Watermelon Man\n09. Boy From Oklahoma\n10. Angel Eyes\n11. Northeast Texas Woman\n\nSince it came in the mail, Willis Alan Ramsey's self-titled debut from 1971, now being re-released by KOCH Records, has been working overtime in my cd player. Given that Lyle Lovett called this cd &quot;one of the greatest records of all time,&quot; I was predisposed to like it. I like it even more every time I hear it.\n\nIt's always been a little fantasy of mine to discover some obscure album in a record store that few people have heard of, but that was far ahead of its day. Timeless, even. The kind of album that contemporary artists refer to as a seminal influence on their work. Willis Alan Ramsey's record is just such an album. Recorded in 1971, with acknowledgements to Leon Russell, JJ. Cale, Russ Kunkel, Elliot Mazer, and Greg Allman in the liner notes, the list of artists Ramsey and his album have influenced is fairly impressive. Along with Lyle Lovett and the Allman Brothers, there's Shawn Colvin (who sings &quot;Satin Sheets&quot; on her album Cover Girl), Jimmy Buffett, America, Waylon Jennings, Jerry Jeff Walker, Leo Kottke, Rickie Lee Jones, and John Prine. And let's not forget Captain &amp; Tennille (more about them later).\n\nI also have a soft spot for singer-songwriter-musicians who take full artistic responsibility for the work they put out. I'm the kind of guy that would rather hear Kris Kristofferson sing &quot;Me and Bobby McGee&quot; than Janis Joplin. She may've been a better performer and vocalist than ol' Kris, but it's his damned song. Here again, Willis Alan Ramsey is my kind of guy. He wrote all the songs on this album, plays guitar, bass, and harmonica, co-produces, and, of course, sings. With all due respect to Kris Kristofferson, Ramsey is one songwriter who can sing. He possesses a pliant and expressive voice that seems to wrap itself differently around each song. At times he sounds a bit like James Taylor, and in my opinion he outsings all of the guys with whom he's commonly compared.\n\nThe song most people will recognize from this album is &quot;Muskrat Candlelight,&quot; which was immortalized by Captain and Tennille as &quot;Muskrat Love.&quot; Ramsey's original version sounds a whole lot better. For one thing, it doesn't seem the slightest bit corny (a quality I formerly ascribed in part to the lyrics, but now know was fully due to the Captain). For another, like the other songs on this album, Ramsey somehow manages to combine the best elements of folk, country, rock, jazz and blues to produce a sound that's infinitely listenable. It kinda reminds me of Brewer and Shipley's Tarkio Road in the way it makes me want to sit on a porch on a shady afternoon and contemplate smoking something. Not that you'd need to smoke anything, because the music has already provided a relaxed, happy, almost spiritual mood.\n\nSpeaking of sitting on porches, there's a popular story about Lyle Lovett and fellow Texan Robert Earl Keen Jr., back in their college days, sitting on their porch wearing nothing but underwear and guitars, serenading the neighbors across the street. I'd be willing to bet they were playing tunes by Willis Alan.\n\nMajor thumbs up to KOCH Records for re-releasing Willis Alan Ramsey. What a cool label, and KOCH Entertainment is a pretty cool distributing company too (they distribute, among many other indie labels, Righteous Babe Records, which has to be some kind of coolness barameter).\n\nOnly one question remains. Where is Ramsey now, and when is he going to show up on Austin City Limits for a triumphant hometown comeback?\n\nThis album rates a Groovy Factor of Five out of Five, which means I'm richer for owning it than I know how to express.\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:9eb3e18cbefc87dfc16982a87bedadfcfd75c892","amp;dn":"Willis+Alan+Ramsey+-+Willis+Alan+Ramsey+%5B1972%5D%5BEAC%2Clog%2Ccue.+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9eb3e18cbefc87dfc16982a87bedadfcfd75c892","infoHashBuffer":{"type":"Buffer","data":[158,179,225,140,190,252,135,223,193,105,130,168,123,237,173,252,253,117,200,146]},"announce":[],"urlList":[]}}