{"title":"Lemmy The Movie","uid":6074267,"size":736086710,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9ec4c8129b8202ea8d2d0ae72fa312a367926f75&amp;dn=Lemmy+The+Movie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"The_Evil_138","files":3,"time":1293758260,"description":"Lemmy The Movie 49% Motherfucker 51% Son of a Bitch\n\nMotorhead frontman Lemmy Kilmister has registered an immeasurable impact on music history. Nearly 65, he remains the living embodiment of the rock and roll lifestyle, and this feature-length documentary tells his story, one of a hard-living rock icon who continues to enjoy the life of a man half his age.\n\nShot on a combination of High Definition and Super 16mm film, &quot;Lemmy&quot; includes interviews with friends, family, bandmates past and present and such admirers/peers as Metallica, Slash, Dave Grohl (Nirvana/Foo Fighters), Ozzy Osbourne, Peter Hook (Joy Division/New Order), actor Billy Bob Thornton, wrestling superstar Triple H, Alice Cooper, Mick Jones of The Clash, and many more.\nCalled &quot;pure gold&quot; by WIRED, \n\n&quot;Lemmy&quot; made its world premiere in March 2010 at the South by Southwest Film and Music Festival, and has since collected rave reviews at film festivals around the globe. Variety remarked &quot;'Lemmy' rocks,&quot; and The Hollywood Reporter noted, &quot;You don't have to be a metalhead to love 'Lemmy.'&quot;\n\nRember a simple &quot;Thank You&quot; goes a long ways. Seed at least as much as you take. Keep this great movie about this great man alive. LEMMY IS GOD!!! ","torrent":{"xt":"urn:btih:9ec4c8129b8202ea8d2d0ae72fa312a367926f75","amp;dn":"Lemmy+The+Movie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ec4c8129b8202ea8d2d0ae72fa312a367926f75","infoHashBuffer":{"type":"Buffer","data":[158,196,200,18,155,130,2,234,141,45,10,231,47,163,18,163,103,146,111,117]},"announce":[],"urlList":[]}}