{"title":"Rivers Of London - Ben Aaronovitch   (Unabridged)","uid":8854942,"size":432684457,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a3b20e30bbea9825f612ca6b3a3f511b8eb3af8d&amp;dn=Rivers+Of+London+-+Ben+Aaronovitch+++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":5,"uploader":"Robin1966","files":14,"time":1377627613,"description":"Audio Books : Fantasy : MP3/128Kbps : English\n\n\nMy name is Peter Grant and until January I was just probationary constable in that mighty army for justice known to all right-thinking people as the Metropolitan Police Service (as the Filth to everybody else). My only concerns in life were how to avoid a transfer to the Case Progression Unit - we do paperwork so real coppers don't have to - and finding a way to climb into the panties of the outrageously perky WPC Leslie May. Then one night, in pursuance of a murder inquiry, I tried to take a witness statement from someone who was dead but disturbingly voluable, and that brought me to the attention of Inspector Nightingale, the last wizard in England. Now I'm a Detective Constable and a trainee wizard, the first apprentice in fifty years, and my world has become somewhat more complicated: nests of vampires in Purley, negotiating a truce between the warring god and goddess of the Thames, and digging up graves in Covent Garden . . . and there's something festering at the heart of the city I love, a malicious vengeful spirit that takes ordinary Londoners and twists them into grotesque mannequins to act out its drama of violence and despair. The spirit of riot and rebellion has awakened in the city, and it's falling to me to bring order out of chaos - or die trying.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:a3b20e30bbea9825f612ca6b3a3f511b8eb3af8d","amp;dn":"Rivers+Of+London+-+Ben+Aaronovitch+++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3b20e30bbea9825f612ca6b3a3f511b8eb3af8d","infoHashBuffer":{"type":"Buffer","data":[163,178,14,48,187,234,152,37,246,18,202,107,58,63,81,27,142,179,175,141]},"announce":[],"urlList":[]}}