{"title":"Gadget.Man.Series.3.6of9.Staying.In.720p.HDTV.x264.AAC.MVGroup.o","uid":12026008,"size":568657956,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:a4bf9bea2b34a672ac82016cd945acaa3b1ad0fe&amp;dn=Gadget.Man.Series.3.6of9.Staying.In.720p.HDTV.x264.AAC.MVGroup.o&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"artistharry","files":1,"time":1434524179,"description":"Gadget Man: Series 3\n\nTechnology Documentary hosted by Richard Ayoade, published by Channel 4 in 2014 - English narration\n      &lt;a href=&quot;\nhttp://docuwiki.net/images/2/27/Gadget-Man-Series-3-Cover.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/images/2/27/Gadget-Man-Series-3-Cover.jpg&lt;/a&gt;\n\nInformation\n------------------------------\n\nGadget Man: Series 3\nRichard Ayoade welcomes viewers to the world of gadgets and new technology - covering everything from the everyday to the extraordinary, Richard presents the third series. He still isn't finding life any easier. That's why he's continuing his crusade to find gadgets that can ease his pain...\n\n\n1)  Weather \nRichard Ayoade takes on the worst of the British climate, braving a hurricane in a wind tunnel with the help of Tim Vine to assess the best in gust-busting gadgetry. He's also joined by Marcus Brigstocke at the Hemel Hempstead Snow Centre to pressure-test cold-weather technology - with unexpected results. Finally, he reveals his bespoke survival raft built to withstand the meteorological apocalypse he's convinced is just around the corner.\n\n2)  Public Transport \nRichard Ayoade turns his attention to public transport, as Russell Howard joins him on the Tube to assess the effectiveness of gadgets designed to tackle poor air quality and extreme heat. Richard also takes to the London skies in a cable car to check out mobile entertainment devices, before riding a commuter train with Adam Buxton to test portable cleaning and sanitising devices. The show culminates in the unveiling of a prototype for a driverless taxi.\n\n3)  The Staycation \nRichard Ayoade and comedian Phill Jupitus go on a day out, testing a range of gadgets and technology, from the world's tiniest caravan to 360-degree cameras, 300lt rucksacks and a pair of trousers that transform into a picnic table. Back at home, Richard's technical team sources contraptions that allow him not only to visit Maidstone's Teapot Island from the comfort of the visitor car park, but also to join Phill on a taxing country hike - without expending any energy.\n\n4)  Shopping \nRichard asks farmer and foodie Jimmy Doherty to join him for a visit to the supermarket to trial gadgets designed to ease grocery shopping, including a robotic assistant, a fruit ripeness reader and a food ethics scanner. He then turns his attention to clothes shopping and heads to a department store, with actress Alison Steadman in tow, to test a 3D virtual mirror and a check out a mannequin with expanding bust and hips.\n\n5)  Self Improvement \nRichard investigates whether he can make himself a brighter, better man with the aid of gadgetry. First, he tests his reactions against TV anchorman Eamonn Holmes, before taking on actor Richard E Grant in a series of concentration challenges that involve controlling a Scalextric model car and flying a drone simply with mind power. The presenter also realises that to prosper in a battle with memory champion Dominic O'Brien he must resort to cheating.\n\n6)  Staying in \nRichard Ayoade showcases gadgets that highlight the benefits of staying home. Comedian Seann Walsh joins him to check out designs that deliver the health benefits of the great outdoors without the dirt and danger leaving the house can include. Richard then enjoys the company of mechanised pets before inviting comedian David Mitchell round to try out the latest gaming technologies. Lastly, he demonstrates live holographic broadcast technology that allows the host to party without the need for guests to attend, proving that leaving the home could be a thing of the past.\n\n7)  Cooking and Dining Out \nRichard Ayoade confronts the horror of cooking and dining out as he attempts to create his very own utopian eatery, consulting leading food scientists and checking out gadgets more at home in a laboratory than a kitchen. He invites guest Adrian Edmondson to join him at his unique bistro, complete with printed food, robot waiters, computerised wine sniffers, zero-calorie electronic starters, levitating desserts and transparent coffee.\n\n8)  Property \nRichard tackles property conundrums with the help of technology. An army of window-cleaning robots helps get the gadget house ready for viewings, interior designer Naomi Cleaver reveals garden pods dedicated to solving issues with home space, and Strictly Come Dancing co-host Claudia Winkleman joins the presenter on a tour of one of the country's most cutting-edge homes.\n\n9)  Guide to Christmas 2014 \nRichard and celebrity friends help improve Christmas with gadgets for shopping, to wrap presents, beat the weather, cook the dinner and even improve your carol singing\n\n\n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;9ed6f7f9f6ded2aab0af&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: 3232 Kbps\n * Video Aspect Ratio: 1.778 (16:9)\n * Video Resolution: 1280 x 720\n * Audio Codec: AAC LC\n * Audio English\n * Audio Bitrate: 160 kb/s VBR 48 KHz\n * Audio Channels: Stereo 2\n * Run-Time: Parts 1- 8 = 24mins - Part 9 = 47mins\n * Framerate: 25 fps\n * Number of Parts: 9\n * Container Mp4\n * Part Size: Parts 1-8 = 542 MB - Part 9 = 1.05 GB\n * Source: HDTV\n * Encoded by: Harry65","torrent":{"xt":"urn:btih:a4bf9bea2b34a672ac82016cd945acaa3b1ad0fe","amp;dn":"Gadget.Man.Series.3.6of9.Staying.In.720p.HDTV.x264.AAC.MVGroup.o","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4bf9bea2b34a672ac82016cd945acaa3b1ad0fe","infoHashBuffer":{"type":"Buffer","data":[164,191,155,234,43,52,166,114,172,130,1,108,217,69,172,170,59,26,208,254]},"announce":[],"urlList":[]}}