{"title":"Sassy.Sue[DVDrip]Xvid[WhaleD]","uid":4197787,"size":763356465,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a58154ffa47aa6401e50ea6673424d785dff1f28&amp;dn=Sassy.Sue%5BDVDrip%5DXvid%5BWhaleD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"circlensess","files":3,"time":1211321868,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0147337/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0147337/&lt;/a&gt;\n\nTagline: He Went Fishin&amp;#039;... But Ended Up As The Bait!\n\nCast (Credited cast)\n       John Tull                ...     Junior\n        Colleen Brennan         ...     Dolly Lee (as Sharon Kelly)\n        Patrick M. Wright       ...     Pa (as Patrick Wright)\n        Tallie Cochrane         ...     Dottie Lou (as Talie Cochrane)\n        Harvey Shain            ...     Hutch\n        Rachel Wolfe            ...     Ma\n        Harvey Forman\n\n\nThere&amp;#039;s hillbilly hanky-panky of the hottest kind with a family that includes a lecherous, corncob-puffin&amp;#039; Pa; his wife, who enjoys watching her husband&amp;#039;s adulterous encounters; and their virginal hayseed-of-a-son. Sharon Kelly (later porn star Colleen Brennan) stars.&quot;\n\n&quot;Sassy Sue is a good reason for why you shouldn?t sleep with family members. It?s like a Norman Rockwell painting except with beaver shots, bestiality, masturbation, alcoholism and incest.&quot;\n\n&quot;Another Harry Novak / Bethel Buckalew backwoods ballathon, Sassy Sue is the type of movie where a cattle prod is considered a marital aid. Patrick (Beneath the Valley of the Ultra Vixens) Wright really puts on a show. His facial expressions alone justify watching this. And keep your eyes peeled for the family pooch who shoves his cold wet nose in the girls? crotches every chance he gets. Sharon Kelly (a natural redhead with a body like Jessica Rabbit) also copulated her way through Teenage Bride and The Dirty Mind of Young Sally.&quot;\n\nTrailer included. Not hardcore, not really softcore, &quot;Sassy Sue&quot; exists in that strange nether-world between the two. Fun movie with beautiful girls from a great print from the SWV DVD Special Edition. By request.\n\nSassy MOOOOOO\n\nThis is a wonderful sleazy little film set around the antic&amp;#039;s of Willard, a inept Chicken Farm owner and his carnal pursuits &amp;#039;down on the farm&amp;#039;\n\nFirst of all our Willard has a tete a tete with the aptly named HoneyChild whose curvy figure and filthy little ways drive Willard crazy.\n\nBut one is not enough and soon enough Willard has a hankering for something else and it aint Sally it is Sue his prize cow! Thats right, his cow....&quot;she pretty&quot; Willard muses.\n\nIt gets as odd as it can, and the carnal carnival has only just got started.\n\nWell worth a look\n\nThe title refers to a cow that&amp;#039;s the object of Pa Willard&amp;#039;s (Patrick Wright) idiot hick son, Junior (John Tull).Pa spends his time between making moonshine (like any respectable hillbilly), bedding the local ladies, and attempting to get said ladies to seduce Junior to get his fixations off that damn cow. Decidedly not nearly as good or enjoyable as &quot;the Pigkeeper&amp;#039;s Daughter&quot; was, this yawn-inducing low budget Hicksploitation flick, is helped a tad by having remarkable beautiful women (Rachel Wolf excluded) in various forms of undress, but they can only do so much with the lousy script and sub-par soft-core scenes (the bathtub scene being a rather notable exception, as it&amp;#039;s the only hot one). For the most most unremarkable in any way, shape, or form, this film is highly forgettable if you plan on watching it at all. I&amp;#039;m even hesitant to recommend it to die hard Sharon Kelly fans.\n\nEye Candy: Sandy Carey, Tallie Cochrane, Karen Cooknell, &amp; Sharon Kelly show all\n\nFile Size (in bytes): 730,279,936\nDuration: 1:23:30\nSubtype: OpenDML (AVI v2.0),\nVideo Codec Name: XviD ISO MPEG-4\nWidth x Height (pixels): 528 x 384 =[1.375:1]\nVideo Bitrate: 1032\nBits/Pixel: 0.212\nFrames Per Second: 23.976 fps\nCompatibility: B-VOP , ,\nAudio Codec: 0x0055 MPEG-1 Layer 3\nAudio Bitrate: 128\nAudio Channels: 2\n\n","torrent":{"xt":"urn:btih:a58154ffa47aa6401e50ea6673424d785dff1f28","amp;dn":"Sassy.Sue%5BDVDrip%5DXvid%5BWhaleD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a58154ffa47aa6401e50ea6673424d785dff1f28","infoHashBuffer":{"type":"Buffer","data":[165,129,84,255,164,122,166,64,30,80,234,102,115,66,77,120,93,255,31,40]},"announce":[],"urlList":[]}}