{"title":"Liv Kristine  -  Skintight  mp3  2010","uid":11620508,"size":69478057,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a58a5d11c812661808218d911d9a50b5b3f6a53b&amp;dn=+Liv+Kristine++-++Skintight++mp3++2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"analogkid6103","files":10,"time":1417539760,"description":"It's a pleasue for me to reveal the title of my full-length album, &quot;Skintight&quot;. My guitar player and main song writer of the album, Thorsten Bauer, presented a few of his compositions to me. By then it was clear that Max and his team at Black Rose Productions will release my third album. We decided, first of all, to change a few things concerning the recording situation. My husband and producer of the album, Alexander Krull at Mastersound Studio, made it possible to move the complete recording area to a room with an over-whelming view at the fields and the forest of the south-western German wine-area. As the recording session moved on, the changes of the seasons followed us, and it was exciting to experience how the senses and the mind assimilates to the actual time of the year. Some years ago I read an article about Tori Amos, explaining how she pays attention to the &quot;real and personal&quot; sound of her voice and her instruments on her albums. This time, I really wanted to keep my music and singing as authentic as possible. Thorsten and Alexander encouraged me to record the songs &quot;in one go&quot;, avoiding breaks and pauses. Moreover, we kept all the natural processes happening when singing, like breathing, the movements of the lips and the tounge etc. in order to underline and strengthen the emotional excitement and personal feelings which I sense when I am singing a special chorus or certain lines. All lyrics were written by me, something which is highly important to me being an artist. This album goes under your skin. It is honest, touching and revealing, and I hope to get a little closer to you!\n\nLiv Kristine At MySpace\n\n\n\n\nQuote:\nWith &quot;Skintight&quot;, a remarkable voice leaves a lasting mark in the world of music: Liv Kristine's voice sounds and time stands still.\nCertain albums cannot be simply heard casually, as they leave a lasting impression. Certain albums captivate the listener with such intensity that he becomes part of the music himself. Liv Kristine's &quot;Skintight&quot; is one of these rare artistic works of handcrafted pop.\nThe Norwegian manages to create an oasis of authenticity with her third solo album. Guitars and percussion solely build the foundation upon which to celebrate her fascinating vocals. This conscious Spartan presentation allows for a surprising emotional journey. The title track &quot;Skintight&quot;, or the darker hit &quot;Boy at the Window&quot;, are rocking mid-tempo tracks that contrast the more touching ballads such as &quot;Twofold&quot; or the lively &quot;Wonders&quot;.\nLiv Kristine achieves the impossible by creating a studio album with an incredibly real live atmosphere. On the ballad &quot;The Rarest Flower&quot; her voice seems to hauntingly brush up against the skin. Each song represents a facet of a diversified life. Liv's voice gives us her sense of freedom (&quot;Train to Somewhere&quot; ), her strength (&quot;Life Line&quot; ), and her sincere love (&quot;Love in Grey&quot; ). She opens up her soul for the world to see. Liv Kristine sings longing into our consciousness, allowing us to break away from the humdrum of daily life.\nLiv Kristine's musical works encompass a Grammy nomination in 2005, myriad top chart placements, and the title songs to the cult television series &quot;Tatort&quot; and &quot;Schimanski&quot;. Her current album speaks to her musical greatness. Through intelligent songwriting skills, her songs wake the desire to walk barefoot over a dirt road, feel the snow melt in your hands, or experience the summer rain on your skin. It simply allows one to feel again and after hearing this album, one is born anew. With indescribable ease, &quot;Skintight&quot; frees the senses and allows desire to enjoy life to the fullest.\n\nSomeone aked for more of Liv when I posted the 2014 Release Vervain and Im working on all of her solo projects. The Uploader ak6103\nGenre:\tGothic\nSubgenre:\tGothic / Folk Rock\nBitrate:\tVbr\nSize:\t66.26 MB\nShow/Hide Files: \t\n10 files","torrent":{"xt":"urn:btih:a58a5d11c812661808218d911d9a50b5b3f6a53b","amp;dn":"+Liv+Kristine++-++Skintight++mp3++2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a58a5d11c812661808218d911d9a50b5b3f6a53b","infoHashBuffer":{"type":"Buffer","data":[165,138,93,17,200,18,102,24,8,33,141,145,29,154,80,181,179,246,165,59]},"announce":[],"urlList":[]}}