{"title":"Wiley Series on Polymer Engineering and Technology","uid":13685915,"size":202550815,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a6a10fce79fe37cd8cbde6ba91d9925017e02bac&amp;dn=Wiley+Series+on+Polymer+Engineering+and+Technology&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"clouderone","files":11,"time":1456550513,"description":"[Updated at 2016.02.27]\r\n\r\n---------------------------------------------------\r\n\r\nThe Wiley Series on Polymer Engineering and Technology\r\nEditor-in-Chief: Richard F. Grossman\r\nCo-editor: Domasius Nwabunma\r\n\r\nAbout the Series:\r\nElastomer and plastics technology continues to expand rapidly and as a result the range of applications has grown substantially, both from replacement of other materials and from new innovations, as have the possibilities for cross-fertilization that can lead to breakthroughs in research and development. The number and types of additives used in polymeric compositions also becomes broader daily. It is necessary for the polymer technologist to develop such familiarity in order to innovate by drawing conclusions from widely separated experiments and observations. The purpose of this series is to assist polymer technologists by providing an innovation bookshelf.\r\n\r\nAbout the Editors:\r\nDr. Grossman has worked in the areas of wire and cable, adhesive and release coatings, compounding and mixing, technical service and direction of research and development. He has 70 patents and 100+ technical publications, is a Fellow of the Society of Plastics Engineers and has been an expert witness for the President.\r\n\r\nDr. Domasius Nwabunma is a Nonmetallic Materials Specialist at Saudi Aramco. Previously he was a Senior Engineer at Greene Tweed, Senior Development Engineer at Spartech Corporation, Thermoforming Manufacturing Engineer at Medtronics, and Research Specialist and Senior Research Engineer at 3M Company. His current interest is in the area of nonmetallic materials for oil and gas. He holds five patents, edited two books (Polyolefin Blends and Polyolefin Composites), as well as authored numerous technical articles and book chapters. He is a senior member of the Society of Plastics Engineers (SPE) and a member of the American Chemical Society (ACS)","torrent":{"xt":"urn:btih:a6a10fce79fe37cd8cbde6ba91d9925017e02bac","amp;dn":"Wiley+Series+on+Polymer+Engineering+and+Technology","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6a10fce79fe37cd8cbde6ba91d9925017e02bac","infoHashBuffer":{"type":"Buffer","data":[166,161,15,206,121,254,55,205,140,189,230,186,145,217,146,80,23,224,43,172]},"announce":[],"urlList":[]}}