{"title":"The End of Suburbia: Oil Depletion and the Collapse of the Ameri","uid":6094230,"size":4512256236,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a706d502acc41d13a70e4efd6a063282c375eea4&amp;dn=The+End+of+Suburbia%3A+Oil+Depletion+and+the+Collapse+of+the+Ameri&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"remmerel","files":2,"time":1294695692,"description":"A great introduction to Peak Oil and the coming oil shortage\n\nThis documentary was my first introduction to Peak Oil theory. A fascinating concept that has a lot of frightening consequences if it turns out to be correct. I had absolutely no idea that the effects of oil depletion would come so soon, it literally took my breath away. This movie will probably open your eyes as to how strongly the American way of life is dependent on the &quot;abundance of cheap oil&quot; - a term used throughout the film. A lot of the topics are plain common sense, and they don't go into a huge amount of depth about any of them. But you've probably never put all the pieces together like this movie does. The interviews with the authors and energy experts are all very interesting. I don't think this film is meant to scare people. It's merely meant to inform people about what to expect in the years ahead, and maybe to encourage you to think twice about commuting 100miles to work and leaving your lights on all day long.\n\nAfter watching this film I was no longer able to look at the cars and buses zooming by quite the same. Great documentary, everyone should see it.","torrent":{"xt":"urn:btih:a706d502acc41d13a70e4efd6a063282c375eea4","amp;dn":"The+End+of+Suburbia%3A+Oil+Depletion+and+the+Collapse+of+the+Ameri","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a706d502acc41d13a70e4efd6a063282c375eea4","infoHashBuffer":{"type":"Buffer","data":[167,6,213,2,172,196,29,19,167,14,78,253,106,6,50,130,195,117,238,164]},"announce":[],"urlList":[]}}