{"title":"Redd Kross - Show World [1997]","uid":9622937,"size":358599429,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a7685147962f1b6d5970fa6df3f7e4738c53e40c&amp;dn=Redd+Kross+-+Show+World+%5B1997%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":17,"time":1392542449,"description":"Review by Ned Raggett  [-]\nKicking off with an exuberant version of the L.A. power pop-classic-that-almost-wasn't, &quot;Pretty Please Me&quot; -- and unsurprisingly Steve and Jeff McDonald and company rock the bastard to the ground with a smile this time around -- Show World is yet more fun from a band who dedicates themselves to a smart good time. In ways, Redd Kross had found history catching up to them by this time -- any number of bands had stumbled across the loud and brash- '70s pop-punk approach that was the group's raison de etre. But the fact that they hadn't gotten the attention they deserved for it didn't keep them from still going at it with gusto; Bless their hearts. If songs like &quot;You Lied Again&quot; and &quot;Vanity Mirror&quot; didn't introduce any curveballs to the basic sound, they still sounded pretty damn fantastic, singalong energy overdriven up to ten and beyond. Slightly slower tracks like &quot;Girl God,&quot; the mega-orchestrated ballad &quot;Secret Life,&quot; and the handclap crazy &quot;Follow the Leader&quot; showcase the band's calmer side well enough -- again, no surprises, but none were expected or needed. Best song title of the bunch this time around: &quot;One Chord Progression,&quot; which lives up to its name just so. &quot;Teen Competition&quot; lets them cock rock out with the best of them, but doesn't forget the sugar in the chorus even as the distortion completely screws with the mix at one point, while &quot;Get Out of Myself&quot; has one brilliant moment with so much hyper-flange that why the speakers don't melt upon contact is a mystery. (3/5)","torrent":{"xt":"urn:btih:a7685147962f1b6d5970fa6df3f7e4738c53e40c","amp;dn":"Redd+Kross+-+Show+World+%5B1997%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7685147962f1b6d5970fa6df3f7e4738c53e40c","infoHashBuffer":{"type":"Buffer","data":[167,104,81,71,150,47,27,109,89,112,250,109,243,247,228,115,140,83,228,12]},"announce":[],"urlList":[]}}