{"title":"The Great Christmas Light Fight S03E01-E02 HDTV.x264-[NY2]","uid":12938906,"size":1065750878,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a84139c3f337ec8c08b233e1e27c4ef4e6a91921&amp;dn=The+Great+Christmas+Light+Fight+S03E01-E02+HDTV.x264-%5BNY2%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TlanImass","files":1,"time":1449611060,"description":"It's beginning to look a lot like Christmas with ABC's hit holiday decorating competition series The Great Christmas Light Fight! The immensely popular series returns for a third season with all new celebrity judges, Carter Oosterhouse (HGTV's Million Dollar Rooms) and Taniya Nayak (Food Network's Restaurant Impossible). The Great Christmas Light Fight features families and neighborhoods from across America decorating their homes to the extreme for Christmas with a total of $300,000 in prizes ($50,000 per episode) up for grabs.\r\n\r\n\r\n\r\n\r\nThe Great Christmas Light Fight - Season 3, Episode 1\r\n\r\nWatch as four families from across the country showcase their spectacular displays of Christmas magic, including the Atkins family's interactive display, a 50 foot &quot;love&quot; sign and plasma cut hearts honoring breast cancer survivors in Ocala, FL; the Pelletier family's 500 fireworks synchronized to music in Greenville, SC; the Kuhn family’s 500,000 lights and specialty light projectors in St. George, UT and the Cadger family's &quot;spinning&quot; trees and light-up globe in Meridian, ID.\r\n\r\n\r\n\r\n\r\nThe Great Christmas Light Fight - Season 3, Episode 2\r\n\r\nThe festivities continue with the second episode, featuring the Phipps family, who incorporate music and original displays, including a 22' mega tree made out of PVC and aircraft cables in Livermore, CA; the Bartlett family's unique and entirely homemade displays in Ellicott City, MD; the Drelick family's Christmas snowflake set 52-feet high in the sky in Harleysville, PA, which can be seen half a mile away from the New Jersey turnpike; and the Hunt family, whose 20-foot Santa, 30,000 ice lights, 80,000 single strand bulbs and 10,000 feet of cable make this Ocala, FL, family's display not to be missed.\r\n\r\n\r\n\r\nOriginal Air Date: 07-Dec-2015","torrent":{"xt":"urn:btih:a84139c3f337ec8c08b233e1e27c4ef4e6a91921","amp;dn":"The+Great+Christmas+Light+Fight+S03E01-E02+HDTV.x264-%5BNY2%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a84139c3f337ec8c08b233e1e27c4ef4e6a91921","infoHashBuffer":{"type":"Buffer","data":[168,65,57,195,243,55,236,140,8,178,51,225,226,124,78,244,230,169,25,33]},"announce":[],"urlList":[]}}