{"title":"OrkneyShetlandMinecraft.zip","uid":13768351,"size":6712469165,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a84b9d8a9d3f51bcc552bc3efaa1dc329e5a5692&amp;dn=OrkneyShetlandMinecraft.zip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"matthelliwell","files":1,"time":1457268221,"description":"This is a full scale representation (ie 1 metre on the ground is 1 block in Minecraft) of Orkney and Shetland Islands rendered in Minecraft. It also includes the far north-west of the Scottish mainland.\r\n\r\nIt includes hills, trees, roads, individual buildings, railways, lakes/lochs, rivers, streams and ponds. There's enough detail to find individual buildings in specific streets.\r\n\r\nYou'll need about 73MB of free space to unzip the map.\r\n\r\nIf people want to play with it, here's some nitty gritty information:\r\n\r\n- Coordinates. If you want to teleport to a particular location, first find the easting and northing coordinates, eg by using http://www.gridreferencefinder.com/. The easting will be the X-coordinate in Minecraft. Take the northing away from 1,225,000 to get the Z-coordinate. eg The Old Man of Hoy is roughly at northing 317537, easting 1000802. So enter '/tp 317537 20 224198' and you'll end up near the Old Man of Hoy about 20m in the air. If you end up teleporting into the middle of some rock, just increase the height.\r\n\r\n- Roads. The location of the roads is accurate but I've no information about the road widths so I've estimated the widths based on the type of road.\r\n\r\n- Buildings. The outline and position of buildings is accurate but I've no information about the height so style so all buildings are shown as solid blocks. \r\n\r\n- Hills. The terrain is generated by interpolating between 10m contours so features less than 10m won't show up. Because Minecraft only allows heights up to 255, some scaling was necessary. As a side effect of the scaling algorithm, you may see a discontinuity in the height every 10km.\r\n\r\n- Trees. Trees start of as saplings but will grow into normal trees in the usual Minecraft way.\r\n\r\n- Railways. The position of railways is accurate but I can't represent complex junctions in Minecraft so tracks might not join together properly at junctions.\r\n\r\n- Data. I used Ordnance Survey Open Data (https://www.ordnancesurvey.co.uk/opendatadownload/products.html)\r\n\r\n- Source code. If anyone wants to play with the source its available on Github (https://github.com/matthelliwell2/), though its not the neatest bit of code I've ever written.\r\n\r\nOrdnance Survey did something similar a couple of years ago but there's was much less detailed. They did the whole of UK in 83 billion blocks. I've used 117 billion blocks just for Orkney and Shetland Islands. I plan to extend my map to cover all of the UK but as I've started in the north, I thought I'd share the map so far.\r\n\r\n- Area covered. The map covers grid squares HP, HT, HU, HW, HX, HY, HZ and ND. See https://www.ordnancesurvey.co.uk/docs/maps/national-grid-map.pdf to see exactly what these letters correspond","torrent":{"xt":"urn:btih:a84b9d8a9d3f51bcc552bc3efaa1dc329e5a5692","amp;dn":"OrkneyShetlandMinecraft.zip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a84b9d8a9d3f51bcc552bc3efaa1dc329e5a5692","infoHashBuffer":{"type":"Buffer","data":[168,75,157,138,157,63,81,188,197,82,188,62,250,161,220,50,158,90,86,146]},"announce":[],"urlList":[]}}