{"title":"Crosby, Stills, Nash &amp; Young-Deja Vu(1970)[SHM-CD][EAC-FLAC][TWR","uid":4723104,"size":250207497,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a89efdace3a4733739f7bd7c1384b00827b79bad&amp;dn=Crosby%2C+Stills%2C+Nash+%26+Young-Deja+Vu%281970%29%5BSHM-CD%5D%5BEAC-FLAC%5D%5BTWR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thewall68","files":14,"time":1234617978,"description":"Deja Vu is a timeless masterpiece of classic rock! It's the crowning achievement of Crosby, Stills, Nash and Young (CSN&amp;Y), arguably one of the greatest rock bands of all time. Much of their fame and durability over the past 30 years can be traced to this album, which was originally released on vinyl in 1970. It contains some of their most outstanding and famous songs, including the rock anthems &quot;Carry On&quot; and &quot;Woodstock,&quot; David Crosby's tongue-in-cheek &quot;Almost Cut My Hair,&quot; Stephen Stills' forlorn ballad &quot;4 + 20,&quot; and the personal favorite of both my wife and me: &quot;Our House.&quot; Every song shows CSN&amp;Y's tremendous dynamism, versatility and musical maturity. Superbly intelligent lyrics, great guitar riffs (especially Greg Reeves' bass riff in the song &quot;Deja Vu&quot;), beautifully crafted harmonies, and Dallas Taylor's sizzling percussion all converge to make every song on this digitally remastered CD a rock masterpiece.\n\nDeja Vu is one of the landmark albums of all time. It's also one of my personal favorites, and an essential CD, not only for fans of CSN&amp;Y, but for all fans of rock and roll music.\n\nFrom the outset of their star-crossed collaboration, it was clear that this was to be the best of the new super-groups, composed of discontented refugees who either quit or were bounced from other monster groups like the Byrds, Buffalo Springfield, and the Hollies. When after an initial success with a first album the group decided to add Still's former partner in crime from the Buffalo Springfield group Neil Young to the line-up, the strange witches brew of creative energy and talent that resulted exploded onto the contemporary rock scene at Woodstock to an amazed audience with such power and originality. Of course, this number one album was the first result of their original collaboration, and it shot to the top of the charts, where it remained for years!\n\nEAC Read mode               : Secure\nUtilize accurate stream : Yes\nDefeat audio cache      : Yes\nMake use of C2 pointers : No\n\n\nFull Artwork\n\n\nTracks:\n\n\n1. Carry On (4:25)\n2. Teach Your Children (2:53)\n3. Almost Cut My Hair (4:25)\n4. Helpless (3:30)\n5. Woodstock (3:52)\n6. DÃƒÂ©jÃƒÂ  Vu (4:10)\n7. Our House (2:59)\n8. 4 + 20 (1:55)\n9. Country Girl: Whiskey Boot Hill/Down, Down, Down/&quot;Country Girl&quot; (I...) (5:05)\n10. Everybody I Love You (2:20)\n\n\n","torrent":{"xt":"urn:btih:a89efdace3a4733739f7bd7c1384b00827b79bad","amp;dn":"Crosby%2C+Stills%2C+Nash+%26+Young-Deja+Vu%281970%29%5BSHM-CD%5D%5BEAC-FLAC%5D%5BTWR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a89efdace3a4733739f7bd7c1384b00827b79bad","infoHashBuffer":{"type":"Buffer","data":[168,158,253,172,227,164,115,55,57,247,189,124,19,132,176,8,39,183,155,173]},"announce":[],"urlList":[]}}