{"title":"(Blues) Sonny Moorman - Live At The Cincy Blues Fest","uid":6483615,"size":119340772,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a946981218080fbba370483ecff265083293132e&amp;dn=%28Blues%29+Sonny+Moorman+-+Live+At+The+Cincy+Blues+Fest&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nightissuchproximity","files":-1,"time":1308625801,"description":"mp3   320kbps\n\n\nLabel: Atlas\nStyles: Acoustic delta\nYear: 2007\nArt: Front\n\n\n[3:42] 1. Kind Hearted Woman Blues\n[4:14] 2. 32-20 Blues\n[3:03] 3. Bad Woman Blues\n[2:47] 4. Blue Mood\n[2:57] 5. Cincinnati Shuffle\n[0:53] 6. Amazing Grace\n[6:07] 7. As the Crow Flies\n[4:03] 8. You Got to Move\n[5:22] 9. Statesboro Blues\n[3:41] 10. Rollin' and Tumblin'\n[4:14] 11. Crossroads Blues\n[4:53] 12. Love in Vain\n[3:41] 13. Let's Work Together\n\nFor almost 15 years now, Sonny Moorman has been known as the area's premier electric blues rocker. Now he can lay claim to one of the finest local acoustic blues artists around with a new solo set, &quot;Sonny Moorman: Live at the Cincy Blues Fest.&quot; Moorman has always done the occasional solo acoustic gigs but is more known for his classic electric guitar power trio with Marc Hoffmann (bass) and Dave Fair (drums). Moorman said he recorded his solo set at the July blues fest intending to use a couple pieces in a planned live double CD featuring the trio.&quot;It came out so good it got to be its own record,&quot; said Moorman.\n\nMoorman is at his angsty best on classic blues tunes such as &quot;Kind Hearted Woman Blues,&quot; &quot;Crossroad Blues&quot; and &quot;Statesboro Blues,&quot; and he reworks a great version of his autobiographical &quot;Cincinnati Shuffle.&quot;On the CD, he's much more experimental, using four different styles of guitars, including some great twangy, intricate work on a lap guitar for &quot;Statesboro Blues.&quot; Moorman's such a sizzling guitar player we often forget what a solid vocalist he is. His slightly raspy, soulful vocals stand out as much as his guitar work.&quot;Doing the solo acoustic stuff has probably made me a better singer, because I've learned not to sing as hard,&quot; he said. &quot;I have a little better control, a little nicer vocal timbre. Now, when I do the band stuff, I don't shout as much. I'm singing more and shouting less.&quot;\n\nMoorman's behind-the-scenes co-star on the recording is Erwin Musper, the Dutch-born producer-engineer with world-class rock credentials (Van Halen, Scorpions), who settled in Northern Kentucky, building a home studio two years ago. Musper's engineering of Moorman's set is an incredibly warm and rich recording, not often captured on live projects. Moorman's CD is released on noted Macon, Ga.-based blues label Atlas, and Moorman has a management deal with Willie Perkins, the former Allman Brothers manager.\n","torrent":{"xt":"urn:btih:a946981218080fbba370483ecff265083293132e","amp;dn":"%28Blues%29+Sonny+Moorman+-+Live+At+The+Cincy+Blues+Fest","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a946981218080fbba370483ecff265083293132e","infoHashBuffer":{"type":"Buffer","data":[169,70,152,18,24,8,15,187,163,112,72,62,207,242,101,8,50,147,19,46]},"announce":[],"urlList":[]}}