{"title":"Green Arrow - The Wonder Year #1-4","uid":7763608,"size":74844822,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:a9c62c9b21bec8c28a410e38a37d22bde487bb90&amp;dn=Green+Arrow+-+The+Wonder+Year+%231-4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":4,"time":1351304483,"description":"The Watergate investigation is in full swing, the Vietnam war is raging, and Oliver Queen, millionaire industrialist playboy, has woken up abruptly from a dream a dream in which he was washed overboard from his luxury yacht and marooned on a deserted island. Of course, it wasn't just a dream, since it actually happened to him 11 weeks earlier. Since then, he managed to foil a robbery at a costume ball while dressed as Robin Hood. His dry-witted butler, Stan Wilson, urges Oliver to return to work, but Oliver confides that money no longer holds the allure it once had for him. Finally returning to the office, Oliver is dismayed to find out he's scheduled to attend a fund-raising dinner for liberal Congressman James Reynolds and also that the costume shop wants the Robin Hood costume returned. At the dinner, Oliver is bored with the political patter (even though he likes Reynolds' policies) and steps outside to get away from the crowd. He spots a sniper with a rifle climbing a nearby fire escape, and pulls the Robin Hood costume out of the trunk of his car. Oliver climbs a nearby building, and takes aim at the sniper just as Reynolds and his entourage leave the dinner. A pair of police officers discover Oliver and try to subdue him, but he fights them off just in time to get off an arrow that spoils the sniper's aim, saving Congressman Reynolds life. Oliver is hailed as saving the Congressman, and is introduced as Green Arrow to Reynolds' advisor and lover, Kelli Harris","torrent":{"xt":"urn:btih:a9c62c9b21bec8c28a410e38a37d22bde487bb90","amp;dn":"Green+Arrow+-+The+Wonder+Year+%231-4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9c62c9b21bec8c28a410e38a37d22bde487bb90","infoHashBuffer":{"type":"Buffer","data":[169,198,44,155,33,190,200,194,138,65,14,56,163,125,34,189,228,135,187,144]},"announce":[],"urlList":[]}}