{"title":"Steve Wariner - Ultimate Collection (2000-CBR192k-Country)","uid":4168858,"size":109420827,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ab74663f58b1b533c15454412cb1009ca469e3fa&amp;dn=Steve+Wariner+-+Ultimate+Collection+%282000-CBR192k-Country%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cheng","files":25,"time":1209751044,"description":" &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/411ZK4ZS1QL._SS300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/411ZK4ZS1QL._SS300_.jpg&lt;/a&gt;\n\n-=Product Description=-\n\nFew artists can not only survive the test of time, but flourish with the passing of years. For most, longevity is an elusive goal only attained by such as icons as George Jones, Ray Price or Hank Williams-great singers with extraordinary songs. Then there&amp;#039;s that intangible ingredient called talent, that element of delivery combined with magic that actually endures what can be a fickle public. Steve Wariner is one of those rare gems. Since his arrival on the country music scene in the late &amp;#039;70s, Wariner&amp;#039;s blend of pop flavored country along with his velvety vocals, has earned him a consistency enjoyed only by few, while amassing hit upon hit. Although country purists tend to criticize such non-traditional music, Wariner&amp;#039;s more contemporary offerings arguably helped broaden country&amp;#039;s listening audience in the &amp;#039;80s.\n\nThis package--Steve Wariner--Ultimate Collection--spans 11 years, from his first No.1 record, &quot;All Roads Lead to You,&quot; until the early &amp;#039;90s when he experienced a shift in direction and sales before his more recent resurgence of popularity. The collection encompasses a body of work that displays Wariner&amp;#039;s growth as a total artist-vocally, instrumentally and as a songwriter-containing 21 hits, an amazing number for any artist, but particularly one who fell into singing by accident.\n\n---------------------------------------------------------------------\n                 Steve Wariner - Ultimate Collection\n---------------------------------------------------------------------\n\nArtist...............: Steve Wariner\nAlbum................: Ultimate Collection\nLabel................: RCA\nGenre................: Country\nYear.................: 2000\nCodec................: FhG\nQuality..............: CBR 192, (avg. bitrate: 192kbps)\nChannels.............: Joint Stereo / 44100 hz\nVersion..............: MPEG 1 Layer III\nTags.................: ID3 v1.1, ID3 v2.3\nIncluded.............: NFO, SFV, PLS, M3U\n\nRipped by............: NMR\nPosted by............: Cheng on 2008-5-2\n\n---------------------------------------------------------------------\n                       Tracklisting\n---------------------------------------------------------------------\n\n01. (03:31) Steve Wariner - All Roads Lead To You\n02. (03:13) Steve Wariner - Midnight Fire\n03. (03:15) Steve Wariner - Lonely Women Make Good Lovers\n04. (03:09) Steve Wariner - What I Didn&amp;#039;t Do\n05. (04:04) Steve Wariner - Some Fools Never Learn\n06. (04:02) Steve Wariner - You Can Dream Of Me\n07. (03:17) Steve Wariner - Life&amp;#039;s Highway\n08. (04:17) Steve Wariner - Starting Over Again\n09. (03:25) Steve Wariner - That&amp;#039;s How You Know When Love&amp;#039;s Right\n10. (03:49) Steve Wariner - The Weekend\n11. (03:07) Steve Wariner - The Hand That Rocks The Cradle\n12. (03:06) Steve Wariner - Lynda\n13. (03:40) Steve Wariner - Baby I&amp;#039;m Yours\n14. (03:29) Steve Wariner - I Should Be With You\n15. (04:05) Steve Wariner - Hold On (A Little Longer)\n16. (03:32) Steve Wariner - Where Did I Go Wrong\n17. (03:53) Steve Wariner - I Got Dreams\n18. (03:46) Steve Wariner - When I Could Come Home To You\n19. (03:55) Steve Wariner - Leave Him Out Of This\n20. (03:36) Steve Wariner - The Tips Of My Fingers\n21. (03:43) Steve Wariner - Small Town Girl\n\nPlaying Time.........: 01:15:57\nTotal Size...........: 104.34 MB\n\n---------------------------------------------------------------------\n\n..: Biography :..\n\nOne of country music&amp;#039;s most versatile  performers, Steve Wariner grew\nup in suburban  Indianapolis, interested in the  Beatles on the radio\nas well as Chet  Atkins  and  George  Jones, the artists  his  father\nlistened to most  frequently. He started  playing  music in his dad&amp;#039;s\nband, and by his high  school  years, he was  playing local clubs. At\nage 17, he caught  the ear of Dottie West, who persuaded him to  join\nher band, and  in  that  position  he  ended  up  playing bass on her\nclassic  1973  single  &quot;Country  Sunshine.&quot; He  moved on to work as a\nsideman for Bob Luman and signed a singles deal  with  RCA Records in\n1976.  His  career  developed  slowly,  and  in  the  beginning,  the\nlow-tuned  guitars  and wide range of his  singles  brought  frequent\ncomparisons  to  the  early  Glen  Campbell  hits. His  first  really\nsuccessful  single was &quot;Your Memory,&quot; which peaked in the country Top\nTen in early 1981, followed  by &quot;By Now&quot; and &quot;All Roads Lead to You,&quot;\nwhich topped  the  country  charts  in December. RCA released another\ncouple of singles  before  finally  issuing  his  debut  album, Steve\nWariner, in the fall of 1982. He  returned  to the country Top Ten in\n1983 with &quot;Midnight Fire,&quot; which became the title track of his second\nalbum, and &quot;Lonely Women Make Good Lovers.&quot;\n\nWariner&amp;#039;s career  really  took  off  when he left RCA for MCA in late\n1984. His first single for  the  new  label, &quot;What I Didn&amp;#039;t Do,&quot; made\nthe  country  Top Five in early 1985, setting  off  a  string  of  18\nconsecutive Top Ten hits that included the  chart-toppers &quot;Some Fools\nNever Learn,&quot;  &quot;You Can Dream of Me,&quot;  &quot;Life&amp;#039;s Highway,&quot;  &quot;Small Town\nGirl,&quot;  &quot;The Weekend,&quot;  &quot;Lynda,&quot;  &quot;Where Did I Go Wrong,&quot; and  &quot;I Got\nDreams&quot; (the last two  Wariner  compositions). This run took him into\n1990, when he switched to Arista Records. He had considerable initial\nsuccess  on  the  new label, with his first Arista album, I Am Ready,\ngoing platinum (none of his  previous  albums had even gone gold) and\nhis  first  three  Arista singles making the Top Ten. And he shared a\n1991 Grammy Award for Best  Country  Vocal  Collaboration  with Ricky\nSkaggs  and  Vince Gill  for &quot;Restless,&quot; a track  on  Mark O&amp;#039;Connor&amp;#039;s\nalbum The New Nashville Cats.\n\nWariner scored a  country  Top Ten hit with &quot;If I Didn&amp;#039;t Love You&quot; in\nthe summer of 1993, but his  record  sales  were  declining. His 1996\ninstrumental album No More Mr. Nice Guy, his first  release in  three\nyears, did not chart, but that year he joined the  Grand Ole Opry. In\n1997, he sang with  Anita Cochran on &quot;What If I Said,&quot; and the single\ntopped the country  charts  in early 1998, just  after  Garth Brooks&amp;#039;\nrecording  of  Wariner&amp;#039;s  composition  &quot;Longneck Bottle&quot;  had gone to\nnumber one. This twin success  reinvigorated his career. He signed to\nCapitol  Records, Brooks&amp;#039; label, and  released &quot;Holes in the Floor of\nHeaven,&quot; which made  the  country Top Five, winning the Country Music\nAssociation&amp;#039;s  awards for Song of the Year  and  Single  of the Year.\nBurnin&amp;#039; the Roadhouse Down, his debut album for Capitol, reached  the\ncountry Top Ten, went gold, and crossed over to the Top 50 of the pop\ncharts. He followed it with 1999&amp;#039;s  Two  Teardrops, which  also  went\ngold; the  same  year, he  shared  his second Grammy for Best Country\nInstrumental for the Asleep at the Wheel track &quot;Bob&amp;#039;s Breakdown.&quot; His\nthird Capitol album, Faith in You, was released in May 2000.\n\n..: Album Review :..\n\nSteve Wariner&amp;#039;s Ultimate Collection gathers some of the best sides he\nrecorded  for  RCA, MCA  Nashville, and  Arista  Nashville, including\nnumber one  country  hits like  &quot;All Roads Lead to You,&quot;  &quot;Some Fools\nNever Learn,&quot;  &quot;Where Did I Go Wrong,&quot;  and  &quot;Small  Town Girl.&quot;  The\ncollection also includes his duets with Nicolette Larson (&quot;That&amp;#039;s How\nYou Know When Love&amp;#039;s Right&quot;) and  Glen Campbell (&quot;The Hand That Rocks\nthe Cradle&quot;) as well as hit singles such as &quot;The Tips of My Fingers,&quot;\n&quot;I Should Be With You,&quot;  and  &quot;Life&amp;#039;s  Highway.&quot;  The  most  complete\ncollection  of  Wariner&amp;#039;s  work  available, The  Ultimate  Collection\nemphasizes both the depth and diversity of his enduring career.\n","torrent":{"xt":"urn:btih:ab74663f58b1b533c15454412cb1009ca469e3fa","amp;dn":"Steve+Wariner+-+Ultimate+Collection+%282000-CBR192k-Country%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab74663f58b1b533c15454412cb1009ca469e3fa","infoHashBuffer":{"type":"Buffer","data":[171,116,102,63,88,177,181,51,193,84,84,65,44,177,0,156,164,105,227,250]},"announce":[],"urlList":[]}}