{"title":"Evernote Premium v7.9.1","uid":14970518,"size":26445022,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:abaec3226a307290dddce3b473207b15eafef204&amp;dn=Evernote+Premium+v7.9.1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aman.nik","files":1,"time":1466203480,"description":"Evernote Premium\r\nEvernote app is where you do the work to achieve it. Use Evernote to write your notes of any type, from short to lengthy research list and access your notes on any device. You can collect web articles, handwritten notes and photos to keep all your details in one place. Download evernote and find your work quickly with powerful search.\r\n\r\nEvernote Features\r\n\r\nTake notes: write in a clean, distraction-free workspace.\r\nGet organized: create notebooks and add tags to wrangle projects.\r\nAccess anywhere: keep your work in sync across devices.\r\nFind anything fast: text in notes, photos, and PDFs is searchable.\r\nShare ideas and resources: create a workspace for collaboration with shared notebooks.\r\nKeep up with to-do’s: make to-do lists and check items off as you go.\r\nHarness creativity: capture ideas while they’re fresh, wherever you are.\r\nPrepare for meetings: draft agendas and to-do’s for next time.\r\nManage expenses: organize receipts, bills, and invoices to keep expense reports in check.\r\nPlan business travel: save reservations and tickets for simple trip planning.\r\nEvernote Premium Features\r\n\r\nOffline access – work anywhere, even without a connection\r\nUnlimited uploads – keep all the files you need to get work done\r\nBetter search – search inside Office docs and attachments\r\nGreater privacy – add a passcode lock on mobile\r\nPDF annotation – use shapes and comments to give visual feedback\r\nUnlimited business card scans – scan biz cards, save to contacts, and connect on LinkedIN","torrent":{"xt":"urn:btih:abaec3226a307290dddce3b473207b15eafef204","amp;dn":"Evernote+Premium+v7.9.1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abaec3226a307290dddce3b473207b15eafef204","infoHashBuffer":{"type":"Buffer","data":[171,174,195,34,106,48,114,144,221,220,227,180,115,32,123,21,234,254,242,4]},"announce":[],"urlList":[]}}