{"title":"Alberto Manguel, ed. - Other Fires: Short Fiction (pdf)","uid":10494364,"size":1915328,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ac0e315a5a01196a2fcc873cbea0e454148603f7&amp;dn=Alberto+Manguel%2C+ed.+-+Other+Fires%3A+Short+Fiction+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1404590282,"description":"Alberto Manguel, ed. - Other Fires: Short Fiction by Latin American Women (Clarkson Potter, 1986). 222 pp.\n\nImproved version of an older scan. Page images completely reprocessed.  Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc. Many thanks to the original scanner; thanks also to the uploader who made the book available.\n\n\ndescription:\n\nA powerful, haunting, vivid, and provocative collection of short fiction by Latin American women.\n\nFrom Publishers Weekly\n\nMost of the previously untranslated authors represented here write prose that burns with sexual intensity and political passion, belying the stereotype of the submissive Latin American woman. The 20 stories range in tone and theme from Marta Lynch's intimate ode to a &quot;Latin Lover&quot; to Alejandra Pizarnik's grisly tale of torture and seduction in &quot;The Bloody Countess&quot;; from Armonia Somers's spiritual surrealism in &quot;The Fall&quot; to Liliana Heker's hard-hitting social commentary in &quot;The Stolen Party.&quot; This eclectic anthology gives the English-speaking world a rewarding glimpse of heretofore neglected writers. \n\nFrom Library Journal\n\nThis is a remarkable collection by 20 Latin American women. They do not speak with a common voice, as they represent cultures and countries that evolved separately. But there is an overall aura of magic and surrealism that readers of recent Latin American novels will recognize. Elena Garro deals with the duality of Mexican culture, the schism between middle-class people of Spanish descent and the underprivileged, underclass Indians. Clarice Lispector's story takes place in the mind of a woman who has been ill. As if a glass of milk in the morning could dispel all her anguish, she desperately obeys instructions, wanting only to be a &quot;boring good-hearted, and diligent wife.&quot; Exploring myth, politics, history, religion, repression, and the purely personal, these stories lie in a dusky zone between reality and dream. A rewarding addition for general fiction collections.","torrent":{"xt":"urn:btih:ac0e315a5a01196a2fcc873cbea0e454148603f7","amp;dn":"Alberto+Manguel%2C+ed.+-+Other+Fires%3A+Short+Fiction+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac0e315a5a01196a2fcc873cbea0e454148603f7","infoHashBuffer":{"type":"Buffer","data":[172,14,49,90,90,1,25,106,47,204,135,60,190,160,228,84,20,134,3,247]},"announce":[],"urlList":[]}}