{"title":"Mendelssohn - Sym #4 - Celibidache. Berlin Ph (1953) [Philidor]","uid":15387545,"size":121517434,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ac4c5bede8801de7f0fab441c56fff154cec6659&amp;dn=Mendelssohn+-+Sym+%234+-+Celibidache.+Berlin+Ph+%281953%29+%5BPhilidor%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Philidor","files":7,"time":1469304821,"description":"Sergiu Celibidache had an intensity and vision that he communicated to every orchestra he worked with. He would have been far better known had he learned to keep his mouth shut in public, and not complain to the newspapers about everything he disliked in any engagement; but he did what he did, and got his tossed out of several prestigious posts. He was, for instance, on the short list to lead both the Berlin Philharmonic and Vienna Philharmonic--but screwed those assignments up. Karajan, who got the helm of the Berlin Philharmonic, detested Celi's outspokenness, especially about the former's Nazi Party membership. When Karajan made his contract with the Berlin Phil, there were two conductors stipulated that would never, ever be allowed to play while Karajan led the orchestra. One was Bernstein. The other was Celi.\r\n\r\nThis Mendelssohn Fourth dates from 1953, and was caught live, since Celi hated recordings until nearly the end of his life. The performance, especially the finale, is demonic in its force. The Berliners were used to finesse and sobriety, but Celi gave them fire and enthusiasm. If you don't mind the sound, you'll probably find the performance hair-raising.\r\n\r\nBio of Celi enclosed, and a couple of images. You can find all my classical uploads by searching on Philidor, or checking this thread:\r\n  \nhttps://pirates-forum.org/Thread-Philidor-s-uploads--63895","torrent":{"xt":"urn:btih:ac4c5bede8801de7f0fab441c56fff154cec6659","amp;dn":"Mendelssohn+-+Sym+%234+-+Celibidache.+Berlin+Ph+%281953%29+%5BPhilidor%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac4c5bede8801de7f0fab441c56fff154cec6659","infoHashBuffer":{"type":"Buffer","data":[172,76,91,237,232,128,29,231,240,250,180,65,197,111,255,21,76,236,102,89]},"announce":[],"urlList":[]}}