{"title":"Retopology Techniques in Maya LT Tutorial  Digital-Tutors","uid":10166937,"size":437596893,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:aca0e3fa146ad3bd77962562c5920f54c5d06164&amp;dn=Retopology+Techniques+in+Maya+LT+Tutorial++Digital-Tutors&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ihatethisrecaptcha","files":10,"time":1400351488,"description":"About this course:\n\nWith the advent of the high-resolution sculpting workflow, the modeled assets we create can sometimes be difficult to work with in their native state. For this reason, various tools are typically used to create a new, pipeline-friendly topology for the model. There are different methods for creating this geometry and it's important that the method we use be quick, efficient and gives us the control we require.\n\nMaya LT is built specifically for game workflows so it has some tools focused on creating new topology. We'll cover setting up our reference model so the new topology we create will snap to the surface. We'll talk about using Quad Draw to interactively place points and polygons across our model's surface. We'll also cover the Shrink Wrap functionality and talk about edge flow concerns as we create a new mesh for a bird creature.\n\nWe'll also cover some of the ways we can customize how Quad Draw functions and look at methods for speeding up the retopology process on unusual shapes. In the end of this training, you'll be able to create optimized meshes out of your own high-resolution sculpts.","torrent":{"xt":"urn:btih:aca0e3fa146ad3bd77962562c5920f54c5d06164","amp;dn":"Retopology+Techniques+in+Maya+LT+Tutorial++Digital-Tutors","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aca0e3fa146ad3bd77962562c5920f54c5d06164","infoHashBuffer":{"type":"Buffer","data":[172,160,227,250,20,106,211,189,119,150,37,98,197,146,15,84,197,208,97,100]},"announce":[],"urlList":[]}}