{"title":"HISTORY OF POP AND ROCK MUSIC - part 342","uid":6918558,"size":480773781,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:accac5d3c01e714ac6edf2769e129511f4228b5c&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+342&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pupovaczlatko","files":-1,"time":1325121172,"description":"\n\n\n\n                      PART  342\n\n\n\n                EDDY GRANT  -  Baby, Come Back  (1985)\n                OPUS  -  Live is Life  (1985)\n               \n\n\n\n     Opus is a pop-rock group from Graz, Austria. Formed in 1973, the group remains active today. The band is especially well known for its single release, &quot;Live Is Life.&quot; It was their second single, released in 1985, and achieved huge success, topping the charts of many countries, including Austria (eight weeks), Germany, France (seven weeks) and Sweden (four weeks). In France, the song is the 149th best-selling single of all time with about 857,000 units sold.The song was covered by many other artists, including Stargo (number ten in France in 1985) and  Slovenian music group Laibach. The Spanish band Los Manolos covered the song like a rumba. Brazilian band &quot;Os Melhores&quot; recorded a version called &quot;Como ÃƒÂ© bom te amar&quot;.The Quebec singer RenÃƒÂ© Simard covered the song in french, &quot;La vie chante&quot;.\n        \n   &quot;Baby, Come Back&quot; is a song written by Eddy Grant, and originally performed and recorded by him and the rest of his band The Equals. The song was first released in 1966, a year after the band formed, but did not chart. However after impressive sales in the rest of Europe (it reached the top 10 in Belgium and The Netherlands) the song was re-issued in the UK on 1 May 1968 and reached #1 in the UK Singles Chart on 6 July 1968 spending three weeks there. In all the song stayed in the UK Top 75 for 18 weeks. Eddy Grant himself released a new version of the song in 1984, 1985 and 1989, without much impact on the charts.\n\n","torrent":{"xt":"urn:btih:accac5d3c01e714ac6edf2769e129511f4228b5c","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+342","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"accac5d3c01e714ac6edf2769e129511f4228b5c","infoHashBuffer":{"type":"Buffer","data":[172,202,197,211,192,30,113,74,198,237,242,118,158,18,149,17,244,34,139,92]},"announce":[],"urlList":[]}}