{"title":"La historia de Troya [ebook].","uid":6377884,"size":88673006,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ad2a5d9f802bc96c2f111adb1211171ca3c399da&amp;dn=La+historia+de+Troya+%5Bebook%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zurera","files":-1,"time":1304933796,"description":"Escrita con frescura y energÃƒÂ­a, ÃƒÂ©sta es la historia de Helena y del juicio de Paris; de la reuniÃƒÂ³n de los hÃƒÂ©roes y del sitio de Troya; de Aquiles y su vulnerable talÃƒÂ³n, criado con miel salvaje y mÃƒÂ©dula de leÃƒÂ³n por un centauro; de Odiseo, el ÃƒÂºltimo de los hÃƒÂ©roes, y de su ardid del Caballo de Madera y de las muchas aventuras en su largo viaje de regreso a Grecia.\n\n\n\nLa aficiÃƒÂ³n a mitos y leyendas de Roger Lancelyn Green (1918-1987) floreciÃƒÂ³ durante sus aÃƒÂ±os de estudiante en la universidad de Oxford, donde se enriqueciÃƒÂ³ con una duradera pasiÃƒÂ³n por Grecia y su cultura. VisitÃƒÂ³ ese paÃƒÂ­s por primera vez en un crucero en 1937, y volviÃƒÂ³ a ÃƒÂ©l aÃƒÂ±o tras aÃƒÂ±o siempre que pudo, hasta poco antes de morir. TambiÃƒÂ©n le fascinaban las obras de teatro griegas y su reelaboraciÃƒÂ³n de los mitos antiguos. Con esta mezcla de intereses, era inevitable que acabara por ofrecer su propia versiÃƒÂ³n de los relatos clÃƒÂ¡sicos. A partir de 1946 publicÃƒÂ³ un gran nÃƒÂºmero de libros: biografÃƒÂ­as de sus autores favoritos, relatos originales para niÃƒÂ±os y unos cincuenta volÃƒÂºmenes con su personal visiÃƒÂ³n de las leyendas tradicionales, como la de El rey Arturo y sus caballeros de la Tabla Redonda.\n","torrent":{"xt":"urn:btih:ad2a5d9f802bc96c2f111adb1211171ca3c399da","amp;dn":"La+historia+de+Troya+%5Bebook%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad2a5d9f802bc96c2f111adb1211171ca3c399da","infoHashBuffer":{"type":"Buffer","data":[173,42,93,159,128,43,201,108,47,17,26,219,18,17,23,28,163,195,153,218]},"announce":[],"urlList":[]}}