{"title":"In My Hands: Memories of a Holocaust Rescuer - Irene Gut Opdyke,","uid":10159514,"size":205007966,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:adff27e683d898145adb6909fe7b985a5c90d4fc&amp;dn=In+My+Hands%3A+Memories+of+a+Holocaust+Rescuer+-+Irene+Gut+Opdyke%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SectorVector","files":-1,"time":1400230796,"description":"\nIn My Hands: Memories of a Holocaust Rescuer By Irene Gut Opdyke, read by Hope Davis\n\n\n# Unabridged edition 1999 \n# 7 hours and 8 mins\n# ISBN: 0553526588 \n# MP3 64 kbps (good)\n\n\nIrene Gut was just 17 in 1939, when the Germans and Russians devoured her native Poland. Just a girl, really. But a girl who saw evil and chose to defy it.\n\nIn My Hands began as one non-Jew's challenge to any who would deny the Holocaust. Much like The Diary of Anne Frank, it has become a profound document of an individual's heroism in the face of the greatest evil mankind has known.\n\nIn the fall of 1939 the Nazis invaded Irene Gut's beloved Poland, ending her training as a nurse and thrusting the sixteen-year-old Catholic girl into a world of degradation that somehow gave her the strength to accomplish what amounted to miracles. Forced into the service of the German army, young Irene was able, due in part to her Aryan good looks, to use her position as a servant in an officers' club to steal food and supplies (and even information overheard at the officers' tables) for the Jews in the ghetto. She smuggled Jews out of the work camps, ultimately hiding a dozen people in the home of a Nazi major for whom she was housekeeper.\n\nAn important addition to the literature of human survival and heroism, In My Hands is further proof of why, in spite of everything, we must believe in the goodness of people.\n\n &lt;a href=&quot;\nhttp://www.goodreads.com/book/show/494320.In_My_Hands&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.goodreads.com/book/show/494320.In_My_Hands&lt;/a&gt; - 4.23/5.0\n\n\nNarrator:\n========\n\nHope Davis is an actress of theater, film, and television. She was named Best Actress by the New York Film Critics Circle in 2003 for her work in American Splendor, and has been nominated for Tony, Emmy, and Golden Globe awards. Some of her most recent credits include the movie A Special Relationship, the Tony Award winning play God of Carnage, and the television series In Treatment.\n &lt;a href=&quot;\nhttp://www.booksontape.com/narrator/44649/hope-davis/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.booksontape.com/narrator/44649/hope-davis/&lt;/a&gt;\n\n-_-","torrent":{"xt":"urn:btih:adff27e683d898145adb6909fe7b985a5c90d4fc","amp;dn":"In+My+Hands%3A+Memories+of+a+Holocaust+Rescuer+-+Irene+Gut+Opdyke%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adff27e683d898145adb6909fe7b985a5c90d4fc","infoHashBuffer":{"type":"Buffer","data":[173,255,39,230,131,216,152,20,90,219,105,9,254,123,152,90,92,144,212,252]},"announce":[],"urlList":[]}}