{"title":"The Simpsons - Season 6 Complete [DVDRIP VP7 KEGGERMAN] fixed","uid":3833498,"size":4579692795,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:af0311706f2ba4ad203b4f8182340e8d2c365962&amp;dn=The+Simpsons+-+Season+6+Complete+%5BDVDRIP+VP7+KEGGERMAN%5D+fixed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KEGGERMAN","files":28,"time":1191788547,"description":"SHOW........[ The Simpsons - Season 6 ]\nRIPPER......[ KEGGERMAN ]\nAUDIO.......[ MP3 48000Hz 128kb/s CBR (2 Channel) ]\nLANGUAGE....[ English ]\nCODEC.......[ VP7 ]\nRESOLUTION..[ 576 x 384 ]\nFRAME RATE..[ 23.976 FPS ]\nSUB TITLES..[ NONE ]\nSOURCE......[ NTSC DVD ]\nEPISODES....[ 25 ]\n\n\nNOTES.......[ VP7 CODEC CAN BE DOWNLOADED HERE: ]\n             &lt;a href=&quot; http://www.on2.com/cms-data/downloads/on2_vp7_personal_edition.exe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.on2.com/cms-data/downloads/on2_vp7_personal_edition.exe&lt;/a&gt;\nPLEASE VISIT[ 66Trader.com ]\n \n\n\n\nEPISODE 1\nTITLE.......[ Bart of Darkness ]\nRUNTIME.....[ 22:57 ]\nFIRST AIRED.[ 9/4/94 ]\nDATA RATE...[ 129 kbps ]\nDESCRIPTION.[ It is really hot and the Simpson family does not have air \nconditioning. They try to live in a tent beside the refrigerator, but that does \nnot work. Otto drives by with a traveling swimming pool. This gives Bart and Lisa\nthe idea to hound Homer for a pool which they relentlessly do until he caves in\nand buys them one. All the kids in the neighborhood come by to use it. Bart tries\nto jump from his tree house into the pool, but winds up breaking his leg. He will\nhave to spend the rest of the summer in a cast, so there will be no more swimming\nfor him. He watches as Lisa becomes incredibly popular. Bart finds himself a new\nhobby by spying on the neighborhood with Lisa&amp;#039;s telescope. While looking out the\n&quot;Rear Window&quot; of the house, Bart thinks he&amp;#039;s seen Flanders commit a murder. He \ngets Lisa to break into Flanders&amp;#039; house and look for clues. He watches as \nFlanders returns home with an axe. He goes to help her, broken leg and all. Then\nFlanders tells them that Maude has been away at bible camp, but now she is back.]\n\n\n\nEPISODE 2\nTITLE.......[ Lisa&amp;#039;s Rival ]\nRUNTIME.....[ 23:02 ]\nFIRST AIRED.[ 9/11/94 ]\nDATA RATE...[ 129 kbps ]\nDESCRIPTION.[ Lisa wants to practice her saxophone because she is auditioning for\nfirst chair in the school band. A new student named Allison enters her class. \nAllison was skipped ahead a grade by Principal Skinner. Lisa is really jealous \nof her and is horrified to learn that Allison is going for first chair saxophone,\ntoo. Meanwhile, Homer and Bart find an overturned truck full of sugar. Homer \nfills up his car with it. Lisa loses her quest for first chair and Allison \nbecomes the new smart girl at school, making Lisa feel terrible. When Lisa tries\nto befriend her, it does not work. Bart helps her think of a way to beat Allison\nat an upcoming diorama contest. Homer guards his sugar pile in the backyard and\nhe is completely paranoid about an Englishman trying to steal it to put it into\nhis tea. Instead bees find his stash. Beekeepers come to get them back. When it\nrains, Homer&amp;#039;s sugar pile melts into the ground. Bart and Lisa manage to sabotage\nAllison&amp;#039;s project, but Lisa can&amp;#039;t go through with it. Neither of them wins the \ncontest anyway; first place goes to Ralph Wiggum. The three smart kids, Lisa, \nAllison, and Ralph, walk home together. ]\n\n\n\nEPISODE 3\nTITLE.......[ Another Simpsons Clip Show ]\nRUNTIME.....[ 22:46 ]\nFIRST AIRED.[ 9/25/94 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ Through a series of clips from past episodes, the family recounts\ntheir trials and tribulations with love. ]\n\n\n\nEPISODE 4\nTITLE.......[ Itchy &amp; Scratchy Land ]\nRUNTIME.....[ 22:52 ]\nFIRST AIRED.[ 10/2/94 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ The Simpson family takes a vacation to Itchy &amp; Scratchy Land. When\nthe robotic Itchys and Scratchys go haywire, the Simpsons must find a way to \nescape the island. ]\n\n\n\nEPISODE 5\nTITLE.......[ Sideshow Bob Roberts ]\nRUNTIME.....[ 22:38 ]\nFIRST AIRED.[ 10/9/94 ]\nDATA RATE...[ 131 kbps ]\nDESCRIPTION.[ Homer has been listening to a conservative radio talk show host. \nOne day Sideshow Bob calls in from prison, voicing his conservative views. The \nhost, Barlow, gets Sideshow Bob released from prison. Upon Sideshow Bob&amp;#039;s \nrelease, the town&amp;#039;s Republicans want him to run for mayor against Quimby. Bob \noutwits Quimby in every debate and wins by a huge landslide. Lisa is skeptical \n(as usual) about how he did it, so she investigates. Meanwhile, Homer has \nproblems with the gang from Riverdale. Sideshow Bob imposes a few new policies.\nFor one he condemns the Simpsons&amp;#039; house to help make way for the new Matlock \nExpressway, much to the delight of the seniors. Second, he gets Bart placed in \nkindergarten. Lisa discovers how Sideshow Bob won the election: he had dead \npeople vote for him. He admits to all of this when Bart and Lisa outwit him in \nfront of the town. Sideshow Bob goes back to prison. ]\n\n\n\nEPISODE 6\nTITLE.......[ Treehouse of Horror V ]\nRUNTIME.....[ 22:55 ]\nFIRST AIRED.[ 10/30/94 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ THE SHINNING: The family becomes caretakers of an estate in the \nmountains owned by Mr. Burns, where he cuts the cable and takes out all beer, \nwhich leads Homer to insanity. \nTIME AND PUNISHMENT: Homer fixes the toaster and it becomes a time machine. \nWhile visiting the past, he kills a bug, which affects the future in a big way. \nWhen he tries to fix the timeline, he breaks it again. He ends up trying numerous\ntimes until he settles on his family eating with frog-like tongues. \nNIGHTMARE CAFETERIA: Principal Skinner finds a solution to his overcrowding \nproblem and the quality of meat in the cafeteria: eating the students. ]\n\n\n\nEPISODE 7\nTITLE.......[ Bart&amp;#039;s Girlfriend ]\nRUNTIME.....[ 22:30 ]\nFIRST AIRED.[ 11/6/94 ]\nDATA RATE...[ 132 kbps ]\nDESCRIPTION.[ The parents stop the kids in the middle of their game and bring \nthem to church. Bart sees Lovejoy&amp;#039;s daughter, Jessica and it&amp;#039;s love at first \nsight for him. He tries to impress her, even by trying to become a good person,\nbut nothing is working. So he goes back to being the devil&amp;#039;s cabana boy and pulls\na prank on Willie. This is what impresses Jessica, so she invites him over for \ndinner. The Lovejoys do not like him, especially after talking about last night&amp;#039;s\nepisode of Martin. This makes Jessica like him even more. They hang out together\nand behave badly, but she pretends not to know him in public. Jessica is using \nhim, but he will do anything to please her, but it begins to depress him. He \nvows to quit seeing her, but he just can&amp;#039;t help himself. Of Jessica and Bart, he\nis the lesser of two evils, especially when Jessica pins the blame on him after\nshe steals the church&amp;#039;s collection plate. The congregation chases him and Jessica\nwon&amp;#039;t come forward; it&amp;#039;s up to Lisa to tell everyone that it was Jessica that \nstole the plate. The plate is found in Jessica&amp;#039;s room, Jessica continues on \nmaking men do whatever she wants. ]\n\n\n\nEPISODE 8\nTITLE.......[ Lisa on Ice ]\nRUNTIME.....[ 22:36 ]\nFIRST AIRED.[ 11/13/94 ]\nDATA RATE...[ 131 kbps ]\nDESCRIPTION.[ Lisa is failing gym. To make up the grade, she joins a pee-wee \nhockey league. Soon, her team must face off against Bart&amp;#039;s, putting them in \ndirect competition. ]\n\n\n\nEPISODE 9\nTITLE.......[ Homer Badman ]\nRUNTIME.....[ 22:36 ]\nFIRST AIRED.[ 11/27/94 ]\nDATA RATE...[ 131 kbps ]\nDESCRIPTION.[ Homer and Marge attend a candy convention and have to find a \nbabysitter for the kids. After the convention, Homer gives the babysitter a ride\nhome. He notices that there is a very rare gummy stuck to her bottom, so he \nreaches out and grabs it. Homer is accused of sexual harassment and the whole\ntown is against him until Willie saves the day. ]\n\n\n\nEPISODE 10\nTITLE.......[ Grampa vs. Sexual Inadequacy ]\nRUNTIME.....[ 22:35 ]\nFIRST AIRED.[ 12/4/94 ]\nDATA RATE...[ 131 kbps ]\nDESCRIPTION.[ Homer and Marge are having a troublesome sex life until Grampa \nintroduces Homer to a home remedy love tonic. They soon go on the road together,\ntrying to make some money off Grampa&amp;#039;s potion. All the while, all the adults in\nSpringfield are taking advantage of their new love lives, leaving the children \nthinking that UFO&amp;#039;s are to blame. ]\n\n\n\nEPISODE 11\nTITLE.......[ Fear of Flying ]\nRUNTIME.....[ 22:34 ]\nFIRST AIRED.[ 12/18/94 ]\nDATA RATE...[ 132 kbps ]\nDESCRIPTION.[ Homer gets banned from Moe&amp;#039;s and while searching for a new place \n&quot;where everybody knows his name&quot; stumbles into an airport bar and ends up almost\nflying a plane after being mistaken for a pilot. The airline gives him free \nairline tickets so he won&amp;#039;t tell anyone. He takes the family and Marge goes \nnutso on the plane. Back at home, she starts acting really crazy. Lisa wants her\nto go into therapy, but Homer is reluctant. He is afraid a shrink will tell \nMarge to leave him. He rents some videos for her, so she won&amp;#039;t have to go into \ntherapy. They are &quot;Hero,&quot; &quot;Fearless,&quot; and &quot;Alive.&quot; Soon afterward she goes into\ntherapy, which reveals that she&amp;#039;s repressed something she saw her father do when\nshe was a young girl. It turns out her father was a stewardess. ]\n\n\n\nEPISODE 12\nTITLE.......[ Homer the Great ]\nRUNTIME.....[ 22:37 ]\nFIRST AIRED.[ 1/8/95 ]\nDATA RATE...[ 131 kbps ]\nDESCRIPTION.[ Homer has trouble with a plumber and at work he begins noticing \nthat Lenny and Carl have a lot of mysterious privileges at work. Lenny keeps \ngiving hints that they are part of a secret. Homer follows them one night when \nthey go to their secret meeting place. Every male in Springfield that he knows \nis in the place. Lenny lets it slip that they are the Stonecutters and Homer \nwants to be a member. He discovers that Abe is a member, which means that he can\neasily become a member. They initiate him with painful rituals and he is member\n#908. As a Stonecutter, the plumber quickly fixes the leak in his basement and\nhe gets a new parking space at work. When they celebrate a big occasion Homer \ndesecrates a sacred parchment. As his punishment Homer is kicked out of the club\nand they take his clothes. Upon stripping him, they discover a birthmark. It is\nshaped like their logo, which means he must be the chosen one. They begin to \nworship him. They let him win at card games. Soon his life becomes meaningless\nand too easy. Lisa recommends that he begin helping people in the community \nusing his new authority. The Stonecutters don&amp;#039;t like helping people, so they \nform a new secret society, the &quot;No Homers&quot;. As the only Stonecutter left, he \nbegins feeling lonely. Marge makes him realize that he is part of a more \nexclusive club... the Simpson family. ]\n\n\n\nEPISODE 13\nTITLE.......[ And Maggie Makes Three ]\nRUNTIME.....[ 22:36 ]\nFIRST AIRED.[ 1/22/95 ]\nDATA RATE...[ 132 kbps ]\nDESCRIPTION.[ The family gathers together as Homer tells the story of why \nthere are no pictures of Maggie in the house. ]\n\n\n\nEPISODE 14\nTITLE.......[ Bart&amp;#039;s Comet ]\nRUNTIME.....[ 22:35 ]\nFIRST AIRED.[ 2/5/95 ]\nDATA RATE...[ 131 kbps ]\nDESCRIPTION.[ Principal Skinner releases a weather balloon, but Bart turns it \ninto an anti-Skinner prank. Principal Skinner is upset, so Bart&amp;#039;s punishment is\nto help him log amateur astronomy sky coordinates. Bart gets up at 4:30 AM to \nassist Skinner. When Skinner steps away, Bart discovers a comet. The nerds of \nthe school, super friends, soon embrace him. When they figure out that his comet\nis approaching Springfield and will annihilate the town, Professor Frink comes \nup with a plan to intercept the comet with a missile. Unfortunately the missile\nmisses and destroys the only bridge out of town; the people of Springfield are \ndoomed! The Flanders family let the Simpsons in their bomb shelter. The rest of\nthe town asks Ned if they can come in as well. When the shelter is too full, one\nperson has to leave, so they kick Ned Flanders out. Soon they feel guilty about\nit, so they all leave to die with him. The comet comes through the atmosphere \nand breaks apart due to all of Springfield&amp;#039;s polluted clouds. ]\n\n\n\nEPISODE 15\nTITLE.......[ Homie the Clown ]\nRUNTIME.....[ 22:34 ]\nFIRST AIRED.[ 2/12/95 ]\nDATA RATE...[ 131 kbps ]\nDESCRIPTION.[ Homer sees a sign for clown college and cannot resist. After \nbecoming an official Krusty the Clown impersonator, Homer runs into some trouble\nwith the mafia. ]\n\n\n\nEPISODE 16\nTITLE.......[ Bart vs. Australia ]\nRUNTIME.....[ 22:38 ]\nFIRST AIRED.[ 2/19/95 ]\nDATA RATE...[ 131 kbps ]\nDESCRIPTION.[ Lisa explains the Coriolis Effect to Bart, but he does not believe\nit, so he makes a collect call to Australia to ask them about which way their \nwater drains. When Bart doesn&amp;#039;t hang up, Australia owes $900. They want Bart to\npay, but he insults them. Bart soon gets dozens of letters in the mail. Then \nAustralia indicts him for fraud. America wants to send him to Australia to make\nan apology. The family is sent to Australia, where they start exploring the \nculture. Bart makes his apology, but they want to give the additional punishment\nof a boot to his ass. Bart and Homer escape the booting and they try to run back\nto the embassy. Bart agrees to have them do the booting anyway, but instead he \nmoons Australia. The Simpson family leaves the outraged country in a helicopter.]\n\n\n\nEPISODE 17\nTITLE.......[ Homer vs. Patty and Selma ]\nRUNTIME.....[ 22:35 ]\nFIRST AIRED.[ 2/26/95 ]\nDATA RATE...[ 131 kbps ]\nDESCRIPTION.[ Homer loses all his money in pumpkin stocks and must turn to Patty\nand Selma for a loan. He tries his best to keep it a secret from Marge. \nMeanwhile, Bart is late for physical education class sign-ups and has to take \na ballet class. ]\n\n\n\nEPISODE 18\nTITLE.......[ A Star Is Burns ]\nRUNTIME.....[ 22:38 ]\nFIRST AIRED.[ 3/5/95 ]\nDATA RATE...[ 131 kbps ]\nDESCRIPTION.[ Springfield is the least popular town in America. They have a town\nmeeting on how to attract tourists and Marge pitches the idea for a film \nfestival. After they accept her idea, she searches for a film critic to be the \njudge and Jay Sherman is her choice. He comes to Springfield and stays with the \nSimpson family. Mr. Burns decides to enter the festival to boost his reputation,\nand makes a horribly self-indulgent film. Jay Sherman fits right in with the \nSimpson family, but he and Homer quickly form a rivalry. After the screenings,\nHomer has already made up his mind he is going to vote for the dumbest video,\nthe one by Hans Moleman. This is an injustice to Barney&amp;#039;s film about alcoholism,\nwhich is the best of the bunch. The jury includes Jay, Homer, Krusty, Marge, and\nMayor Quimby. Mr. Burns bribes Krusty and Quimby to vote for him. Homer decides\nto change his vote to Barney&amp;#039;s film, so Mr. Burns loses. What does Barney win?\nWhy beer, of course! Mr. Burns later tries (unsuccessfully) to bribe the Academy\nAwards. ]\n\n\n\nEPISODE 19\nTITLE.......[ Lisa&amp;#039;s Wedding ]\nRUNTIME.....[ 22:35 ]\nFIRST AIRED.[ 3/19/95 ]\nDATA RATE...[ 132 kbps ]\nDESCRIPTION.[ When Lisa gets lost at a Renaissance Faire, she meets a mysterious\nfortune teller offers to tell her about her future by reading her cards. We \nflash forward to 2010 at an Eastern university where she meets an arrogant \nproper young English gentleman named Hugh. They fall madly in love with each \nother, and Hugh proposes to Lisa. Lisa brings Hugh to Springfield so that he can\nmeet the Simpson family. Hugh spends time with Bart and Homer, and it turns out\nto be a nightmare. On the day of the wedding, Hugh suggests that they go back to\nEngland and leave her family out of her life. Realizing that she has fallen in\nlove with the wrong man, Lisa gives the engagement ring back to Hugh, and the \nwedding is called off. The fortune teller then vanishes in a puff of smoke and \nLisa meets back up with Homer, appreciating him a little more than usual. ]\n\n\n\nEPISODE 20\nTITLE.......[ Two Dozen and One Greyhounds ]\nRUNTIME.....[ 22:38 ]\nFIRST AIRED.[ 4/9/95 ]\nDATA RATE...[ 131 kbps ]\nDESCRIPTION.[ The family notices that Santa&amp;#039;s Little Helper has been destroying \nthe house. He soon runs away and goes back to the dog track from which he came.\nHe finds another greyhound there and humps her in front of everyone. The family\ndecides to bring her home. The two dogs quickly fall in love. Santa&amp;#039;s Little \nHelper&amp;#039;s bitch has 25 puppies, but 25 puppies are too much for the Simpson \nfamily. They spoil an important dinner party. The family decides to give them\naway, but Mr. Burns dognaps them. They wonder what he could possibly want with\nthem. Bart and Lisa go to spy on him and see what he is doing. He plans to kill\nthem and make them into a greyhound skin tuxedo. They try to save the puppies,\nbut Mr. Burns catches them before they escape. Mr. Burns has one of his \ncharacteristic changes of heart and decides not to kill them. He keeps all the\npuppies which grow to become successful racing dogs, making him even richer. ]\n\n\n\nEPISODE 21\nTITLE.......[ The PTA Disbands ]\nRUNTIME.....[ 22:34 ]\nFIRST AIRED.[ 4/16/95 ]\nDATA RATE...[ 131 kbps ]\nDESCRIPTION.[ Bart pushes the teachers to strike. Local Springfieldians take \nover the teaching positions, so Bart must find a way to fix things between the \nteachers and Principal Skinner. ]\n\n\n\nEPISODE 22\nTITLE.......[ Round Springfield ]\nRUNTIME.....[ 22:35 ]\nFIRST AIRED.[ 4/30/95 ]\nDATA RATE...[ 132 kbps ]\nDESCRIPTION.[ Bart gets his appendix removed after swalling a jagged metal prize\nin his bowl of Krusy-O&amp;#039;s. He is awarded $500. Meanwhile, &quot;Bleeding Gums&quot; Murphy\npasses away and leaves Lisa his saxaphone. To honor Murphy, Lisa must raise $500\nto buy his record so that it can be played on the radio. ]\n\n      \n                 \nEPISODE 23\nTITLE.......[ The Springfield Connection ]\nRUNTIME.....[ 22:34 ]\nFIRST AIRED.[ 5/7/95 ]\nDATA RATE...[ 131 kbps ]\nDESCRIPTION.[ Marge has a very dangerous encounter with a criminal. The \nadrenaline rush inspires her to become a police officer. ]\n                       \n\n\nEPISODE 24\nTITLE.......[ Lemon of Troy ]\nRUNTIME.....[ 22:35 ]\nFIRST AIRED.[ 5/14/95 ]\nDATA RATE...[ 132 kbps ]\nDESCRIPTION.[ The children of Springfield wage war on Shelbyville, after their \nbeloved town lemon tree comes up missing. The fathers of Springfield take Ned&amp;#039;s\nRV to search for their boys. ]\n                       \n\n\nEPISODE 25\nTITLE.......[ Who Shot Mr. Burns? (Part One) ]\nRUNTIME.....[ 22:38 ]\nFIRST AIRED.[ 5/21/95 ]\nDATA RATE...[ 131 kbps ]\nDESCRIPTION.[ The entire town of Springfield is enraged at Mr. Burns after he \nsteals oil from the school, destroys the retirement home, closes down businesses\nand plans to block out the sun. After the town meeting, Mr. Burns is found shot.\nWho was the gunman? ]\n\n                       \n","torrent":{"xt":"urn:btih:af0311706f2ba4ad203b4f8182340e8d2c365962","amp;dn":"The+Simpsons+-+Season+6+Complete+%5BDVDRIP+VP7+KEGGERMAN%5D+fixed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af0311706f2ba4ad203b4f8182340e8d2c365962","infoHashBuffer":{"type":"Buffer","data":[175,3,17,112,111,43,164,173,32,59,79,129,130,52,14,141,44,54,89,98]},"announce":[],"urlList":[]}}