{"title":"Mushrooms as Functional Foods {BBS}","uid":6853528,"size":2678228,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:afb33ba6d819285910336b53dd1e1cec9993eb30&amp;dn=Mushrooms+as+Functional+Foods+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1322610554,"description":"Food scientists will dig into this robust reference on mushrooms\n\nMushrooms as Functional Foods is a compendium of current research on the chemistry and biology, nutritional and medicinal value, and the use of mushrooms in the modern functional foods industry. Topics covered range from the agricultural production of mushrooms to the use of molecular biological techniques like functional genomics; from nutritional values of newly cultivated mushroom species to the multifunctional effects of the unconventional form of mushroom (sclerotium); from the physiological benefits and pharmacological properties of bioactive components in mushrooms to the regulation of their use as functional foods and dietary supplements in different parts of the world. With contributions from leading experts worldwide, this comprehensive reference:\n\n* Reviews trends in mushroom use and research, with extensive information on emerging species\n* Includes coverage of cultivation, physiology, and genetics\n* Highlights applications in functional foods and medicinal use\n* Covers worldwide regulations and safety issues of mushrooms in functional foods and dietary supplements\n* Discusses the classification, identification, and commercial collection of newly cultivated mushroom species\n* Features a color insert with photographs of different types of mushrooms\n\nThis is an integrated, single-source reference for undergraduates majoring in food science and nutrition, postgraduates, and professional food scientists and technologists working in the functional food area, and medical and health science professionals interested in alternative medicines and natural food therapies.\n\n\n# Hardcover: 268 pages\n# Publisher: Wiley-Interscience; 1 edition (September 16, 2008)\n# Language: English\n# ISBN-10: 0470054069\n# ISBN-13: 978-0470054062","torrent":{"xt":"urn:btih:afb33ba6d819285910336b53dd1e1cec9993eb30","amp;dn":"Mushrooms+as+Functional+Foods+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afb33ba6d819285910336b53dd1e1cec9993eb30","infoHashBuffer":{"type":"Buffer","data":[175,179,59,166,216,25,40,89,16,51,107,83,221,30,28,236,153,147,235,48]},"announce":[],"urlList":[]}}