{"title":"CBT Nuggets Cisco CCNP Certification Package","uid":4381849,"size":995118480,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:afcb4a8090a0f7babf041c9b0ddbb5d115bb13cd&amp;dn=CBT+Nuggets+Cisco+CCNP+Certification+Package&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"shemyaza","files":369,"time":1220699735,"description":"The CBT Nuggets Cisco CCNP Certification Package contains these exam-packs:\n\nExam-Pack: 642-901 BSCI (Building Scalable Cisco Internetworks)\n\nThe BSCI series, at its core, is all about routing. You'll immerse yourself in the features and functionalities of Cisco routers. This includes deploying, managing, and optimizing the performance of Cisco routers. Major topics in this series include EIGRP, OSPF, IS-IS, Advanced Routing, BGP, Multicast, and IPv6.\n\nExam-Pack: 642-812 BCMSN (Building Converged Cisco Multilayer Switched Networks)\n\nBCMSN is all about deploying, managing, and optimizing Cisco switches. You'll learn the role of switches in your Cisco network, including smart network design for today's networking needs. Major topics in this series include VLANs, STP, Ether Channel, Layer 3 Switching, Redundancy, Wireless LANs, Campus VoIP, and Campus Security.\n\nExam-Pack: 642-825 ISCW (Implementing Secure Converged Wide Area Networks)\n\nIn the ISCW series you'll learn how to create and manage secure, robust remote access solutions. In today's world of frequent telecommuting and distant offices throughout the globe, this topic is getting bigger than ever. Major topics you'll learn include understanding WAN technologies, Multiprotocol Label Switching, configuring IPSec VPNs, and securing your network. \n\nExam-Pack: 642-845 ONT (Optimizing Converged Cisco Networks)\n\nThe ONT series covers how to configure your network to support rich media traffic including Voice over IP and video conferencing. The throughput and quality of service required for these technologies is higher than normal data traffic, and requires these advanced skills. Major topics in this series include understanding and implementing VoIP technologies, managing Quality of Service, and the special considerations for supporting convergence technologies on wireless networks.\n\n","torrent":{"xt":"urn:btih:afcb4a8090a0f7babf041c9b0ddbb5d115bb13cd","amp;dn":"CBT+Nuggets+Cisco+CCNP+Certification+Package","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afcb4a8090a0f7babf041c9b0ddbb5d115bb13cd","infoHashBuffer":{"type":"Buffer","data":[175,203,74,128,144,160,247,186,191,4,28,155,13,219,181,209,21,187,19,205]},"announce":[],"urlList":[]}}