{"title":"Why Civil Resistance Works - The Strategic Logic of Nonviolent C","uid":8845212,"size":4749363,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:afcfd52e919ef28ddf48300be57a47a1fd180667&amp;dn=Why+Civil+Resistance+Works+-+The+Strategic+Logic+of+Nonviolent+C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"livhre","files":-1,"time":1377362271,"description":"Though it defies consensus, between 1900 and 2006, campaigns of nonviolent resistance were more than twice as effective as their violent counterparts. Attracting impressive support from citizens that helps separate regimes from their main sources of power, these campaigns have produced remarkable results, even in the contexts of Iran, the Palestinian Territories, the Philippines, and Burma.\n\nCombining statistical analysis with case studies of these specific countries and territories, Erica Chenoweth and Maria J. Stephen detail the factors enabling such campaigns to succeed-and, at times, causing them to fail. They find that nonviolent resistance presents fewer obstacles to moral and physical involvement, information and education, and participator commitment. Higher levels of participation then contribute to enhanced resilience, a greater probability of tactical innovation, increased opportunity for civic disruption (and therefore less incentive for the regime to maintain the status quo), and shifts in loyalty among opponents' erstwhile supporters, including members of the military establishment. They find successful nonviolent resistance movements usher in more durable and internally peaceful democracies, which are less likely to regress into civil war. Presenting a rich, evidentiary argument, this book originally and systematically compares violent and nonviolent outcomes in different historical periods and geographical contexts, debunking the myth that violence occurs because of structural and environmental factors and is necessary to achieve certain political goals. Instead, Chenoweth and Stephan find violent insurgency is rarely justifiable on strategic grounds","torrent":{"xt":"urn:btih:afcfd52e919ef28ddf48300be57a47a1fd180667","amp;dn":"Why+Civil+Resistance+Works+-+The+Strategic+Logic+of+Nonviolent+C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afcfd52e919ef28ddf48300be57a47a1fd180667","infoHashBuffer":{"type":"Buffer","data":[175,207,213,46,145,158,242,141,223,72,48,11,229,122,71,161,253,24,6,103]},"announce":[],"urlList":[]}}