{"title":"Anamanaguchi - Endless Fantasy (2013) [FLAC]","uid":8486814,"size":648061439,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b0b1e179d9c454424074551dd1f59862a2faa0ee&amp;dn=Anamanaguchi+-+Endless+Fantasy+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1368889410,"description":"\n  Anamanaguchi - Endless Fantasy (2013) [FLAC]\n\n  Released: 2013\n  Duration: 76:09\n  Genre: Electronic\n  Style: Chiptune, Indie Electronic\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bits Per Sample: 16\n  Smaple Rate: 44,100 Hz\n\n  01 Endless Fantasy\n  02 Japan Air\n  03 Echobo\n  04 Planet\n  05 Viridian Genesis\n  06 John Hughes\n  07 Prom Night\n  08 Interlude (Gymnopedie No. 1)\n  09 Akira\n  10 SPF 420\n  11 Interlude (Total Tea Time)\n  12 Meow\n  13 Canal Paradise\n  14 Snow Angels\n  15 In The Basement\n  16 U 'n' ME\n  17 Space Wax America\n  18 EVERYTHING EXPLODES\n  19 Interlude (STILL SPLODIN' THO)\n  20 Pastel Flags\n  21 Bosozoku GF\n  22 (T-T)b\n\n  After doing the soundtrack for the 2010 Scott Pilgrim video game, New York 8-bit geniuses Anamanaguchi dove headfirst into the recording of their second album. Three years (and many ideas, plans, and diversions) later, the 22-song Endless Fantasy finally saw the light of day in early 2013 on their own dream.hax label. All the time and effort put into recording the music paid off in the end, and the album is something of an 8-bit masterpiece. The band uses hacked Nintendo systems, Game Boys, and live instruments to make (mostly) instrumental music that is blindingly bright and insanely fun. They liken their music to teenaged nights listening to Weezer and playing video games, and they aren't far off. It also sounds a lot like what one would imagine for an Andrew W.K. video game soundtrack, full of energy and possessing an almost heavy metal power when the massed cartridges and guitars form into a tightly wound, ultra-powerful ball of sound. \n\n  The songs are almost all as catchy as lice in a preschool, with the game consoles playing super hooky melodies and the instruments crashing along behind. Apart from a couple quiet transitional pieces of near-classical calm, there's not a single moment that isn't joyous fun as the band pushes down on the happiness throttle and never lets up -- sometimes sounding like the house band at the giddiest emo-pop (minus the emo) party ever, other times like they were doing the theme music for a super nerdy podcast (which isn't far off since they do that for The Nerdist). The occasional vocal interludes (three in all) show that they aren't a one-dimensional trick band; &quot;Japan Air&quot; bounces frantically like Puffy AmiYumi at +8, &quot;Prom Night&quot; sounds almost like it could be a club hit as the beat pounds along and Bianca Raquel's pleading vocals come across like a cartoon Katy Perry. As impressive as their hacking skills may be, the group's true strength is that if you stripped away the bits and chips, the songs underneath are strong enough to stand on their own. The beauty is that you don't have to strip away anything, because everything happens on Endless Fantasy all the time! It's a one-stop shop for all the goofy sounds, frenetic energy, and fast-paced fun one music fan can handle. Anamanaguchi may not have invented chiptune or 8-bit music, but they've pretty much perfected it.","torrent":{"xt":"urn:btih:b0b1e179d9c454424074551dd1f59862a2faa0ee","amp;dn":"Anamanaguchi+-+Endless+Fantasy+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0b1e179d9c454424074551dd1f59862a2faa0ee","infoHashBuffer":{"type":"Buffer","data":[176,177,225,121,217,196,84,66,64,116,85,29,209,245,152,98,162,250,160,238]},"announce":[],"urlList":[]}}