{"title":"[HorribleSubs] Naruto Shippuuden - 388 [1080p]","uid":11578523,"size":556138653,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:b0ed01667d0156a6547d03c1631ada8850a2a78a&amp;dn=%5BHorribleSubs%5D+Naruto+Shippuuden+-+388+%5B1080p%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"xKTRx","files":-1,"time":1417103542,"description":"[HorribleSubs] Naruto Shippuuden - 388 [1080p]\n\n\n\nNaruto Shippuuden is the continuation of the original animated TV series Naruto.The story revolves around an older and slightly more matured Uzumaki Naruto and his quest to save his friend Uchiha Sasuke from the grips of the snake-like Shinobi, Orochimaru. After 2 and a half years Naruto finally returns to his village of Konoha, and sets about putting his ambitions to work, though it will not be easy, as He has amassed a few (more dangerous) enemies, in the likes of the shinobi organization; Akatsuki\n\nThe episodes from this the sixteenth season of the anime series are based on Part II of the setting of Naruto manga series by Masashi Kishimoto. The first thirteen episodes of season focus on the past of Kakashi Hatake, from his days as a member of ANBU to his forming a team with Naruto, Sasuke, and Sakura. The episodes that follow continue the Allied Ninjas' battle with Madara Uchiha and Obito Uchiha. The episodes are directed by Hayato Date and produced by Studio Pierrot and TV Tokyo. The sixteenth season began airing on February 6, 2014 on TV Tokyo and is still ongoing. This season contains four musical themes: two openings and two endings. The first opening theme, &quot;Tsuki no Okisa&quot; (The Size of the Moon) by Nogizaka46, is used from episode 349 to 356. The second opening theme, &quot;Guren&quot; (Crimson) by DOES, is used from episode 357 onwards. The first ending theme, &quot;Niji&quot; (Rainbow) by Shinku Hollow, is used from episodes 349 to 356. The second ending theme, &quot;FLAME&quot; by DISH is used from episode 357 and onwards","torrent":{"xt":"urn:btih:b0ed01667d0156a6547d03c1631ada8850a2a78a","amp;dn":"%5BHorribleSubs%5D+Naruto+Shippuuden+-+388+%5B1080p%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0ed01667d0156a6547d03c1631ada8850a2a78a","infoHashBuffer":{"type":"Buffer","data":[176,237,1,102,125,1,86,166,84,125,3,193,99,26,218,136,80,162,167,138]},"announce":[],"urlList":[]}}