{"title":"Sexually Broken--Stunning Aria Alexander in a rough BaRS show, b","uid":12873369,"size":748826769,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b12e9921edead0abe4aa5a61fd18473b0e1e4cfb&amp;dn=Sexually+Broken--Stunning+Aria+Alexander+in+a+rough+BaRS+show%2C+b&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":1,"time":1448918508,"description":"\nStunning Aria Alexander in a rough BaRS show, bound down and throat trained into a drooling mess! | Aria Alexander | Matt Williams | Jack Hammer \r\n\r\nNovember 30, 2015\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nPale beauty bound on her knees facefucked by BBC \r\n\r\nIf you are ever curious what it would like to be live on a porn set as a shoot happens, wonder no more. BaRS shows are all live action, no breaks or mercy, as you see someone Sexuallybroken right in front of your eyes. We take a fresh and sexy starlet and completely destroy her by dick. By the time we are done with them, we have unwrapped her fine finish and revealed the wanton animal beneath.\r\n\r\nOur toy for the day is the stunningly beautiful Aria Alexander. She looks too pretty for porn. Lucky for us, she really actually likes the porn and craves the rough handling that we specialize in. Let’s start off with some throat training shall we? All it takes it a fuck table and some handcuffs to put this pussy on her knees where she belongs. One after the other the dicks step up to run a train on her eager throat.\r\n\r\nThe huge hard cocks own her face as Aria is quickly reduced to a drooling mess. Her fine makeup is wiped right off her pretty face. Makeup doesn’t stand a chance against the dick, dick wins every single time. From the pleased look on her face, Aria doesn’t mind the loss of her makeup one bit. Her eyes shine out through her drool covered face and her juices flow down her dress. Messy messy Aria.\r\n\r\nThis is just the first round. Now that her throat is nice and warmed up, it is time to try a different hole. Stay tuned to see what we have in store for our starlet next. Aria is in for one of the most intense shoots of her life, as only Sexuallybroken can do. \r\n\r\nScreens \nhttp://www.sexuallybroken.com/sexual/bondage/trailer.php?y=2015&amp;p=11_30aalexander7&amp;u=SexuallyBroken-Aria-Alexander-Matt-Williams-Jack-Hammer-Stunning-Aria-Alexander-in-a-rough-BaRS-show-bound-down-and-throat-trained-into-a-drooling-mess\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n19 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\r\n\r\nJust keep on leaving us the nice comments below and we are happy :)\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:b12e9921edead0abe4aa5a61fd18473b0e1e4cfb","amp;dn":"Sexually+Broken--Stunning+Aria+Alexander+in+a+rough+BaRS+show%2C+b","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b12e9921edead0abe4aa5a61fd18473b0e1e4cfb","infoHashBuffer":{"type":"Buffer","data":[177,46,153,33,237,234,208,171,228,170,90,97,253,24,71,59,14,30,76,251]},"announce":[],"urlList":[]}}