{"title":"Gnomoria v0.9.2","uid":9186971,"size":226576261,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b21e8c32e41b72ff17a4b8fe2dba4ac58dc4a652&amp;dn=Gnomoria+v0.9.2+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aedziex23","files":-1,"time":1384322206,"description":"Gnomoria is a sandbox village management game where you help lead a small group of gnomes, who have set out on their own, to thrive into a bustling kingdom! Anything you see can be broken down and rebuilt elsewhere. Craft items, build structures, set traps and dig deep underground in search of precious resources to help your gnomes survive the harsh lands. Build your kingdom and stockpile wealth to attract wandering gnomads to your cause, but be wary of also attracting enemies!\n\nKey Features:\n\n- Procedurally generated world - Every game is different\n- Fully destructible environment - Everything can be mined, dug, chopped and rebuilt or used for crafting\n- Open sandbox gameplay - Play how you want - manage a peaceful town or build up military and fend off invasions.\n- Crafting - Tons of items to craft at different workshops\n- Mechanisms - Construct elaborate contraptions using parts like hatches, levers, steam engines\n\nv0.9.2\n\nCombat\n\n- Changed material durability so that different attack types work towards breaking it\n- Adjusted all material resistances to account for durability changes\n- Weapons with multiple attacks pick the one that works best for the situation\n- Adjusted experience gains with weapons so that slow weapons and two handed weapons are on par with fast weapons and dual wielding\n- Defending with weapons has been further separated from attacking with the weapon. Ie blocks and parrys are much more common\n- Some status effects from combat can be applied through armor\n- Sword\n - Increased attack time for stab\n - Increased pierce damage and decreased slashing damage\n - Reduced attack delay when parrying\n - Removed blunt damage\n- Axe\n - Increased slash damage\n - Removed blunt damage\n- Claymore\n  - Removed thrust attack\n  - Decreased slash damage and increased blunt damage\n- Battle Axe\n  - Removed blunt damage\n  - Increased slash damage\n  - Warhammer - Increased blunt damage\n  - Torch - Decreased heat damage\n  - Increased ranged and melee damage with ranged weapons\n  - Removed blunt damage from musket rounds\n  - Increased Blunderbuss ranged attack time\n  - Decreased Crossbow ranged attack time\n- Trap\n  - Increased damage for spike and blade traps\n  - Removed blunt damage from blade trap\n- Mant\n  - Reduced damage for bite attack and increased attack time\n  - Reduced damage for sting attack\n- Beetle - Reduced damage for bite attack and increased attack time\n- Spider\n  - Increased damage for bite attack and reduced attack time\n  -  Increased damage for sting attack and increased attack time\n- Ogre/Two-Headed Ogre\n  - Increased damage for all attacks\n  - Reduced attack time for punch attack\n- Zombie - Increased damage for all attacks\n- Goblin - Lowered Fighting and Dodge skills for early goblins\n- Frenzy - Increased Defense penalty and now it also applies to dodge\n- Highlander - Greatly increased chance to hit necks\n- Way of the Gnome\n  - Attack speed, dodge chance and dodge rate now increase based on skill values instead of flat rate\n  - Bonus Damage has been added based on Fighting skill\n- Guard - Block chance increases with Shield skill\n- Scout - Added increased move speed in addition to vision range\n- Marksman - Fixed this perk not actually increasing accuracy\n- Taunt - New perk that has a chance to force nearby enemies to change targets to this gnome\n- Commander - New perk that increases damage of squad members when this gnome is not wearing a helmet\n\nFixed\n- Two crashes when loading saves older 0.8.22 and 0.8.26 straight into the current version\n- Mining walls deconstructing adjacent torches. (Still appropriately deconstructs wall torches)\n\nSystem requirements:\n\nOS: Windows XP, Vista, 7, 8\nProcessor: 2.0 GHz\nMemory: 1 GB\nHard Disk Space: 200 MB\nVideo Card: 128 MB Video Memory\nDirectX: 9.0c or Greater\n\nInstallation:\n\n1. Unzip\n2. Place Gnomoria folder anywhere on your drive\n3. PLAY!\n\nXNA Framework 4.0 and .NET Framework 4.0 are included in the _CommonRedist folder. (Install these first)\n\nYou can help the developer and buy the game on steam here:  &lt;a href=&quot;\nhttp://store.steampowered.com/app/224500/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/224500/&lt;/a&gt;","torrent":{"xt":"urn:btih:b21e8c32e41b72ff17a4b8fe2dba4ac58dc4a652","amp;dn":"Gnomoria+v0.9.2+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b21e8c32e41b72ff17a4b8fe2dba4ac58dc4a652","infoHashBuffer":{"type":"Buffer","data":[178,30,140,50,228,27,114,255,23,164,184,254,45,186,74,197,141,196,166,82]},"announce":[],"urlList":[]}}