{"title":"Sally Spring - Mockingbird 2006 Flac","uid":9501086,"size":282437956,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b491ce388148d4075c742d6f8268cad9e4213a84&amp;dn=Sally+Spring+-+Mockingbird+2006+Flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"dickspic","files":19,"time":1390229769,"description":"Artist: Sally Spring\nRelease: Mockingbird \nReleased: 2006\nLabel: Sniffinpup Records\nCatalog#: CD-SNP-0001\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: folk\n\nimage\n\n\n01 Take Me To The Water\n02 Hickory Wind\n03 Going To California\n04 I Can't Understand Why\n05 Here Come The Memories\n06 Old Man As He Walks Out The Door\n07 Floyd Johnson\n08 Blue, Blue Heaven\n09 Ain't No Ash Will Burn\n10 Pretty Peggie-O\n11 Red-Winged Blackbird\n12 Hickory Wind (Acoustic)\n\n\n\n\nSally Spring is a singer and songwriter who has been bouncing along the edges of the music scene in California and the South since the early '70s, but while she's earned a loyal following among her fellow musicians, she's preferred to release her recordings on her own, which has helped keep her work from reaching a larger audience. (The fact that Spring has only one hand and plays guitar using a special open tuning has perhaps led some to dismiss her as a novelty act without listening to her work.) Mockingbird is the first Sally Spring record to receive proper nation-wide distribution, and as a result it presents a &quot;new&quot; talent who has a lifetime of experience to draw upon, and there's an intelligence and maturity in this album that's satisfying and compelling. Spring's rich, slightly smoky voice (which suggests the clarity of Sandy Denny mixed with the sweet earthiness of Carole King or early Marianne Faithfull) is a surprisingly malleable instrument, and she interprets the ancient folk standard &quot;Pretty Peggie-O&quot; with the same plainspoken skill as Gram Parsons' &quot;Hickory Wind.&quot; Spring's own songs confirm she's as gifted a writer as she is a performer, and her knack for capturing the fine details of seemingly ordinary lives is winning; plenty of folks have written &quot;stop and smell the roses&quot; songs, but few seem as fresh and well thought out as &quot;Red Winged Blackbird&quot; and &quot;Going to California.&quot; &quot;Floyd Johnson&quot; and &quot;Here Come the Memories&quot; are beautifully rendered thumbnail sketches set to music. Spring is ably assisted by producers Ted Lyons and Chris Stamey, and a fine cast of musicians including Gene Parsons, Marshall Crenshaw, Tift Merritt, and Caitlin Cary, but ultimately Spring earns the focus on Mockingbird by virtue of her own wonderful voice, and if this is a belated introduction to a larger audience, the quality of this effort suggests the wait has been worthwhile.","torrent":{"xt":"urn:btih:b491ce388148d4075c742d6f8268cad9e4213a84","amp;dn":"Sally+Spring+-+Mockingbird+2006+Flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b491ce388148d4075c742d6f8268cad9e4213a84","infoHashBuffer":{"type":"Buffer","data":[180,145,206,56,129,72,212,7,92,116,45,111,130,104,202,217,228,33,58,132]},"announce":[],"urlList":[]}}