{"title":"Sacred Buildings (Design Manuals) - (Malestrom)","uid":5631903,"size":148906660,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b4b35f47c56d79d212cf14f539cac211c172fbd0&amp;dn=Sacred+Buildings+%28Design+Manuals%29+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":2,"time":1276717374,"description":"\n\nSacred Buildings (Design Manuals) By Rudolf Stegers\nPublisher: BirkhÃƒÂ¤user Architecture 2004 | 247 Pages | ISBN: 3764366834 | PDF \n\nThe building of religious structures represents a rare opportunity for the architect to concentrate on the creation of volume, space, and form. Sacred architecture is far less determined than other building tasks by functional requirements, norms, and standards. As a rule, it is free to unfold as pure architecture.\nThus in design terms this building task offers enormous freedoms to the architect. At the same time, however, the special atmospherics of sacred spaces call, on the part of the architect, for a highly sensitive treatment of religion and the relevant cultural and architectural traditions.\nIn a systematic section, this volume introduces the design, technical, and planning fundamentals of building churches, synagogues, and mosques. In its project section, it also presents about seventy realized structures from the last three decades. Drawing upon his in-depth knowledge of the subject and his many years of publishing experience, the author offers a valuable analysis of the conceptual and formal aspects that combine to create the religious impact of spaces (e.g., the ground plan, the shapes of the spaces, the incidence of light, and materiality).\n\nAbout the Author\nRudolf Stegers is the author of numerous publications and technical articles in the field of architecture. He researched the subject of religious architecture especially in connection with a work on Rudolf Schwarz.","torrent":{"xt":"urn:btih:b4b35f47c56d79d212cf14f539cac211c172fbd0","amp;dn":"Sacred+Buildings+%28Design+Manuals%29+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4b35f47c56d79d212cf14f539cac211c172fbd0","infoHashBuffer":{"type":"Buffer","data":[180,179,95,71,197,109,121,210,18,207,20,245,57,202,194,17,193,114,251,208]},"announce":[],"urlList":[]}}