{"title":"Amazing Grace - The Story of America's Most Beloved Song (Mal","uid":4827546,"size":1202394,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b5b5815b63991687d5b9b1e228e199d41548a6a8&amp;dn=Amazing+Grace+-+The+Story+of+America%5C%27s+Most+Beloved+Song+%28Mal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"malestrom_HH","files":1,"time":1239007163,"description":" &lt;a href=&quot;http://www.image-upload.net/images/n5z89brakeugz6s0l9m.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/n5z89brakeugz6s0l9m.jpeg&lt;/a&gt;\n\nSteve Turner, &quot;Amazing Grace: The Story of America's Most Beloved Song&quot;\nEcco | 2003 | ISBN: 0060002190 | 304 pages | PDF \n\nFrom Publishers Weekly\nThis carefully crafted and finely probed book will stand as the definitive look at what is perhaps the most popular hymn in American history a song that Turner argues has &quot;more than eleven hundred currently available albums featuring versions.&quot; Turner's previous books on music and musicians (Trouble Man: The Life and Death of Marvin Gaye; Hungry for Heaven: Rock and Roll and the Search for Redemption) have dealt with the religious themes behind the historical facts, and his newest is no exception. Turner begins by detailing the life of the song's author, John Newton, an 18th-century slave trader whose miraculous survival during an 11-hour storm at sea in 1748 sparked a religious conversion that led to his becoming a minister (and later an avowed abolitionist) and to writing the hymn in 1773. Turner's examination of Newton's life and how it influenced the words of &quot;Amazing Grace&quot; gives an added resonance to the second half of his book. From the song's early 20th-century popularity in gospel music to its adoption by folk singers in the 1950s, from Judy Collins's hit single in the early 1970s to openly secular interpretations by artists and writers such as Allen Ginsberg, the central historical paradox of Newton's specifically religious song, Turner observes, is that &quot;although the song still holds its original meaning for millions of Christians around the world, it now has a parallel existence outside the church, where often the only link is a shared belief that it is a song about hope.&quot; ","torrent":{"xt":"urn:btih:b5b5815b63991687d5b9b1e228e199d41548a6a8","amp;dn":"Amazing+Grace+-+The+Story+of+America%5C%27s+Most+Beloved+Song+%28Mal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5b5815b63991687d5b9b1e228e199d41548a6a8","infoHashBuffer":{"type":"Buffer","data":[181,181,129,91,99,153,22,135,213,185,177,226,40,225,153,212,21,72,166,168]},"announce":[],"urlList":[]}}