{"title":"Transition Metal-Catalyzed Couplings in Process Chemistry","uid":15327389,"size":6341602,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b5c8ff44b3b5c29428e998ca288439f5e281a85b&amp;dn=Transition+Metal-Catalyzed+Couplings+in+Process+Chemistry&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1468706102,"description":"Transition Metal-Catalyzed Couplings in Process Chemistry - Javier Magano, Joshua R. Dunetz (Wiley-VCH, 2013).pdf\r\n\r\nISBN 978-3-527-33279-3\r\n\r\nTransition metal-catalyzed coupling reactions have a rich history that led to the awarding of the 2010 Nobel Prize in Chemistry to Professors Suzuki, Heck, and Negishi for their pioneering contributions to the field. The coming of age of this active area of research is showcased in this\r\nbook through case studies in which process chemists from the pharmaceutical industry share their personal experiences developing their own transition metal-catalyzed couplings for the large-scale manufacture of active pharmaceutical ingredients.\r\n\r\nAuthors from Pfizer, Merck, Boehringer-Ingelheim, Novartis, Amgen, GSK, AstraZeneca, and other companies describe the evolution of robust coupling processes from inception through early and late development, including commercial routes where applicable. This book covers a wide range of coupling transformations while capturing the lessons learned from each process. Every case study details the optimization of at least one transition metal-catalyzed coupling while elaborating on issues such as design of experiments, scalability and throughput, product purification, process safety, and waste management. The important issue of metal removal and the different technologies available to accomplish this goal are also addressed. Finally, a section covers novel technologies for cross-coupling with high potential for future applications on a large scale, such as microwave and flow chemistry as well as green cross-couplings performed in water.\r\n\r\nWith Forewords by Stephen L. Buchwald, Massachusetts Institute of Technology, Trevor Laird, Editor of Organic Process Research and Development and Neal G. Anderson, Anderson's Process Solutions LLC","torrent":{"xt":"urn:btih:b5c8ff44b3b5c29428e998ca288439f5e281a85b","amp;dn":"Transition+Metal-Catalyzed+Couplings+in+Process+Chemistry","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5c8ff44b3b5c29428e998ca288439f5e281a85b","infoHashBuffer":{"type":"Buffer","data":[181,200,255,68,179,181,194,148,40,233,152,202,40,132,57,245,226,129,168,91]},"announce":[],"urlList":[]}}