{"title":"The Hoax of the Twentieth Century","uid":11720855,"size":13148503,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b5eeb9a1711d9b250778dc206f8e14f75a7d408e&amp;dn=The+Hoax+of+the+Twentieth+Century&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1424807463,"description":"First published in 1976, this slightly revised and enhanced edition of &quot;The Hoax of the Twentieth Century&quot; is the seminal work of Holocaust revisionism and still the most widely read on the subject. In 502 pages of penetrating study and lucid commentary, Dr. Butz gives the reader a graduate course on the subject of the Jews of World War Two Europe -- concluding not only that they were not virtually wiped out, but what's more, that no evidence exists to date to confirm that there was ever any Hitler attempt to do so. Chapter by solidly referenced chapter, Dr. Butz applies the scientist's rigorous clinical technique to every cornerstone of the legend. He focuses on the post-war crimes trials where the prosecution's false evidence was secured by coercion and even torture. He re-examines the very German records so long misrepresented; he critiques the European demographics, which do not allow for the loss of the Six Million; he re-evaluates the concept and technical feasibility of the gas chambers with some startling conclusions; and he separates the cold facts from the sheer tonnage of disinformation that has served as a formidable barrier to the truth since the end of WWII. This is the book that has caused unprecedented shockwaves throughout the academic and political world. Its open sale has been banned in an increasing number of countries including Germany and Canada. It is a book violently denounced by those unable to refute its thesis -- the most hysterical reactions to it coming from those whose own historical views cannot withstand the light of honest review. Now in its third edition, five major supplements have been added to bring the reader up-to-date on the continuing Holocaust controversy and its impact almost everywhere World War Two is discussed. A best-seller by any meaningful standard, yet still ignored and maligned by the people who have known of it but have never even made the effort to read it, &quot;The Hoax of the Twentieth Century&quot; is a book you must read if you want a clear picture of the scope and magnitude of the historical cover-up of our age, who is behind it, and what can be done to put an end to it","torrent":{"xt":"urn:btih:b5eeb9a1711d9b250778dc206f8e14f75a7d408e","amp;dn":"The+Hoax+of+the+Twentieth+Century","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5eeb9a1711d9b250778dc206f8e14f75a7d408e","infoHashBuffer":{"type":"Buffer","data":[181,238,185,161,113,29,155,37,7,120,220,32,111,142,20,247,90,125,64,142]},"announce":[],"urlList":[]}}