{"title":"Vinnie Paz - Season of the Assassin (2010) [FLAC]","uid":8199069,"size":556699848,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b6a74db81c6e7ed0c33211ebd6d55ad144398a52&amp;dn=Vinnie+Paz+-+Season+of+the+Assassin+%282010%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1361979401,"description":"\n  Vinnie Paz - Season of the Assassin (2010) [FLAC]\n\n  Released: 2010\n  Genre: Hip-Hop\n  Style: Underground Rap\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kpbs\n  Bits Per Sample: 16 \n  Sample Rate: 44,100 Hz \n  \n  Vinnie Paz doesn't waste too many syllables. His lyrics come rapid-fire with an unwavering cadence and tightly wound delivery that owes a lot to Kool G Rap and Big Pun -- a rap style that he's been honing since the mid-'90s as a part of the Philadelphia trio Jedi Mind Tricks and the underground collective Army of the Pharaohs. Now on his long-awaited solo debut, Paz breaks away from his Jedi Mind partners but is wise not to try to do it alone, collaborating with a variety of producers (both veteran and up-and-coming) and guest MCs (including underground rap mainstays like Ill Bill and R.A. the Rugged Man, fellow Philly rappers Beanie Sigel and the Clipse brothers, as well as H-Town rapper Paul Wall) in order to keep the track list from getting too repetitive. One unexpected surprise of Season of the Assassin is that even Paz's brand of brutal, hardcore hip-hop can't resist the lure of compressed vocal harmonizing and, unlike his Jedi Mind Tricks and Army of the Pharaohs albums, this record has a fair share of R&amp;B-tinged choruses (courtesy of Lawrence Arnell, Shara Worden, Liz Fullerton, and Brooklyn Academy's Block McCloud, who appears on three cuts). Still, this does little to soften the hard-edged tone that pervades Season of the Assassin. Anger, violence, conspiracy theories, and a fetish for firearms dominate virtually every track, and Paz shows an almost tender reverence for the tools he works with, professing &quot;I stare at my guns like a pair of voluptuous breasts&quot; over a soothing Electric Light Orchestra sample on the Madlib-produced &quot;Aristotle's Dilemma.&quot; Undoubtedly, the album's best moments come when Paz collaborates with producers and MCs whose styles can follow his grim, conspiracy-minded worldview -- i.e. the three-the-hard-way gun anthem &quot;Pistolvania&quot; with Freeway and Jakk Frost, and the extraordinary Soul Assassins track &quot;No Spiritual Surrender,&quot; which has Paz growling &quot;Muggs gave me audio heroin, hit the blue vein/I ain't Vinnie no more, Evil my new name&quot; over a interplay of seething gospel organs and bluesy electric guitars. Season of the Assassin gets even stronger in its second half as Paz comes up big on on two excellent solo joints -- stringing along a hungover narrative on &quot;Bad Day&quot; and spitting boast-fueled couplets over DJ Kwestion's infectious head nod beat on &quot;Drag You to Hell.&quot; After 20 tracks of unbridled brutality, Paz closes things on a sensitive note, spinning heartfelt vignettes of his deceased stepfather on the poignant &quot;Same Story (My Dedication).&quot;","torrent":{"xt":"urn:btih:b6a74db81c6e7ed0c33211ebd6d55ad144398a52","amp;dn":"Vinnie+Paz+-+Season+of+the+Assassin+%282010%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6a74db81c6e7ed0c33211ebd6d55ad144398a52","infoHashBuffer":{"type":"Buffer","data":[182,167,77,184,28,110,126,208,195,50,17,235,214,213,90,209,68,57,138,82]},"announce":[],"urlList":[]}}