{"title":"Green Day - Uno! (SPEC DTS-MA 5.1 by DKA) (SBU)","uid":7708823,"size":3247833088,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b874a73fbb161045a066ff935b1490d5d7b0a13f&amp;dn=Green+Day+-+Uno%21+%28SPEC+DTS-MA+5.1+by+DKA%29+%28SBU%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DynamiteKidA","files":1,"time":1349758975,"description":"Artist: Green Day\nTitle: Uno! (SPEC DTS-MA 5.1 by DKA) (SBU)\nRelease Date: 2012\n\nThis is a DTS-HD Master Audio 5.1 conversion, in AVCHD format, created from the hi-rez HDTracks stereo source utilizing the SPEC method (ArcTan mode) as found on www.surroundbyus.com.\n\nTo play the full lossless 24/96 stream, you must utilize a Blu-Ray player and receiver capable of decoding a DTS-MA signal. Those without a DTS-MA receiver will still be able to play a 24/48 core DTS stream.\n\nFor those who cannot play a disc in AVCHD, there is brief document included in this torrent as to my own process in extracting mono wavs from discs like these in order to create a disc in another multichannel format.\n\nNotes and disclaimers:\n\nIt is not recommended that you downmix these tracks to stereo, transcode them in any way, or make any changes other to them than how they are presented here.\n\nIf you are not a fan of stereo-to-surround conversions, while I do recommend giving the SPEC mixes a chance, if it is not your intention to do so, please respect those who do get enjoyment out of these mixes and do not troll or flame on my, or anyone else's, posts.\n\nI do love the new Green Day. Just straight ahead power-pop after years of trying (pretty successfully) to be the new Who. Like my &quot;American Idiot&quot; mix, don't expect crazy separation from simple punk pop through SPEC, but prepare to be happily emerged in it all.\n\nTrack listing:\n\nEnjoy.\n\nDKA","torrent":{"xt":"urn:btih:b874a73fbb161045a066ff935b1490d5d7b0a13f","amp;dn":"Green+Day+-+Uno%21+%28SPEC+DTS-MA+5.1+by+DKA%29+%28SBU%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b874a73fbb161045a066ff935b1490d5d7b0a13f","infoHashBuffer":{"type":"Buffer","data":[184,116,167,63,187,22,16,69,160,102,255,147,91,20,144,213,215,176,161,63]},"announce":[],"urlList":[]}}