{"title":"OIL Final Countdown To A Global Crisis And Its Solutions Sahadev","uid":5727896,"size":3456274,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b8928dfde567d88c1364eae2ce42c60e3bb8b349&amp;dn=OIL+Final+Countdown+To+A+Global+Crisis+And+Its+Solutions+Sahadev&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SmoothWeiner","files":1,"time":1280530382,"description":"OIL Final Countdown To A Global Crisis And Its Solutions Sahadeva dasa\n\nJul 20, HYDERABAD, AP, INDIA (UNI) Andhra Pradesh Chief Minister Y S Rajasekhara Reddy today said the time had come to explore alternative energy sources with the oil crisis deepening.\n\nReleasing a book on ''oil-final countdown to a global crisis and its solutions'' by Sahadeva Dasa at an impressive function, he said the problem concerned more for oil importing countries including India. The Chief Minister appreciated the author for coming out at an appropriate time with the book dealing with current and upcoming oil crisis and suggesting solutions.\n\nMr. Sahadeva noted that the price of crude oil, which was the source of 4,000 different types of petro products, had shot up from $70 to $148 per barrel in the last 11 months and it was predicted to reach 200 dollars mark soon. Also since the start of 2006, the average world price of rice had risen by 217 per cent, wheat by 136 per cent, maize by 134 per cent and soyabeans by 107 per cent, threatening to choke the very lifeline of civilization, he added.\n\nDuring the 150-year-old industrial civilization, the human society had used the resources, which the nature took millions of years to build up, he observed and suggested various vedic paradigms of harmonious living to solve this problem.","torrent":{"xt":"urn:btih:b8928dfde567d88c1364eae2ce42c60e3bb8b349","amp;dn":"OIL+Final+Countdown+To+A+Global+Crisis+And+Its+Solutions+Sahadev","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8928dfde567d88c1364eae2ce42c60e3bb8b349","infoHashBuffer":{"type":"Buffer","data":[184,146,141,253,229,103,216,140,19,100,234,226,206,66,198,14,59,184,179,73]},"announce":[],"urlList":[]}}