{"title":"Friday  (1995)  DVD-R   PAL","uid":4758422,"size":4437110784,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b89c9fc69d040caf22650a5353a2c8fa06e396df&amp;dn=Friday++%281995%29++DVD-R+++PAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Coolguy33","files":-1,"time":1236583323,"description":"Friday (1995)\n\n\n\nDirected by F. Gary Gray \nWritten by Ice Cube\nDJ Pooh \nStarring Ice Cube\nChris Tucker\nNia Long\nFaizon Love\nTommy Lister, Jr.\nwith Bernie Mac\nand John Witherspoon \nMusic by Ice Cube\nFrank Fitzpatrick (Music Supervisor) \nDistributed by New Line Cinema \nRelease date(s) April 27, 1995 \nRunning time 91 min. \nLanguage English \n\n\n\nFriday is a 1995 dramatic comedy-buddy film directed by F. Gary Gray. Starring Ice Cube, Chris Tucker, Nia Long, Bernie Mac, Tommy Lister, Jr. and John Witherspoon, the film revolves around 16 hours in the lives of Craig Jones (Ice Cube) and Smokey (Chris Tucker), who must pay US $200 on Friday night by 10:00PM on the dot, not 10:03PM nor 10:36PM.\n\nThe film is a look at one particular day (Friday) in the life of two friends, Craig Jones (Ice Cube) and Smokey (Chris Tucker), in urban Los Angeles. Craig has recently been fired from his job while attempting to collect his wages (he was allegedly caught on camera stealing boxes), although he claims innocence. To add to his dilemma, his parents (John Witherspoon and Anna Maria Horsford) are threatening to evict him from the family home unless he quickly finds new employment. Meanwhile, Craig has been eyeing comely, pretty neighbor Debbie (Nia Long), but his insanely jealous, ghetto-fabulous girlfriend Joi (Paula Jai Parker) is a formidable obstacle (ironically, an unidentified man was seen in Joi's bed in the beginning of the film, while she was arguing with Craig on the phone).\n\nThroughout the day, friends and local neighborhood characters pass through: the harmless but always-scheming crack head and petty thief Ezal (Anthony Johnson); the unkempt, perpetually mooching Felicia; lascivious Pastor Clever (Bernie Mac), who has a brief fling with sultry parishioner Ms. Parker (Kathleen Bradley), before being unexpectedly interrupted by her infuriated, diminutive husband (Tony Cox); package delivery driver Red (DJ Pooh), whose stolen bicycle, chain necklace and black eye are courtesy of the hulking bully Deebo (Tommy Lister, Jr.); and China (Terri J. Vaughn), friend of sister Dana (Regina King). Much earlier, Debbie hooks Smokey up with a blind date over the phone who claims she bears a resemblance to Janet Jackson.\n\n\nLanguages: English: 2.0\nWidescreen 16:9\nNo Subs\nAspect Ratio: 1.85:1\nPAL\n\nUntouched\n\n","torrent":{"xt":"urn:btih:b89c9fc69d040caf22650a5353a2c8fa06e396df","amp;dn":"Friday++%281995%29++DVD-R+++PAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b89c9fc69d040caf22650a5353a2c8fa06e396df","infoHashBuffer":{"type":"Buffer","data":[184,156,159,198,157,4,12,175,34,101,10,83,83,162,200,250,6,227,150,223]},"announce":[],"urlList":[]}}