{"title":"Sol 0: Mars Colonization (Update 2)","uid":13356444,"size":154064244,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b969af07330fddece7f1e31a088449b3b20bf958&amp;dn=Sol+0%3A+Mars+Colonization+%28Update+2%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1454114186,"description":"Sol 0 is a real time strategy game where you establish the first Martian colony. From the first human footprints on Martian soil to a thriving and self-sustaining colony, Sol 0 imagines a near future using technology that could be available within the next few decades. Make use of minerals and resources across the Martian surface to expand from the first exploratory rover to an independent frontier.\r\n\r\nFrom Chondrite Games, Sol 0 gives players the ultimate chance to take on the challenges inherent in pushing the boundaries of space exploration and habitation. Grow food, extract water, build habitats, generate electricity, evade unpredictable Martian weather, mine natural resources, and construct increasingly complex and sophisticated colony bases.\r\nChallenging simulation\r\nYou’ll be faced with balancing food and water needs, oxygen and energy supplies, natural resource collection, and preparing for weather disasters including meteorite impacts and dust storms. Prioritize the supplies you bring to ensure your colony’s survival.\r\nBecome independent from Earth\r\nThe technology featured in Sol 0 is inspired by concepts currently being developed and deployed for Martian exploration. From water and mineral extractors, rovers with fine-tuned instruments, and biology labs that cross-breed bacterial strains from Earth’s extreme environments to increase food production on Mars, the available tools reflect an ever closer reality.\r\nExplore Mars and worlds beyond\r\nIce caps, lava plains, and arid equatorial regions each offer distinct challenges to success, and randomly generated maps provide extended playability. Build custom maps using the Sol 0 Map Editor, and share your creations with other players","torrent":{"xt":"urn:btih:b969af07330fddece7f1e31a088449b3b20bf958","amp;dn":"Sol+0%3A+Mars+Colonization+%28Update+2%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b969af07330fddece7f1e31a088449b3b20bf958","infoHashBuffer":{"type":"Buffer","data":[185,105,175,7,51,15,221,236,231,241,227,26,8,132,73,179,178,11,249,88]},"announce":[],"urlList":[]}}