{"title":"Queen - Wo Wants To Live Forever [Lossy Mp3 192 Kbps]","uid":5149080,"size":109748673,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ba29bcfb8cc82e40ea277248c5028ea3109f65cf&amp;dn=Queen+-+Wo+Wants+To+Live+Forever+%5BLossy+Mp3+192+Kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Duracell72","files":20,"time":1257446768,"description":"L'estate del 1986 vede i Queen ancora padroni dell'Europa con il Grandioso &quot;Magic Tour&quot;, iniziato il 6 giugno al Rasunda \n\nStadium di Stoccolma e conclusosi a Knebworth il 9 agosto. La macchina live dei Queen raggiunge nel corso di questo \n\ntour il suo apice; il palco ÃƒÂ¨ il piÃƒÂ¹ grande mai costruito, come anche l'impianto luci, e il set di canzoni preparato per la \n\ntournÃƒÂ© ÃƒÂ¨ un mix ben studiato di brani nuovi e del passato, tutti riarrangiati in versioni particolarmente potenti, sorta di \n\ncarrellata sulla storia del gruppo che attira sia i fans piÃƒÂ¹ accaniti, sia chi li conosce meno. Una data particolarmente \n\nimportante ÃƒÂ¨ quella al Nepstadium di Budapest il 27 luglio; ÃƒÂ¨ la prima volta che oltre la cortina di ferro il rock viene \n\npresentato in grandi spazi. Freddie e compagni danno vita ad un spettacolo memorabile, come documenta il relativo \n\nvideo, riuscendo a conquistare in un attimo un pubblico assolutamente nuovo, in particolare quando eseguono in segno \n\ndi gratitudine una canzone popolare ungherese duettando con la folla. In patria i Queen raccolgono in sole sei date \npiÃƒÂ¹ di 400.000 spettatori, stabilendo un record assoluto, con due concerti consecutivi al Wembley Stadium (12 e 12 luglio) \n\nda cui verrÃƒÂ  tratto un doppio album. Freddie chiude lo spettacolo vestito da re, con manto di pelliccia e corona, e \n\nsmentisce ogni voce di problemi nel gruppo con parole che risultano purtroppo profetiche: &quot;Non siamo poi tanto male per \n\nessere quattro vecchie regine del rock, saremo assieme finchÃƒÂ¨, ca**o!, non saremo morti!&quot;. Il &quot;Magic Tour&quot; si chiude il \n\nnove agosto a Knebworth davanti a quasi 200.000 persone; ÃƒÂ¨ l'ultimo concerto dei Queen, che lasciano al loro pubblico il \n\nricordo della loro esibizione piÃƒÂ¹ spettacolare e grandiosa e l'immagine di un gruppo che ha saputo esaltare la dimensione \n\nlive come nessun altro. Freddie saluta per sempre i suoi fans alzando la corona con queste parole: &quot; Arrivederci \n\nbellissime bellezze! Siete stati un pubblico straordinario, buonanotte, sogni d'oro, vi amo!&quot;. \n\n14.06.1986 - Concert: Queen live in Hippodrome de Vincennes, Paris, France\n\nArtisT: Queen\nDate: 14.06.1986\nVenue: Hippodrome de Vincennes\nCity: Paris\nCountry: France\nSupport band: Belouis Some, Level 42, Marillion\nLine-up: Freddie Mercury (lead vocals, piano, electric guitar)\nBrian May (electric guitar, backing vocals, acoustic guitar, keyboards)\nRoger Taylor (drums, backing vocals, tambourine)\nJohn Deacon (bass guitar)\nSpike Edney (keyboards, piano, electric guitar, backing vocals)\n\nTracks\n\nBrighton rock\nOne vision\nTie your mother down\nIn the lap of the Gods\nSeven seas of rhye\nA kind of magic\nUnder pressuer\nAnother one bites the dust\nWho wants to live forever\nI want to break free\nIs this the world we created\nTutti frutti\nBohemian Rapsody\nHammer to fall\nCrazy little thing called love\nRadio Ga Ga\nWe will rock you\nFriends will be friends\nWe are the champions\nGod save the Queen\n","torrent":{"xt":"urn:btih:ba29bcfb8cc82e40ea277248c5028ea3109f65cf","amp;dn":"Queen+-+Wo+Wants+To+Live+Forever+%5BLossy+Mp3+192+Kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba29bcfb8cc82e40ea277248c5028ea3109f65cf","infoHashBuffer":{"type":"Buffer","data":[186,41,188,251,140,200,46,64,234,39,114,72,197,2,142,163,16,159,101,207]},"announce":[],"urlList":[]}}