{"title":"Requiescant (1967)-Carlo Lizanni Spaguetti Western Pier Paolo Pa","uid":6838169,"size":808428904,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ba9c8b3bd97e1e210f784db2b08ccf52d3f438db&amp;dn=Requiescant+%281967%29-Carlo+Lizanni+Spaguetti+Western+Pier+Paolo+Pa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vpadilla23","files":4,"time":1322077094,"description":"Stared by Pier Paolo Pasolini as the priest.A communist western.\n\nThe Film\nOnly one boy survives a massacre committed upon a community of mexican peasants. Raised by a puritan family, grown up (Castel), he sets out to get back the man's daughter, who ran away to find another lifestyle. He finds her in a Texas down dominated by a man named Ferguson (Damon), who rules the town with an iron fist, working as a prostitute unable to get away. As it turns out, there are forces beyond his control that lead him to discover his heritage, and who the murderers are. Raised as a humble religious man, but skilled with the gun, he sets out to get the record straight. (114mins)\n\n[edit]Opinion\nLizzano does something very bizarre here. He starts of with a touch of politics (Mexican peasants, massacres, intrigue), then wanders off with a personal story of a man trying to find his love, and then returns to the revolutionary theme, with mentions of even more political topics, for example having Ferguson rant about planter aristocracy. All that sadism that accompanies the story, leads to a very harsh athmosphere actually, and the happy music and the fact that the good wins over the evil, can't change the fact that this is quite a sinister film actually. Overall I was positively surprised by this film, I think both Castel and Lizzano did a great job in telling a heartwarming story in a really great way. Recommended.\n","torrent":{"xt":"urn:btih:ba9c8b3bd97e1e210f784db2b08ccf52d3f438db","amp;dn":"Requiescant+%281967%29-Carlo+Lizanni+Spaguetti+Western+Pier+Paolo+Pa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba9c8b3bd97e1e210f784db2b08ccf52d3f438db","infoHashBuffer":{"type":"Buffer","data":[186,156,139,59,217,126,30,33,15,120,77,178,176,140,207,82,211,244,56,219]},"announce":[],"urlList":[]}}