{"title":"[DeadFish] Suisei no Gargantia - 12 [720p][AAC].mp4","uid":8607383,"size":250037299,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bb0ef1d7e655e2fffaa8a6bf9a24c635b8cea9bb&amp;dn=%5BDeadFish%5D+Suisei+no+Gargantia+-+12+%5B720p%5D%5BAAC%5D.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jksADIDAS","files":1,"time":1372050112,"description":"Suisei no Gargantia - English Subbed\n----------\nVideo\nMP4\nLength: 00:23:40\nFrame width.: 1280\nFrame Height: 720\nData rate: 1276kbps\nTotal bitrate: 1404kbps\nFrame rate: 23 f/s\n.\nAudio\nMP3\nBit Rate: 128kbps\nChannels: 2 stereo\nAudio sample rate: 44kHz\n----------\nWiki Link: https://en.wikipedia.org/wiki/Gargantia_on_the_Verdurous_Planet\n----------\nSuisei no Gargantia - In the distant future, mankind has taken to the stars and formed the Galactic Alliance of Humankind. The Alliance is currently engaged in a genocidal war with a plant-like alien species called the Hideauze. 16-year-old Ensign Ledo is a soldier for the Galactic Alliance, piloting a Machine Caliber, an AI-automated, humanoid-shaped battle suit, which he refers to as 'Chamber'. After a failed attempt by the Alliance forces to destroy an enemy super-weapon, Ledo is knocked into a wormhole and loses consciousness. When he awakens, he learns from Chamber that he has been in cryo-stasis for 6 months while his wounds were healing. Ledo learns that he and Chamber have been 'found' by a rag-tag band of 'primitive' human scavengers. Escaping, Ledo quickly discovers that he is on board a massive floating ship on an ocean covered planet. Chamber tells him that local star charts reveal the planet is Earth, the birth-place of humanity, a place members of the Alliance only knew of in stories and believed was a myth.\n----------\nSuisei no Gargantia Episode 12\nTitle: Decisive Moment Original Air Date: June 23, 2013\n.\nKugel's fleet prepares itself to attack the Gargantia. Ledo tries to dissuade Kugel with no success while Pinion is approached by Lukkage who plans a rebellion at the fleet. Confused about what he should do, Ledo witness the people of the fleet throwing their sick and weak on the water and fearing that the same will be done to Bebel, he decides to confront Kugel by himself. While Pinion equips Chamber with some extra weapons for the upcoming battle, Lukkage and Flange make preparations for the impending uprising. Melty is instructed by Ledo to deliver a message to the Gargantia, but she almost faints by traveling so far by herself and is rescued in the nick of time by Amy. Informed about Kugel's attack, the crew of the Gargantia consider to abandon the fleet as Ledo suggested, but Amy insists that they should do something to help Ledo as well, and Oldham instructs Ridget to make use of the special key Fairlock entrusted her. The rebellion begins, and while Ledo fights Kugel assisted by Pinion's crew, the pirates led by Lukkage attack the fleet's soldiers. When Ledo finally manages to pin down Kugel and open Striker's cockpit, it is revealed that Kugel was long dead and that it was Striker who was speaking in his name all this time.","torrent":{"xt":"urn:btih:bb0ef1d7e655e2fffaa8a6bf9a24c635b8cea9bb","amp;dn":"%5BDeadFish%5D+Suisei+no+Gargantia+-+12+%5B720p%5D%5BAAC%5D.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb0ef1d7e655e2fffaa8a6bf9a24c635b8cea9bb","infoHashBuffer":{"type":"Buffer","data":[187,14,241,215,230,85,226,255,250,168,166,191,154,36,198,53,184,206,169,187]},"announce":[],"urlList":[]}}