{"title":"Women as Artists Since the Renaissance (Art Ebook)","uid":13156762,"size":36683039,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bb4ca6a404ca08812095c58e8cb3fdad8a081545&amp;dn=Women+as+Artists+Since+the+Renaissance+%28Art+Ebook%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1452108863,"description":"A World of Our Own: Women as Artists Since the Renaissance\r\nWatson-Guptill | 2000 | ISBN: 0823058743 | English | 232 pages | PDF | 35 MB\r\n\r\nThis stirring account documents the centuries-long struggle of gifted women who confronted the exclusionary tactics of a male-dominated art establishment but pressed ahead undaunted to gain public acceptance as sought-after professional artists. The author takes readers deep into the restricted world of women artists of the past, showing how diligently they trained themselves, set up studios, and pursued sympathetic patrons. Starting with the flowering of Renaissance painters Sofonisba Anguissola and Properzia de'Rossi, the book reconstructs the changing world of women artists as social attitudes evolved. Seventeenth-century painters Artemisia Gentileschi and Judith Leyster enjoyed success by depicting subjects relevant to women, as did eighteenth-century greats Angelica Kauffmann and Elisabeth Vige-Lebrun with their themes of motherhood. Further breakthroughs came in the nineteenth century as young hopefuls Mary Cassatt and Marie Bashkirtseff strove to be admitted to exhibiting societies and opened art schools to help other women become professionals. Finally, as equality for women advanced through the twentieth century, Georgia O'Keeffe, Frida Kahlo, and Cindy Sherman led the way for today's talented women to secure their rightful place in the annals of art","torrent":{"xt":"urn:btih:bb4ca6a404ca08812095c58e8cb3fdad8a081545","amp;dn":"Women+as+Artists+Since+the+Renaissance+%28Art+Ebook%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb4ca6a404ca08812095c58e8cb3fdad8a081545","infoHashBuffer":{"type":"Buffer","data":[187,76,166,164,4,202,8,129,32,149,197,142,140,179,253,173,138,8,21,69]},"announce":[],"urlList":[]}}