{"title":"Jimi Hendrix - The Cry of Love (1971) Flac[24 Bit 96KHz Vinyl]","uid":9302430,"size":871987237,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bb7d000c0377501336422e5a0ac2596cb11999d9&amp;dn=Jimi+Hendrix+-+The+Cry+of+Love+%281971%29+Flac%5B24+Bit+96KHz+Vinyl%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"77ausy","files":-1,"time":1386265327,"description":"\n\n'The Cry of Love' was the first Hendrix Studio album to appear after his untimely death. \nMany people feel it is the only posthumous album that Hendrix \nwould have been satisfied with. \nBut even though it is a great album that assumption is not near the truth. \nHendrix' death had left a lot of recordings in various stages of completion. \nA couple of songs were already mixed down to (near-) perfection, but \nmost of them were still incomplete. \n\nAfter his passing, Michael Jeffrey (Hendrix' manager) hoped to compile three albums out \nof the enormous pile of tapes that Hendrix left behind. \nOne of them would have to be a soundtrack album to a film called Rainbow Bridge \n-a project in which Jeffrey was deeply involved- and which he was desperate to turn \ninto a commercial success. \nHowever, first there would have to be a regular album containing the strongest recordings. \nJeffrey opted not to release a double album because he needed to fulfill his contractual \nobligations with Warner Brothers. \n\nEddie Kramer, who was chief engineer of Hendrix' new Electric Lady Studio's and who had \nbeen closely involved with the recording process until Jimi's death, \nwas given the unenviable task of completing the album that Hendrix had never finished. \nTogether with Mitch Mitchell, he went through the many tapes that Hendrix had recorded \nover the past two years. \nThis process that must have been painful to these two people who had worked so closely \nwith Hendrix over the last four years. \nAlthough a large share of tapes were not available at that point, (the sessions that \nExperience had done at the TTG studio's in Oct. 1968 and many of the Record Plant \nsessions from the spring and autumn of 1969 with the Band of Gypsys), it was correctly \nassumed that the best material was among the works from the last six months prior \nto Hendrix death. \n\nBut even though Hendrix had written some real strong material in this period, most of it \nhad not been fully realized on tape yet. \nTherefore, Kramer and Mitchell decided to add overdubbed drum parts on some somes \nand vibes to 'Drifting' (which Hendrix had considered) in an attempt to upgrade the material . \nA couple more studio tricks had to be pulled to get to a more finished sounding end result, \nbut -unlike Alan Douglas later- Kramer and Mitchell were keen not to disrespect Jimi's wishes. \n\nThe resulting album is great but one cannot help but wonder what it would have been \nhad Hendrix lived. \nAt the same time, 'The Cry of Love' does give a complete image of the musical direction that \nHendrix was heading into, more than any other posthumous album. \nSongs like &quot;In from the storm&quot;, 'Freedom&quot;, &quot;Drifting&quot; -to name just a few- are masterpieces \nand we should be happy that Hendrix lived to record these. \nIt's a shame that these songs hardly get played by those classic rock radio stations. \n\n===============================================\n\nTracklist\n\nFreedom\t3:29\nDrifting\t3:50\nEzy Ryder\t4:11\nNight Bird Flying\t3:47\nMy Friend\t4:40\nStraight Ahead\t4:45\nAstro Man\t3:34\nIn From the Storm\t3:37\nAngel\t4:25\nBelly Button Window\t3:37\n\n===============================================\n\nGeneral\n\nFile size                                : 831 MB\nAlbum                                    : The Cry Of Love\nTrack name/Position                      : 10\nPerformer                                : Jimi Hendrix\nGenre                                    : Rock\nRecorded date                            : 1971\n\n\nAudio\n\nBit rate mode                            : Variable\nBit rate                                 : 2 766 Kbps\nChannel(s)                               : 2 channels\nSampling rate                            : 96.0 KHz\nBit depth                                : 24 bits","torrent":{"xt":"urn:btih:bb7d000c0377501336422e5a0ac2596cb11999d9","amp;dn":"Jimi+Hendrix+-+The+Cry+of+Love+%281971%29+Flac%5B24+Bit+96KHz+Vinyl%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb7d000c0377501336422e5a0ac2596cb11999d9","infoHashBuffer":{"type":"Buffer","data":[187,125,0,12,3,119,80,19,54,66,46,90,10,194,89,108,177,25,153,217]},"announce":[],"urlList":[]}}