{"title":"Mirage (1965 Suspense Film) Gregory Peck","uid":4885401,"size":957789692,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bc075f3df603c62a042bb80a01c061688cf0a764&amp;dn=Mirage+%281965+Suspense+Film%29+Gregory+Peck&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"inkwell765","files":-1,"time":1241715672,"description":"Mirage 1965 B/W 108 MIN.\nGregory peck, Walter Matthau, Diane Baker.\n\nFrom Wikipedia;\n\nMirage is a 1965 thriller directed by Edward Dmytryk from a script by Peter Stone (based on a book by Howard Fast), starring Gregory Peck, Diane Baker, Walter Matthau, and Kevin McCarthy, and released by Universal Pictures.\n\n[edit] Plot\nAfter emerging from a blacked-out skyscraper from which a famous humanitarian apparently jumped to his death, cost accountant David Stillwell (Gregory Peck) is stunned to discover that gunmen are chasing him and he has no idea why. Stillwell gradually realizes that he suffers from &quot;unconscious amnesia&quot;, and that this illness has caused him to apparently black out the events of the past two years. The problem is that a prickly psychiatrist he consults assures him that it is impossible for unconscious amnesia to last more than a day or two.\n\nAs he furiously tries to piece together the puzzle of his life, Stillwell comes across Sheila (Diane Baker), who implies that they have been involved in a relationship. She is vague and evasive, insisting that not remembering is the only thing keeping him alive. He apparently has something a mysterious figure known only as &quot;The Major&quot; wants, but he doesn't know what it is. He recalls working as a &quot;cost accountant&quot; for Unidyne, the company Charles Calvin (Walter Abel), a wealthy (and apparently suicidal) humanitarian whose &quot;nightmare ended just as [Stilwell's] began&quot;.\n\nNothing adds up. Stillwell's life is threatened by mysterious men (George Kennedy and Jack Weston). He engages the private detective Ted Casselle (Walter Matthau), who is more willing than able, this being his first case. The case? Find out who David Stillwell is and why strangers are trying to kill him.\n\nWhen Stillwell seeks out Calvin's widow to ask what killed him, she replies: &quot;You did.&quot;\n\nAs his fog lifts, Stillwell comes to realize that he is not at all what he thought himself to be, as well as what secret he possesses that has other men so determined to kill him.\n\nThis Hitchcockian screenplay is written by Peter Stone as a follow-up to the hugely successful Charade. Matthau and Kennedy are holdovers from Charade.\n","torrent":{"xt":"urn:btih:bc075f3df603c62a042bb80a01c061688cf0a764","amp;dn":"Mirage+%281965+Suspense+Film%29+Gregory+Peck","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc075f3df603c62a042bb80a01c061688cf0a764","infoHashBuffer":{"type":"Buffer","data":[188,7,95,61,246,3,198,42,4,43,184,10,1,192,97,104,140,240,167,100]},"announce":[],"urlList":[]}}