{"title":"Flowers Underfoot-Indian Carpets of the Mughal Era (Art Ebook)","uid":12706968,"size":76411679,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bce15b2a0b57169f235a021531493e5f23b3a2d9&amp;dn=Flowers+Underfoot-Indian+Carpets+of+the+Mughal+Era+%28Art+Ebook%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1446842904,"description":"Walker, Daniel S., &quot;Flowers underfoot: Indian Carpets of the Mughal Era&quot;\r\nMetropolitan/H.N.Abrams | 1997 | ISBN: 0870997874 | Eng | PDF | 218 pag | 72.87 Mb\r\n\r\nWoollen carpets were known in India as early as 500BC. But it was not until the 16th century, during the reign of the Mughal emperor Akbar, that the first imperial workshops were founded, and began producing carpets whose jewel-like beauty is still breathtaking today. The Mughal emperors were grand patrons of the arts, demanding the highest standards, and their influence is shown in the works of superb quality produced during their reign. Thi scholarly treatment of the subject is published to coincide with a major exhibition at the Metropolitan, New York. Pile-woven carpets of the Mughal era are some of the most technically accomplished of all Oriental carpets. The book surveys these beautiful textiles, their technical characteristics, commerce and the history of the period. Over 70 carpets, some reproduced here for the first time, have been gathered worldwide from museums and private collections; they exemplify the &quot;classical&quot; period of Indian carpet weaving, which ended around 1800. The text is organized according to style and pattern but also traces the chronological development of carpet design: the Persian style with its fantastic animals and pictorial designs; the flower style in its many variations; and the later designs, including the &quot;durbar&quot; and the &quot;millefleur&quot;","torrent":{"xt":"urn:btih:bce15b2a0b57169f235a021531493e5f23b3a2d9","amp;dn":"Flowers+Underfoot-Indian+Carpets+of+the+Mughal+Era+%28Art+Ebook%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bce15b2a0b57169f235a021531493e5f23b3a2d9","infoHashBuffer":{"type":"Buffer","data":[188,225,91,42,11,87,22,159,35,90,2,21,49,73,62,95,35,179,162,217]},"announce":[],"urlList":[]}}