{"title":"Transformers: The Game [PS3]","uid":8236185,"size":2829030440,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:bd073766d081e414f7b1fb59333e3c1f05e7e23a&amp;dn=Transformers%3A+The+Game+%5BPS3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thenoobish","files":141,"time":1362846640,"description":"Language: English\n\nControl the outcome in the battle for Earth this summer with Transformers, the official game of the upcoming blockbuster film from Producer Steven Spielberg and Director Michael Bay. Protect the earth as Autobots or destroy it as Decepticons as you lead the Transformers in the epic battle for control of planet Earth! \n\n\nProtect or destroy the Earth: As the Transformers war comes to Earth, you must make a choice - protect Earth as Autobots or destroy it as Decepticons. With dual campaigns, the fate of the world is in your hands. \nTransformation: Instantly transform from a larger-than-life robot to a high-powered vehicle to leave your enemies in the dust. \nDestroy everything: Every object in the game world, including buildings and vehicles, can be crushed, toppled, wrecked - even used as weapons. \nChoice of playable characters: Choose among an army of characters in the Transformers universe and utilize their unique abilities to complete missions. \nCombat variety: For head-to-head battles, engage in melee combat with special moves unique to each character.","torrent":{"xt":"urn:btih:bd073766d081e414f7b1fb59333e3c1f05e7e23a","amp;dn":"Transformers%3A+The+Game+%5BPS3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd073766d081e414f7b1fb59333e3c1f05e7e23a","infoHashBuffer":{"type":"Buffer","data":[189,7,55,102,208,129,228,20,247,177,251,89,51,62,60,31,5,231,226,58]},"announce":[],"urlList":[]}}