{"title":"The Rolling Stones - Shine A Light (2008) WMA320","uid":6320794,"size":301255832,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bd3009f2cd5a8225c966f442e9732333552c3f00&amp;dn=The+Rolling+Stones+-+Shine+A+Light+%282008%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"MARCELODRGZ","files":-1,"time":1302936650,"description":"The Rolling Stones seem to have recorded a score of live albums over time, some of which are terrific to listen to (think &quot;Get Yer Ya-Ya's Out&quot; or the intriguing &quot;Four Flicks&quot;) and others of which are merely adequate. This, the sound track from Martin Scorsese's concert film, &quot;Shine a Light,&quot; is in the former category. It is hard to believe that the Stones are in their 60s. This CD shows them with great energy, although time's effects are apparent as, for instance, in hearing how limited Mick Jagger's vocal range has become. Nonetheless, this is a great amount of fun to listen to! 22 cuts (some not in the documentary, but added later on). \n\nIt begins with one of the great rock and roll riffs of all time, in &quot;Jumping Jack Flash.&quot; And then it hits you--this song was a hit 40 years ago. How can guys as old as the Stones are still make this work? A great start to the CD. &quot;Shattered&quot; follows quickly. Again, the thought. This is a 30 year old song--and still performed with gusto and spirit. \n\nOn the first CD is a little treasure. Buddy Guy, legendary bluesman, joins the band in a Muddy Waters' song, &quot;Champagne and Reefer.&quot; The first couple lines give one a sense of the song: \n\n&quot;Bring me champagne when I'm thirsty, \nBring me reefer when I want to get high.&quot; \n\nGuy adds his great blues voice and some smoking guitar work. Jagger and Guy alternate singing the lines, and Guy's blues singing is a wonder to listen to. When all the guitars are playing, one almost gets a sense of a wall of sound from those guitars--with Charlie Watts' steady drumming providing a rock solid rhythm foundation. \n\nThe second CD provides some more rich music. This side begins with the creepy &quot;Sympathy for the Devil,&quot; again well played and sung. A couple songs later, &quot;Start Me Up.&quot; Another wall of guitar sound from Ronnie Wood and Keith Richards, underlain by the rhythm section, Watts and Darryl Jones. Watts' drumming is primal and creates a powerful base for vocals and guitars. The chunky guitar work of Wood and Richards is compelling. Then, &quot;Brown Sugar.&quot; This was a hit well over 30 years ago, but it still has life as played by the band and its &quot;friends,&quot; such as Bobby Keys. The audience sing along toward the end provides a sense of spontaneity. A classic Rolling Stones' moment. Then, the third in the trio of songs in this section of the concert--&quot;Satisfaction.&quot; As soon as one hears the fuzz tone, the toes start tapping. Jagger's voice is not as agile as it used to be, but he nonetheless puts some life into this over 40 year old song. \n\nSome rarities show up in this concert, songs not often played by the Stones on their tours over the past couple decades, such as &quot;Shine a Light,&quot; &quot;You Got the Silver,&quot; and &quot;Loving Cup.&quot; And one song worth mentioning, since it is another golden oldie--&quot;I'm Free.&quot; This goes back to the early days of the Rolling Stones (originally released in 1965). A terrific blues rock song. \n\n&quot;I'm free to sing my song, \nEven though it's out of time.&quot; \n\nAnyhow, one of their finest live recordings. Age has had some impact. Jagger's voice isn't as agile as it used to be. But, nonetheless, this works and works well as a concert CD.\n\nby Steven A. Peterson\n\nTRACKLIST:\nDisc 1:\n01 - Jumpin' Jack Flash.wma                                           \n02 - Shattered.wma                                                    \n03 - She Was Hot.wma                                                  \n04 - All Down The Line.wma                                            \n05 - Loving Cup (With Jack White III).wma                             \n06 - As Tears Go By.wma                                               \n07 - Some Girls.wma                                                   \n08 - Just My Imagination.wma                                          \n09 - Faraway Eyes.wma                                                 \n10 - Champagne &amp; Reefer (With Buddy Guy).wma                          \n11 - Tumbling Dice.wma                                                \n12 - Band Introductions.wma                                           \n13 - You Got The Silver.wma                                           \n14 - Connection.wma            \n\nDisc 2:\n01 - Martin Scorsese Intro.wma                                        \n02 - Sympathy For The Devil.wma                                       \n03 - Live With Me.wma                                                 \n04 - Start Me Up.wma                                                  \n05 - Brown Sugar.wma                                                  \n06 - (I Can't Get No) Satisfaction.wma                                \n07 - Paint It, Black.wma                                              \n08 - Undercover Of The Night.wma                                      \n09 - Little T&amp;a.wma                                                   \n10 - I'm Free.wma                                                     \n11 - Shine A Light.wma    \n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!\t","torrent":{"xt":"urn:btih:bd3009f2cd5a8225c966f442e9732333552c3f00","amp;dn":"The+Rolling+Stones+-+Shine+A+Light+%282008%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd3009f2cd5a8225c966f442e9732333552c3f00","infoHashBuffer":{"type":"Buffer","data":[189,48,9,242,205,90,130,37,201,102,244,66,233,115,35,51,85,44,63,0]},"announce":[],"urlList":[]}}