{"title":"Fan Chan - Eng Sub [Thai Movie]","uid":4917401,"size":1130864017,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bd7a9ca54846c3bb7dc05c72e9a20278a29c868b&amp;dn=Fan+Chan+-+Eng+Sub+%5BThai+Movie%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"poothaijaa","files":-1,"time":1243495532,"description":"Title: Fan Chan\nAKA: My Girl\nYear: 2003\nDirector: Vitcha Gojiew, Songyos Sugmakanan\nGenre: Comedy / Family\nRuntime: 100 mins\nCountry: Thailand\nAudio: Thai\nSubtitle: English\nStarring :\nCharlie Trairat as Jeab\nFocus Jirakul as Noi-Naa\nCharwin Jitsomboon as Jeab (adult)\nWongsakorn Rassamitat as Jeab's father\nArnudsara Jantarangsri as Jeab's mother\nPreecha Chanapai as Noi-Naa's father\nNipawan Taveepornsawan as Noi-Naa's mother\nChaleumpol Tikumpornteerawong as Jack\nAphichan Chaleumchainuwong as Dtee\nAnyarit Pitakkul as Boy\nYok Teeranitayatarn as Manoj\nThana Vichayasuranan as Prik\n\nReleased date : 14 January 2004\nIMDB: http://www.imdb.com/title/tt0399040/\nRatinhg: 7.5/10\n \nWWW.AMAZINGBITS.ORG\n\nSource: VCD\nFile: AVI\n\nStory :\n\nJeab, a young man working in Bangkok, receives word that his best friend from childhood, Noi-Naa is to be married. \nWhile driving back to his hometown, the memories of his friendship with her come flooding back, and their story is\ntold in a flashback. Jeab and Noi-Naa live in a small city. Their fathers are rival barbers, with shops situated \nnext to each other, with only a sweet shop to separate them. Jeab's father favors efficiency and uses an electric \ntrimmer. Noi-Naa's father, meanwhile, has a more contemplative, artistic approach, and uses scissors. Jeab notes \nthat the results of both methods seem to be the same. Jack and his friends play Chinese fantasy characters after \nschool. The school holiday is ended. Jeab is notorious for oversleeping, so that each day he misses the school bus \nand must be driven part way by his father on a motorcycle. By taking a shortcut, Jeab and his father are able to \ncatch up to the bus, but only just in time. On the bus, other boys are introduced. Their ringleader is an overweight\nbully named Jack. On the bus, the children talk about what they are going to do after school. The boys decide they \nwill play Chinese fantasy characters, while the girls plan to play &quot;house&quot;. Because Jeab must cross a busy street to\nplay with the boys, and he fears getting hit by a car, he stays to play with the girls, which makes him the target \nof much taunting by Jack and the other boys. Then, one day, Jack and his friends are playing soccer against a rival \nneighborhood gang. They are one player short. Jeab happens to be hanging around, and he's asked to join the game, \nproving his abilities. He earns the trust of Jack's gang, and passes various tests in order to join. But the one thing \nhe must do is sever his ties to Noi-Naa. Jeab does so, quite literally, by cutting a rubber-band jump rope, \nwhich Noi-Naa is skilled at playing with. From that moment on, Noi-Naa refuses to talk to Jeab. Then, one day, \nJeab gets word that Noi-Naa is moving away. And, of course, on the day she is to leave, Jeab oversleeps and misses \nthe chance to say his final goodbye to Noi-Naa. Jeab then gets Jack and his friends to commandeer a delivery \nmotorcycle and pursue Noi-Naa and her family in their moving truck. But the motorcycle breaks down, and the truck \nrolls out of sight. Jeab is to never see Noi-Naa again ... until her wedding.\n","torrent":{"xt":"urn:btih:bd7a9ca54846c3bb7dc05c72e9a20278a29c868b","amp;dn":"Fan+Chan+-+Eng+Sub+%5BThai+Movie%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd7a9ca54846c3bb7dc05c72e9a20278a29c868b","infoHashBuffer":{"type":"Buffer","data":[189,122,156,165,72,70,195,187,125,192,92,114,233,162,2,120,162,156,134,139]},"announce":[],"urlList":[]}}