{"title":"Metro 2034 - Dmitry Glukhovsky (.pdf) - Srpski jezik","uid":8288151,"size":2009390,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bde77814271d5673e0b4a96e7151d369bbfe0cce&amp;dn=Metro+2034+-+Dmitry+Glukhovsky+%28.pdf%29+-+Srpski+jezik&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nicked011","files":1,"time":1363982556,"description":"Dve hiljade trideset i cetvrta. Prosla je jos jedna godina u kojoj poslednji pripadnici ljudske rase pokusavaju da preÅ¾ive u svetu unistenom nuklearnim ratom. Veci gradovi zbrisani su sa lica zemlje, o malima se nista i ne zna. Preostali ljudi krckaju svoje poslednje dane u bunkerima i sklonistima, od kojih je najvece - Moskovski metropoliten. Svi koji su se nasli u njemu dok su po prestonici padale bojeve glave raketa, bili su spaseni.\n\nPovrsina planete zagadjena je radijacijom i nastanjena cudovistima. Zivot je od sada moguc jedino pod zemljom. Covek viÅ¡e nije gospodar na planeti. Bica koja je iznedrila radijacija neuporedivo su prilagodjenija izmenjenom svetu. Epoha coveka je zavrsena.\n\nTo je svet za koji ne postoji sutra. U njemu nema prostora za mastanja, planove, nadu. Osecanja ustupaju mesto instinktima, od kojih je najvaÅ¾niji - preziveti. Preziveti po svaku cenu.\n\nStanice su pretvorene u gradove - drzave, a u tunelima vladaju tama i strah. Stanovnici Sevastopoljske - male podzemne Sparte, uz nadljudske napore prezivljavaju na svojoj stanici i brane je.\n\nAli desava se da Sevastopoljska bude odsecena od velikog metroa, i svim njenim stanovnicima preti strasna smrt.\nDa bi ljudi bili spaseni, potreban je pravi heroj. ","torrent":{"xt":"urn:btih:bde77814271d5673e0b4a96e7151d369bbfe0cce","amp;dn":"Metro+2034+-+Dmitry+Glukhovsky+%28.pdf%29+-+Srpski+jezik","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bde77814271d5673e0b4a96e7151d369bbfe0cce","infoHashBuffer":{"type":"Buffer","data":[189,231,120,20,39,29,86,115,224,180,169,110,113,81,211,105,187,254,12,206]},"announce":[],"urlList":[]}}