{"title":"Firelight (1997, Sophie Marceau)","uid":9350039,"size":871003460,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:be6ab942b6aff26749b4576e3e3a2ba0e1e565fc&amp;dn=Firelight+%281997%2C+Sophie+Marceau%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1387066092,"description":"English audio.\nXviD 640x480/AC3\n830MB\n\n\nA woman is torn by both romantic and maternal love in this period romantic drama set in the 1830s. Elisabeth (Sophie Marceau), a Swiss governess, is the beautiful daughter of a once-prosperous landowner who has fallen deeply into debt. Charles Godwin (Stephen Dillane) is a prominent British aristocrat whose wife has suffered a crippling accident; doomed to spend the rest of her life in a semi-comatose state, she cannot bear Charles the child he so desperately needs. So Charles strikes an agreement with Elisabeth; she will conceive a child with him and hand it over after it is born in exchange for him paying off her father's debts. Elisabeth and Charles set aside three nights to make a baby, and while the matter is supposed to be purely functional and not romantic, Elisabeth finds it difficult to feel that way at the end of the third evening. She is heartbroken when she has to give up the child, and her obsession with the daughter she gave away is reflected in her journals and sketchbooks. Seven years later, Elisabeth discovers the whereabouts of Charles and their daughter, Louisa (Dominique Belcourt); when she learns they need a governess, she is hired for the position by Charles's sister-in-law Constance (Lia Williams), who is unaware that Elisabeth is Louisa's birth mother. When Charles discovers that Elisabeth is the new governess, he is furious, but he eventually takes pity on her and allows her to stay with the child for one month. However, before long, Elisabeth's attraction to Charles resurfaces, and their clandestine romance forces a number difficult questions. Firelight marked the directorial debut of noted screenwriter William Nicholson.","torrent":{"xt":"urn:btih:be6ab942b6aff26749b4576e3e3a2ba0e1e565fc","amp;dn":"Firelight+%281997%2C+Sophie+Marceau%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be6ab942b6aff26749b4576e3e3a2ba0e1e565fc","infoHashBuffer":{"type":"Buffer","data":[190,106,185,66,182,175,242,103,73,180,87,110,62,58,43,160,225,229,101,252]},"announce":[],"urlList":[]}}