{"title":"WinSXSLite Complete Package (includes all dependencies!)","uid":7593881,"size":484905,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:be8cc4eebe6fd10eb1193be11cf2085af0d2c9d5&amp;dn=WinSXSLite+Complete+Package+%28includes+all+dependencies%21%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"notapirate","files":1,"time":1346630093,"description":"Here we have a handy-dandy utility to reduce the size of the ever-bloating WinSXS folder, present in Windows Vista, &quot;7,&quot; (6.1) and presumably &quot;8,&quot; (6.2) though this has not been tested by me. It removes old versions of system files and duplicates of system files to (sometimes drastically!) reduce the size of C:WINDOWSWinSXS, which can become very burdensome, especially on SSD-based systems.\n\nThis utility can be downloaded elsewhere, but if you do so, you will have to fish around for the half-dozen little gizmo programs it needs to function correctly. This ZIP file includes the main application AND the dependencies! Extract this ZIP to its own folder, and run the application with elevated privileges.\n\nWARNING: The modifications this application makes have the potential to cause undesired behavior or major system problems. Make a full partition backup of your system partition before attempting this, unless the machine's functionality is unimportant. If you don't know how to run the utility with elevated privileges or make a full-partition backup, you run a high risk of damaging something with this utility, and probably shouldn't use it. I will NOT give help in the comments\n\nAs with all such utilities, use it at your own risk.\n\n","torrent":{"xt":"urn:btih:be8cc4eebe6fd10eb1193be11cf2085af0d2c9d5","amp;dn":"WinSXSLite+Complete+Package+%28includes+all+dependencies%21%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be8cc4eebe6fd10eb1193be11cf2085af0d2c9d5","infoHashBuffer":{"type":"Buffer","data":[190,140,196,238,190,111,209,14,177,25,59,225,28,242,8,90,240,210,201,213]},"announce":[],"urlList":[]}}