{"title":"The First 20 Hours - Kaufman","uid":8600992,"size":3063951,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bf77501b4fbb65e2c83a0402fe83c03526f9abf4&amp;dn=The+First+20+Hours+-+Kaufman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"tommycool88","files":2,"time":1371880881,"description":"The First 20 Hours by Josh Kaufman\n\n#this new azw3 format gave me at least \n#20 minutes work to crack thx apprentice alf &amp; calibre \n#But then i \n#discover the book ain't that flash anyway \n#so i hope someone else can get some \n#entertainment from it\n#i can't seed often so hope someone\n#takes it over asap\n\n\nForget the &quot;10,000 hour rule&quot;... what if it's possible to learn any new skill in 20 hours or less? \n\nTake a moment to consider how many things you want to learn to do. What's on your list? What's holding you back from getting started? Are you worried about the time and effort it takes to acquire new skills - time you don't have and effort you can't spare? \n\nResearch suggests it takes 10,000 hours to develop a new skill. In this nonstop world when will you ever find that much time and energy? \n\nTo make matters worse, the early hours of practicing something new are always the most frustrating. That's why it's difficult to learn how to speak a new language, play an instrument, hit a golf ball, or shoot great photos. It's so much easier to watch TV or surf the web... \n\nIn The First 20 Hours, Josh Kaufman offers a systematic approach to rapid skill acquisition: how to learn any new skill as quickly as possible. His method shows you how to deconstruct complex skills, maximize productive practice, and remove common learning barriers. By completing just 20 hours of focused, deliberate practice you'll go from knowing absolutely nothing to performing noticeably well. \n\nThis method isn't theoretical: it's field-tested. Kaufman invites readers to join him as he field tests his approach by learning to program a Web application, play the ukulele, practice yoga, re-learn to touch type, get the hang of windsurfing, and study the world's oldest and most complex board game. \n\nWhat do you want to learn?\n","torrent":{"xt":"urn:btih:bf77501b4fbb65e2c83a0402fe83c03526f9abf4","amp;dn":"The+First+20+Hours+-+Kaufman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf77501b4fbb65e2c83a0402fe83c03526f9abf4","infoHashBuffer":{"type":"Buffer","data":[191,119,80,27,79,187,101,226,200,58,4,2,254,131,192,53,38,249,171,244]},"announce":[],"urlList":[]}}