{"title":"The Best of the Kinks 1977-1986 [FLAC+MP3]","uid":9509016,"size":735601061,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bfba25a345310a00ae61b641a1b789e4485bfada&amp;dn=The+Best+of+the+Kinks+1977-1986+%5BFLAC%2BMP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Big-Papi","files":-1,"time":1390366913,"description":"The Best of the Kinks 1977-1986 [FLAC+MP3] (Big Papi) Come Dancing with the Kinks\n\nSource: Gold CD\n\n\n\nBy David Bradley\n\nI love Ray Davies.\nI know Dave Davies has always been the critic's darling--all that talk about Dave being the godfather of punk guitar isn't so far off the mark--but Ray Davies has the best heart in Rock &amp; Roll.\n\nBut all that matters not a nit to much of the American public, who always left the Kinks sitting in second place behind the troika of Stones, Beatles and Who--maybe even behind Led Zeppelin and the over-ranked Animals--when it comes to discussions of British Rock. That's a shame, because the Kinks songwriting is as good or better than all of the above sans Beatles; Ray Davies lyrics are, at times, Dickensian.\n\nCOME DANCING WITH THE KINKS mines the Kinks most successful commercial period (In the USA, at least) from '77 to '86. The band seemed to be more intent on conquering the USA than they had been in the mid/late 1960s, and their problems with American unions, which had given the Kinks a lot of trouble a decade earlier, seemed to ease. They became known as a touring band in the States, a reputation which crumbled after a very well publicized onstage battle between the Davies brothers right here in Washington DC.\n\nThough there is one minor bow to the then-omnipresent Disco--&quot;Wish I Could Fly Like Superman,&quot; COME DANCING WITH THE KINKS is mostly full of nostalgia for the old ballrooms, desperate pleas for the band to stay together, and Rays infatuation with psychological oddities. Included are some of my favorite Kinks tunes, including &quot;Do It Again,&quot; &quot;Destroyer,&quot; &quot;Come Dancing,&quot; &quot;Don't Forget to Dance,&quot; and my All Time Favorite Kinks Record, &quot;Sleepwalker.&quot; There's never been a better melding of Rays lyrics, Daves guitar, a great Ray vocal, and hot Kinks backing vocals. &quot;Father Christmas&quot; is perfect, the exact Christmas tune you'd expect from Ray Davies, and is played to perfection.\n&quot;Misfits&quot; and &quot;Rock &amp; Roll Fantasy&quot; are classic Davies. The first looks at a fading eccentric--it's easy enough to imagine the tune as autobiographical--and gives a McCartneyesque pat on the head, with a real Ray Davies twist: &quot;You've been a misfit all your life; why don't you join the crowd and come on inside?&quot; he says, even while pointing out that the world is filled with misfits: &quot;They've given up living cause they just don't care. So take a good look around, the misfits are everywhere.&quot;\n\nI completely missed the point of &quot;Rock n Roll Fantasy&quot; when it was released; now I consider it one of the Kinks very best. Ray sings of his brother wanting to quit the band, sings about desperate music fans who spend every night locked in their flats spinning records. On first listen I thought this was glorification of the fans, mythologizing loners worshipping wax. Now I hear the pleading in Ray's voice at the end of the song and understand that he wanted to keep the band going so he wouldn't become one of those solitary people: &quot;You and me keep thinking our life has passed us by? I Don't want to live my life in a Rock n Roll fantasy,&quot; he sings--Ray Davies wants the Real Deal.\n\n&quot;Don't want to waste my life hiding away anymore--don't want to waste my life living in a Rock n Roll fantasy.&quot;\n\nI love Ray Davies: Hero of the awkward, the lonely, the depressed, the introverted.\n\nThere is another Kinks Greatest Hits/Best Of package you should hunt down, which will fill the gaps between the British Invasion &quot;You Really Got Me&quot; phase of the Kinks and this album: KINKS KRONIKLES, a two-CD set, covers my favorite phase of this great band's career--the Arthur &amp; Victoria phase.\n\nBut if you really want to 'get' the Kinks, hunt down all of their LPs released prior to '77: they were a lot more English during that phase, and their stuff really deserves to be heard in the fleshed out form of an LP, rather than on a Greatest Hits/Best Of package","torrent":{"xt":"urn:btih:bfba25a345310a00ae61b641a1b789e4485bfada","amp;dn":"The+Best+of+the+Kinks+1977-1986+%5BFLAC%2BMP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfba25a345310a00ae61b641a1b789e4485bfada","infoHashBuffer":{"type":"Buffer","data":[191,186,37,163,69,49,10,0,174,97,182,65,161,183,137,228,72,91,250,218]},"announce":[],"urlList":[]}}