{"title":"It's Just You And Me, Kid (1979)","uid":8934809,"size":721910798,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c0aebb34daed4edf198f95cc1a4306937ee5c88a&amp;dn=It%27s+Just+You+And+Me%2C+Kid+%281979%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"kithylin","files":1,"time":1379539570,"description":"First off, yes, this quality is pretty bad.  Yes the audio isn't in sync perfectly.\n\nI'm sorry about all of that, but anyone that is looking to download this movie would know, that this movie is nearly impossible to find, anywhere. Not online. Not streaming. Not as VHS. Not as DVD. Not as LaserDisc.\n\nAs far as I know, this movie was -NEVER- published to VHS, DVD, LaserDisc, or anything else.\n\nSome times it appears on cable networks, but not very often any more either.\n\nIt's difficult, and pretty much completely impossible to find this movie full length anywhere.\n\nI've found this split in to 10 pieces on youtube, and I've downloaded all 10 pieces, re-joined it together, deleted some commericals, and channel-advertisements from whatever place played it and someone that recorded it left that in there.\n\nSo here you go, the full length of this all together.\n\nAgain.. sorry about the quality, sorry about the audio not perfectly in sync.  I can't make it any better, and I can't find a better quality version anywhere.\n\nYes this is the early work of Brooke Shields herself, when she was I think 14 when doing this.\n\n","torrent":{"xt":"urn:btih:c0aebb34daed4edf198f95cc1a4306937ee5c88a","amp;dn":"It%27s+Just+You+And+Me%2C+Kid+%281979%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0aebb34daed4edf198f95cc1a4306937ee5c88a","infoHashBuffer":{"type":"Buffer","data":[192,174,187,52,218,237,78,223,25,143,149,204,26,67,6,147,126,229,200,138]},"announce":[],"urlList":[]}}