{"title":"Verdi - Luisa Miller (live)","uid":15690143,"size":351530234,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c0f0e272b47c1ae638fcb121e685c748d36c0d21&amp;dn=Verdi+-+Luisa+Miller+%28live%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RoaElson","files":11,"time":1472394491,"description":"Verdi - Luisa Miller\r\nAfternoon on 3, Thursday Opera Matinee\r\n\r\nIn this afternoon's opera matinee, Penny Gore presents Verdi's Luisa Miller, a romantic opera full of passion and intrigue. It is the story of Luisa and Rodolfo's love, which is challenged by their families' different social standings and ultimately ends in tragedy. This afternoon's performance was recorded in November at the State Opera in Hamburg. It was directed by Andreas Homoki and the Hamburg State Opera is conducted by Simone Young. The Georgian coloratura soprano Nino Michaidze takes the title role and Rodolfo is sung by the Italian-born tenor Ivan Magri.\r\n\r\nPresented by Penny Gore.\r\n\r\nVerdi\r\nLuisa Miller, opera in three acts\r\n\r\nMiller, a retired soldier.... George Petean (baritone)\r\nLuisa, his daughter.... Nino Michaidze (soprano)\r\nCount Walter.... Tigran Martirossian (bass)\r\nRodolfo, his son.... Ivan Magri (tenor)\r\nFederica, Duchess of Ostheim, Walter's Niece.... Christina Damian (contralto)\r\nWurm, Walter's steward.... Oliver Zwarg (bass)\r\nLaura, a village girl.... Ida Aldrian (mezzo-soprano)\r\nA Peasant.... Daniel Todd (tenor)\r\n\r\nHamburg State Opera Chorus\r\nHamburg State Opera Orchestra\r\nSimone Young (conductor)\r\n\r\nRecorded on 16 November 2014 at the State Opera, Hamburg.\r\n\r\nAlso - Verdi: Luisa Miller\r\nRadio 3 Opera Guides\r\n\r\nA guide to Verdi's opera Luisa Miller featuring opera historians Flora Willson, Sarah Lenton and Roger Parker\r\n\r\nPlus: Images from the production (singers not credited)\r\n\r\nSynopsis\r\nACT I. Tyrol, early 1700s. Luisa, daughter of an old soldier, is in love with a young man she knows as Carlo but who is actually Rodolfo, son of the local lord, Walter. The two lovers proclaim undying fidelity, but Miller, Luisa's father, is dubious, and his fears are confirmed when Walter's retainer, Wurm, who also loves Luisa and hopes to marry her, reveals Rodolfo's true identity.\r\n\r\nIn Walter's castle, Wurm tells his master of Rodolfo's love for Luisa. Walter resolves to end their relationship, because he hopes to have his son marry a widowed duchess, Federica. Left alone with her, Rodolfo reveals that he loves another, but the duchess, who has worshiped him since childhood, refuses to break their engagement.\r\n\r\nAt home, Miller tells Luisa that Rodolfo has deceived her and is about to contract a wealthy marriage. The young man, however, comes to plead his sincerity. When Walter storms in shortly afterward and is about to have both Luisa and her father consigned to prison, Rodolfo secures their freedom by threatening to reveal how his father, with Wurm's assistance, murdered his cousin to gain his present position.\r\n\r\nACT II. Luisa learns that her father has been jailed for insulting Walter. Wurm tells her the only way she can save Miller is to write a letter admitting she sought Rodolfo for his wealth, and pledging herself to Wurm. After doing his bidding, she learns she must go to the castle and declare her love for him before the duchess.\r\n\r\nWurm presents Luisa's letter to Walter, and the two plot to send it to Rodolfo. Wurm then brings in Luisa. Goaded on with threats by Wurm and Walter against her father, she professes her love for Wurm to Federica.\r\n\r\nRodolfo receives Luisa's letter in the castle courtyard. In despair he is about to attack Wurm when Walter appears and persuades him that marrying Federica will be the best way for him to avenge Luisa's treachery.\r\n\r\nACT III. Miller, released from prison, tries to comfort Luisa. The two agree to leave the village the next day. As Luisa prays, Rodolfo enters and pours a vial of poison into a decanter on the table. He confronts Luisa with the letter. When she cannot deny she wrote it, Rodolfo asks her to pour him a drink; when he says it tastes bitter, she swallows some too. Rodolfo tells Luisa the cup was poisoned, and she, released from her vow, tells him the truth. As Luisa expires in Miller's arms, Rodolfo, with a final effort, kills Wurm.\r\n\r\nMedia info:-\r\n\r\nGeneral\r\nFormat : MPEG Audio\r\nOverall bit rate mode : Constant\r\nOverall bit rate : 320 Kbps\r\n\r\nAudio\r\nFormat : MPEG Audio\r\nFormat version : Version 1\r\nFormat profile : Layer 3\r\nMode : Joint stereo\r\nBit rate mode : Constant\r\nBit rate : 320 Kbps\r\nChannel(s) : 2 channels\r\nSampling rate : 48.0 KHz\r\nCompression mode : Lossy\r\nWriting library : LAME3.98r\r\nEncoding settings : -m j -V 4 -q 3 -lowpass 20.5","torrent":{"xt":"urn:btih:c0f0e272b47c1ae638fcb121e685c748d36c0d21","amp;dn":"Verdi+-+Luisa+Miller+%28live%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0f0e272b47c1ae638fcb121e685c748d36c0d21","infoHashBuffer":{"type":"Buffer","data":[192,240,226,114,180,124,26,230,56,252,177,33,230,133,199,72,211,108,13,33]},"announce":[],"urlList":[]}}