{"title":"Thelonious Monk - Alone in San Francisco (1959) [Jazz][mp3 320][","uid":4929952,"size":108303275,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c1051fd2a2a8915245e2891d4947013b2f1c74f8&amp;dn=Thelonious+Monk+-+Alone+in+San+Francisco+%281959%29+%5BJazz%5D%5Bmp3+320%5D%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":17,"time":1244000783,"description":"Thelonious Monk - Alone in San Francisco \nOriginal Release Date: October 21, 1959 \nLabel: Ojc \nAudio CD: July 1, 1991 \nBitrate: 320 kbps\n\nThere are simply no other records, to me, that capture a sense of harmony, melody, beauty, pain, loneliness, joy, all in one magical recording.  This set was recorded in the afternoon between shows in San Fran.  The song selection is amazing.  This is a record I never put away for long.  It has a magical spontaneity to it.  Monk's playing is brilliant, but he has that Neil Young-type quality of being slightly flawed or imperfect in evertying he does.  This is why I love his music ( and Neil's too ).  ~ chessgeek1\n\nThelonious Sphere Monk - brilliant pianist, quirky composer.  His offbeat sense of harmonics and unusual musical sensibility may have gotten him kicked out of the Julliard music school and made his material a tad skewed for the casual listener to follow - now just as much as then - but to those willing to make a little adjustment, it's the reason he's always been such a complete original.  He worked chords and combinations out of a piano that no one else ever thought of.  The man was brilliant in any context, but I say his solo albums are the best way of hearing an eccentric genius at work.  He plays around with ideas and variations like a sculptor with clay: old standards are given a new twist, his own past songs are nudged and prodded into shapes they'd never seen before, and there's never a lack of new ideas brought to the table.\n  \nDifferent people's ratings of the man's albums are always individual things, but Alone in San Francisco has always been my favorite.  As usual you can't always know what to expect.  The mood is predominantly quiet and reflective with a touch of the blues: &quot;Blue Monk&quot; ( go figure ), &quot;Round Lights&quot; and &quot;Bluehawk&quot; are all basically blues tunes, but even within that framework the playful improv work makes them almost nothing alike.  The only track that took more than one take is not a Thelonious original, but an obscure 1920s pop tune ( &quot;they won't be expecting anything like this from me,&quot; he's quoted in the liners ).  There's some ear-tweaking trick or quirk around every corner here.  The compositions don't usually follow standard keys or modes as we know them.  When there's a catchy right-hand melody being woven, the block chords underneath it follow an unusual progression that doesn't match up the way you'd expect.  Even the timing's sometimes weird, as in the opening to &quot;Everything Happens to Me&quot;..  but somehow everything sounds natural with a logic all its own, if you just listen for it.\n\nShort but sweet at 45 minutes, more easy and accessible than some other choices ( e.g.  Brilliant Corners or Underground ), and usually pretty well priced, this disc makes a great introduction for those new to Monk.  Solo Monk also makes a worthy find in this vein since it's got more alternate takes, giving a better picture of just how unique every TM performance was, but Alone in SF has always connected with me on a more personal level.  As one of the reviewers below said, it's got the perfect empty-club-at-closing-time feel; quiet but not lonely, subdued yet peaceful.  This is the one to unwind with while by yourself..  or with the kind of company that doesn't mind sharing a little quiet time.  Newcomers, try this or Straight, No Chaser for a good first taste.  Established fans: this one shouldn't disappoint in the least.  ~ spiral mind\n\nThelonious Monk Solo Piano\n\nThelonious Monk - Alone in San Francisco Tracks:\n01  Blue Monk\n02  Ruby, My Dear\n03  Round Lights\n04  Everything Happens to me\n05  You took the Words Right Out of My Heart\n06  Bluehawk\n07  Pannonica\n08  Remember\n09  There's Danger in your Eyes, Cherie ( take 2 )\n10  There's Danger in your Eyes, Cherie ( take 1 )\n11  Reflections","torrent":{"xt":"urn:btih:c1051fd2a2a8915245e2891d4947013b2f1c74f8","amp;dn":"Thelonious+Monk+-+Alone+in+San+Francisco+%281959%29+%5BJazz%5D%5Bmp3+320%5D%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1051fd2a2a8915245e2891d4947013b2f1c74f8","infoHashBuffer":{"type":"Buffer","data":[193,5,31,210,162,168,145,82,69,226,137,29,73,71,1,59,47,28,116,248]},"announce":[],"urlList":[]}}