{"title":"Gregory Bratton - 2013 - Just What The World Is Looking For - Fu","uid":9416602,"size":91819332,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c17e97e2b5c83cd403412df34ea6d3bb9e86d304&amp;dn=Gregory+Bratton+-+2013+-+Just+What+The+World+Is+Looking+For+-+Fu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"gregory_bratton","files":-1,"time":1388460738,"description":"Just What the World Is Looking For\nby Gregory Bratton\nArtist page: http://www.gregorybratton.com\n2013 Â© Copyright - Gregory Bratton / Gregory Bratton \n\nSUPPORT THIS ARTIST\niTunes: https://itunes.apple.com/us/artist/gregory-bratton/id707678571\nPhysical CDs: http://kunaki.com/MSales.asp?PublisherId=136493\nGoogle Play: https://play.google.com/store/music/artist/Gregory_Bratton?id=Axt7eez5ytfnmhk4seiqqsfcmnm\nCD Baby: http://www.cdbaby.com/Artist/GregoryBratton\n\nLife is not only for the unscarred or the rich and charmed. The only requirement to truly live is a pulse and a willingness to serve others, despite any of your shortcomings. The sound is modern pop, but voiced with classic, timeless instrumentation.\n\nGenre: Spiritual: Contemporary Christian\nRelease Date: 2013\n\n\nAlbum Notes\n\n1) Just What The World Is Looking For\nIf you have failed in certain areas of your life, it doesn't mean you have nothing to offer. The world needs people who have &quot;been there and done that&quot; to share their experience with others and freely give their time and talents. You are not worthless, you are just what the world is looking for!\n\n2) Once Came An Epiphany\nThe word &quot;Epiphany&quot; was at one point, defined as &quot;The sudden revelation that Jesus is the Messiah.&quot; The fundamental goal of all Christians is to guide non-believers into the same revelation. The desire to share this insight is the inspiration for this song.\n\n3) Sitting Next To You\nMy wife and I recently celebrated 17 married years together. After all of this time, one of the moments I look forward to the most each day is our evening coffee time on the porch. I purpose each day to make sure nothing keeps that from happening.\n\n4) There Is A Cause\nWe sit on the most exciting news in human history, but to a casual observer, often you would not be able to tell. This song asks the question, &quot;Is there not a cause?&quot;\n\n5) Inspector Virlo Morton Lee\nThis is a comedic song about a bumbling detective thick in the middle of a murder mystery on a rainy night.\n\n6) A Thousand Years\nWe are lucky if we get 100 years on planet Earth, much less a thousand. There are so many time-sucker traps in life that get in the way of fulfilling your God-given destiny. This song is about seizing the day and living the purpose-driven life you were made to live.\n\n7) Something Beautiful\nThis song is very much in the central album theme of having worth even in the midst of your greatest failures. The song says, &quot;There's so much more to you, than what you're going through.&quot; Don't define yourself by your struggles, you are a child of the King!\n\n8) Dontcha Know\nThis is a tale of a bullied 12-year old boy looking for love and acceptance, and finding neither.\n\n9) Autumn Drive\nI remember driving through the country roads of West Virginia watching the fallen leaves eddy in the mirrors. The melody for this instrumental came to me as the crisp air blew in through the open windows.\n\n10) Never Let Go\nThe only people who are never criticized are the ones who never venture to put anything on the line. Once you've made the decision to enter the arena, you will face adversity. This song is about the soul-searching and prayerful attitude necessary to carry on.\n\n11) Up With God (Ps 68, The Message)\nThe lyrics were inspired by Psalms 68, as translated by The Message Bible. It is nothing new to set the Psalms to contemporary music, in fact it is a great tradition undertaken by generations of Christian musicians. I am honored to join the club.\n\n12) Snowflakes\nThis is a dreamlike stream-of-consciousness song that sounds much better than this confusing description. :)\n\n13) Till We Win (A New Year's Eve Song)\nI wrote and performed this song specifically for a New Year's Eve church service where I felt the people needed support and encouragement for the upcoming year. The title and theme is based off of one of Pastor Datha Thomas' favorite sayings, &quot;With God, it's not over 'till you win.&quot;","torrent":{"xt":"urn:btih:c17e97e2b5c83cd403412df34ea6d3bb9e86d304","amp;dn":"Gregory+Bratton+-+2013+-+Just+What+The+World+Is+Looking+For+-+Fu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c17e97e2b5c83cd403412df34ea6d3bb9e86d304","infoHashBuffer":{"type":"Buffer","data":[193,126,151,226,181,200,60,212,3,65,45,243,78,166,211,187,158,134,211,4]},"announce":[],"urlList":[]}}