{"title":"[BlacksOnBlondes] Vicky Vixen Interracial DP 720p","uid":13894296,"size":1171433763,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:c2dda3eda9bb9f9fb37449a1986ef454df1a4afd&amp;dn=%5BBlacksOnBlondes%5D+Vicky+Vixen+Interracial+DP+720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"distinc","files":1,"time":1458231677,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=4520447655\r\n \nhttp://imagedisco.net/?g=7023409419\r\n\r\n\r\n\r\nDescription:\r\n\r\nVicky Vixen may have bitten off more than she can chew. Vicky found us on twitter and asked to be part of a roster of black cock sluts that reads a million miles long. We saw her pics and had her come in to get drilled, fucked and obliterated by Wesley Pipes and Shane Diesel. Needless to say, Vicky was as nervous as any human can possibly be. Vicky agreed to let Wesley in her ass , and Shane would have unresrtricted access to her vaginal cavity. The camera started recording and a beautiful thing happened: The nervous girl with tits made ​​by the lord himself, took on both black cocks like a champ. Vicky, like a caged animal, went wild once she was unleashed on our 2 black swordsmen. Her mouth took over 24 inches of black cock until her wind pipe nearly collapsed. Vicky Vixen's pussy? The double blow job she gave got her all nice and moist that she took Shane until his balls were massaging her throbbing clit. Wesley, the opportunist, got deep in her ass while her screaming rattled everyone's eardrums. vicky was in the middle of an interracial sandwich, and her screams got louder and louder. Vicky initially did not think she could take them both at the same time. However, she got so caught up in the moment that she demanded to get her ass and pussy stuffed with big, black cocks. Vicky's double penetration saw her tits shake in a manner that words simply can not describe. Vicky did not want to leave our studio until she drained every inch of black cock onto her face. Black jizz was dripping off her face and right onto those enormous white tits. We like to think we've made ​​another whore's dream come true","torrent":{"xt":"urn:btih:c2dda3eda9bb9f9fb37449a1986ef454df1a4afd","amp;dn":"%5BBlacksOnBlondes%5D+Vicky+Vixen+Interracial+DP+720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2dda3eda9bb9f9fb37449a1986ef454df1a4afd","infoHashBuffer":{"type":"Buffer","data":[194,221,163,237,169,187,159,159,179,116,73,161,152,110,244,84,223,26,74,253]},"announce":[],"urlList":[]}}