{"title":"[24/96] Pink Floyd - P.U.L.S.E - 1995, Vinyl Rip","uid":7041174,"size":3361244846,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c30f2b6f92b9c49c24f74b09f49b24ec43d4df3c&amp;dn=%5B24%2F96%5D+Pink+Floyd+-+P.U.L.S.E+-+1995%2C+Vinyl+Rip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"npto","files":-1,"time":1329547899,"description":"Pink Floyd - P.U.L.S.E - 1995\n\nUK, EMD 1078, EMI, Cat.# 7243 8 32704 1 5/6/7/8\n\n4LP, Vinyl Rip, 24/96, FLAC (image+.cue)\n\nRip by AlfredoCatalani (my resampling in image, Sound Forge Pro 10.0)\n\nTrack Listing :\n\nLP1\n01. Shine On You Crazy Diamond (13:30)\n02. Astronomy Domine (5:25)\n03. What Do You Want From Me (4:10)\n04. Learning to Fly (5:06)\n05. Keep Talking (6:56)\n06. Coming Back to Life (6:31)\n\nLP2\n07. Hey You (4:50)\n08. A Great Day for Freedom (4:20)\n09. Sorrow (10:30)\n10. High Hopes (7:48)\n11. Another Brick in the Wall: Part Two (6:50)\n12. One of These Days (only on LP)\n\nLP3\n13. Speak to Me (2:28)\n14. Breathe (2:40)\n15. On The Run (3:41)\n16. Time / Breathe (reprise) (6:48)\n17. The Great Gig in the Sky (5:51)\n18. Money (8:46)\n\nLP4\n19. Us and Them (7:08)\n20. Any Colour You Like (3:19)\n21. Brain Damage (4:02)\n22. Eclipse (1:38)\n23. Wish You Were Here (5:40)\n24. Comfortably Numb (9:10)\n25. Run Like Hell (7:58)\n\nRecordings are made during the world tour 1994-95. The sound quality of these vinyls is a giant step over the CD sound. Lucky one, who owns this scarce box, that came in limited edition on 140 gramm vinyl 1995. (Alf)\n\nWhile not FLOYD's best ever live offering, &quot;P-U-L-S-E&quot; is still a marvelous journey to behold. A wonderful choice on song selection was done for this release, with respectful numbers of new, older and even some really old obscure tunes for the longtime fans. Everything on P-U-L-S-E from the production of the music, to its seemless track flow (a FLOYD standard), right down to the packaging is top notch. This is an historical document of FLOYD's work and worth acquiring.\n.......\nWhile having a decent number of 'new' (i.e. five &quot;Division Bell&quot;) songs, P-U-L-S-E does not overdo it; whereas maybe &quot;The Delicate Sound of Thunder&quot; did have too many new &quot;AMLOR&quot; songs on it. As usual with FLOYD, the live versions of these newer songs have new life breathed into them and generally sound fresher than those offered on the original studio versions.\n&quot;Lime and limpid green, the second scene..&quot;\nThe most enjoyable thing about this edition is the FLOYD 'classic era' stuff. I remember people leaving the Olympic Stadium in Montreal in 1994 saying joyfully &quot;I can't believe they actually played 'Astronomy Domine'!&quot; While a little faster paced than the original, it was still quite remarkable to hear the band crank this old chestnut out live. Listen to the roar of the crowd when the initial guitar riffs of 'Domine' are recognized.\nMany reviewers have mentioned that they actually prefer the complete live version of &quot;Dark Side of the Moon&quot; offered here over the original studio gem. I'd tend to agree with them, except for one small point. There is the glaring absence of a certain Mr. Waters that should be singing the climactic 'Brain Damage/Eclipse' portion of this prog masterpiece. For this reason, a star HAS to be deducted from the final rating. But aside from that, hearing the band play 'Speak To Me', 'Any Colour You Like', 'Great Gig in the Sky' and 'On The Run' in the full live version of &quot;Dark Side&quot; is priceless, and for this reason alone is worth buying this release.\nA final note about the packaging. Marketing directors take note! This is how you should release music to your fans!\n.......\nThe &quot;P-U-L-S-E&quot; Iris image on its cover is unique in its display. Look closely inside the image, what do you see? A bike...clock machinery...a children's doll with red slippers... Surely these are references to BARRETT's 'Bike', WATERS' 'Time' and the female doll with the ruby slippers, well that's Dorothy of course! It is by paying attention to little details like these, that FLOYD and Storm Thorgerson have acheived an almost cult status among its followers.\nDave Gilmour is in top form here. His singing and note-bending on his stratocaster is untouchable, especially on &quot;Numb&quot;. A mind-boggling 2 and 1/2 hours of live FLOYD music. 4/5 stars, highly recommended, if only it had Roger, it would be perfect... (progarchives.com)\n\nequipment used :\n\nAmplifiers\nTube Pre-Amp Unico Pre by Unison Research\nTube Mono End-Amps Consonance Reference 9.9 by Opera\n\nTurntables\nClearaudio Champion Level II with Special Edition Denon 103\nPro-Ject RPM 6 SB with Sumiko Evolution III\n\nPrograms (MAC):\nTwisted Wave, Cool Edit, Audition\t","torrent":{"xt":"urn:btih:c30f2b6f92b9c49c24f74b09f49b24ec43d4df3c","amp;dn":"%5B24%2F96%5D+Pink+Floyd+-+P.U.L.S.E+-+1995%2C+Vinyl+Rip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c30f2b6f92b9c49c24f74b09f49b24ec43d4df3c","infoHashBuffer":{"type":"Buffer","data":[195,15,43,111,146,185,196,156,36,247,75,9,244,155,36,236,67,212,223,60]},"announce":[],"urlList":[]}}