{"title":"The Anthony Cumia Show 2014-11-25 MP4 MP3 combo","uid":11572122,"size":344865349,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c32183acbb47055fad0b57945bae86be03d68ed8&amp;dn=The+Anthony+Cumia+Show+2014-11-25+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mothergoose58","files":-1,"time":1417041051,"description":"Episode 066: Free day number two starts by going through the misconceptions surrounding the grand jury decision of Officer Wilson, Wilson's testimony, what was proven in Michael Brown's death, and people's blind support of the case. Ant also talks about the protests, and looting that the idiots in Ferguson are doing, the media's part in all of this, and we watch videos of Brown's family after the verdict. We find out who the lucky Photoshop contest winner is that gets into the poker tournament at Mohegan Sun and then, Anthony moves to the bar to talk with Jenny Hutt and Dr. Steve. Steve talks about his appearance on the OnJ show earlier, they discuss Bill Cosby, we learn Jenny Hutt cannot process alcohol, they chat about past drinking experiences, and Steve and Ant reminisce on their divorces. Dr. Steve brings out his baby circumcision simulator and proceeds to clip cock and then, he breaks out his prostate examination dummy to show Ant and Jenny how to check for issues. They end the show by chatting about breast checks, magicians, texting while driving, and reckless driving.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:c32183acbb47055fad0b57945bae86be03d68ed8","amp;dn":"The+Anthony+Cumia+Show+2014-11-25+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c32183acbb47055fad0b57945bae86be03d68ed8","infoHashBuffer":{"type":"Buffer","data":[195,33,131,172,187,71,5,95,173,11,87,148,91,174,134,190,3,214,142,216]},"announce":[],"urlList":[]}}