{"title":"The Urge - Discography","uid":5467030,"size":241581667,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c4a703faf591c1843b732c1ff505fb04dad7bc60&amp;dn=The+Urge+-+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"brx017","files":62,"time":1269673296,"description":"Brx017 Presents:\n\nThe Urge - Discography\n\n\n\nFrom WikiLou - The St. Louis Wiki\n\nThe Urge was an alternative ska-punk band formed in 1987 by singer Steve Ewing, bassist Karl Grable, drummer Jeff Herschel, and guitarist Pat Malecek. This original line-up made its recording debut in 1989 with cassette-only release Bust Me Dat Forty, followed a year later by Puttin' the Backbone Back. The group's 1992 release, Magically Delicious, was their first with trombonist Matt Kwiatkowski, and their live release in 1993 (Fat Babies in the Mix) included trombonist/keyboardist Todd Painter and saxaphonist/keyboardist Bill Reiter. \n\nThe band quickly gained a reputation for stage-diving off the stage at Mississippi Nights and intense mosh pits formed whenever they played. The fans were widely known to travel with the band to venues across the Midwest. \n\nIn 1994, Herschel and Malacek left The Urge; they were replaced by John Pessoni and Jerry Jost respectively. The band subsequently toured with 311, and as a result of their increased national exposure as well as KPNT's support of the songs &quot;Violent Opposition&quot; and &quot;Brainless,&quot; their 1995 release (Receiving the Gift of Flavor) was so successful that it raised them on national record label Epic's radar, whose Immortal imprint re-released the album in 1996. \n\nAfter near-constant touring with Epic label-mates (such as Korn and Incubus), the band released Master of Styles in 1998, which contained the hit &quot;Jump Right In&quot; featuring Nick Hexum of 311. \n\nFollowing the release of Too Much Stereo in mid-2000, the band toured for nearly a year before calling it quits at the end of 2001 following two sold-out shows at The Pageant. \n\nSince breaking up, the band has played several reunion shows, most recently in 2003. Ewing has made several solo records under the name Stevie E., while Jost was almost chosen as the replacement guitarist for Limp Bizkit after Wes Borland left the band in 2002. The other members still reside in St. Louis and are involved in several musical projects. \n\nDiscography\nBust Me Dat Forty (self-released, 1989) \nPuttin' the Backbone Back (self-released, 1990) \nMagically Delicious (self-released, 1992) \nFat Babies in the Mix (self-released, 1993) \nReceiving the Gift of Flavor (self-released, 1995; Immortal Records, 1996) \nMaster of Styles (Immortal Records, 1998) \nToo Much Stereo (Immortal Records, 2000)\n\n\n\n\nNOTE: First off, sorry this is not a COMPLETE DISCOGRAPHY. I only made this torrent because I couldnt find one like it anywhere.\n\nThis torrent is missing the albums &quot;Bust Me Dat Forty&quot; and &quot;Puttin' The Backbone Back&quot;. Sorry, but I cant find them anywhere. Two EPs were also released in 2000: &quot;Live and Unreleased&quot; and &quot;Rare and Out of Print&quot;. I dont have these either. If anyone has any of these albums, PLEASE SHARE! I would love to make a &quot;COMPLETE DISCOGRAPHY&quot; torrent. brx017 at gmailcom\n\nAlso, This torrent contains the 1996 Immortal Records version of &quot;...Flavor&quot;, which has a different track 7, so &quot;Killing Is Easy&quot; is missing (which is a shame, it's one of my personal favorites).\n\n","torrent":{"xt":"urn:btih:c4a703faf591c1843b732c1ff505fb04dad7bc60","amp;dn":"The+Urge+-+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4a703faf591c1843b732c1ff505fb04dad7bc60","infoHashBuffer":{"type":"Buffer","data":[196,167,3,250,245,145,193,132,59,115,44,31,245,5,251,4,218,215,188,96]},"announce":[],"urlList":[]}}