{"title":"Secret Files of the Inquisition (2006) DVDrip","uid":3569306,"size":1681566107,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c5f80ca144b1636cf90b98e4b20c6421930ce8b7&amp;dn=Secret+Files+of+the+Inquisition+%282006%29+DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"grinreaper_CCE","files":8,"time":1165079341,"description":"For centuries, the historical records of the Inquisition have been locked away to become the subject of myth and legend. In 1998, after years of pressure from historians, scholars and critics in search of the truth, the Vatican opened some of these archives for the first time.\n\n$3-million-plus international co-production was filmed in High Definition on location in Italy, France and Spain. It was produced and directed by Emmy Award-winning filmmaker David Rabinovitch, and features narration by actor Colm Feore (Trudeau).\n\nEarned a Gemini Award in the Documentary, News and Sports categories.\n\nDavid Rabinovitch received the Gemini Award for Best Direction in a Documentary Series for his work on ?Tears of Spain,? the second episode of the four-part series.\n\nThis four-part series attempts to reveal the incredible yet true story of the western world\\&amp;#039;s most potent religion and its determination to maintain power at any cost. Using previously secret documents, this series reveals how the most powerful church on earth created the Inquisition to preserve the unquestioned authority of the Pope. Interviews with church and secular historians as well as dramatic recreations convey how a system of mass terror reigned for over half a millennium.\n\nFilmed in High Definition, this production spans medieval France in Episode 1, 15th century Spain in Episode 2, Renaissance Italy in Episode 3 and mid-nineteenth century Europe in Episode 4.\n\nSecret Files of the Inquisition - Pt1 (The Land Of Terror)\n\nFrance 1308 - The Church of Rome proclaims it?s self the one true religion, but heresy takes hold and the pope declares a holy war against other Christian followers. Inquisitors are sent to exterminate the heresies by hunting down the condemning believers to burn at the stake. 1308 the entire village of Montaillou is taken prisoner of the Inquisition. No one is safe - not even the village priest and the chatelaine of its castle. From the secret files - the extraordinary revelations of village life under the Inquisition are revealed.\n\nSecret Files of the Inquisition - Pt2 (The Tears Of Spain)\n\nSpain 1468 - A land where Christians, Muslims and Jews have lived in tolerance for centuries. That time is ending. A young King and Queen proclaim themselves Catholic Monarchs and start an Inquisition. Jews who had converted to Christianity are accused of secretly sabotaging the Christian faith. They become the pawns in a game of chess with dire consequences. Thousands perish in a ritual called the act of faith. In Zaragossa, the inquisitor is assassinated - setting off a wave of reprisals. Mothers will die to protect their children - and the highest in the land will pay the ultimate price. It is the beginning of the Spanish empire and a long dark night that will last for centuries.\n\nSecret Files of the Inquisition - Pt3 (The War Of Ideas)\n\nItaly 1522 - The decadence of a Medici Pope in Rome outrages the devout priest in Germany named Martin Luther. In the face of the Protestant Reformation, a fanatical monk sets out to exterminate the heresy. On his path to power he will create the Roman Inquisition. And he will become the most hated Pope in history. Powerful leaders of the Catholic Church are arrested and imprisoned, accused of reading books banned by the Church. Free-thinking students are silenced. Darkness descends on the centers of learning and Renaissance. The Roman Inquisition leaves a legacy that lasts into the twentieth century.\n\nSecret Files of the Inquisition - Pt4 (The End Of Inquisition)\n\nThe secret files of the Inquisition are locked away for centuries. A Spanish priest devotes his life to exposing the brutal records of the Inquisition. Napoleon spreads the ideas of the Enlightenment. He conquers Italy, abolishes the Inquisition and orders its files sent to Paris. Spain\\&amp;#039;s greatest painter, Goya, will depict the Inquisition for the first time - and then run for his life. The kidnapping of a young Jewish boy secretly baptized will be one of the desperate last attempts at exerting the power of the Inquisition. A devoted father fights to get back his son. The boy becomes a symbol for a Pope who is about to lose his dominion on earth.\n\nWatch trailers here: http://www.inquisitionproductions.com/trailers.html\n\nGenre: Docudrama\nVideo: XVID 576x320 25.00fps 980Kbps [Video 0]\nAudio: MPEG Audio Layer 3 48000Hz stereo 128Kbps [Audio 1]\nLength: 50 mins each.\nDVD covers included.\n\nTorrent and Info Source: &lt;a href=&quot;\nhttp://www.islamictorrents.net/details.php?id=7973&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.islamictorrents.net/details.php?id=7973&lt;/a&gt;\n\nTech Specs (~for all parts):\n\nGeneral #0 \nFormat/String : Audio Video Interleave \nOveralBitRate/String : 1118 Kbps \nPlayTime/String : 49mn 59s \nEncoded_Application : FairUse Wizard - http://fairusewizard.com \n\nVideo #0 \nCodec/String : XviD \nCodec/Info : XviD project \nBitRate/String : 977 Kbps \nWidth : 576 \nHeight : 320 \nAspectRatio/String : 16/9 \nFrameRate/String : 25 fps \nBits/(Pixel*Frame) : 0.212 \n\nAudio #0 \nCodec/String : MPEG1/2 L3 \nCodec/Info : MPEG1 or 2 Audio Layer 3 \nBitRate/String : 128 Kbps \nChannel(s)/String : 2 channels \nSamplingRate/String : 48 KHz \n\n===============================================================================\nLearn the true nature of the world, come visit our huge dedicated e-library and forums @ &lt;a href=&quot;\nhttp://conspiracycentral.net:6969/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.net:6969/index.html&lt;/a&gt;  &lt;a href=&quot;\nhttp://conspiracycentral.info/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.info/index.php&lt;/a&gt;\n===============================================================================","torrent":{"xt":"urn:btih:c5f80ca144b1636cf90b98e4b20c6421930ce8b7","amp;dn":"Secret+Files+of+the+Inquisition+%282006%29+DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5f80ca144b1636cf90b98e4b20c6421930ce8b7","infoHashBuffer":{"type":"Buffer","data":[197,248,12,161,68,177,99,108,249,11,152,228,178,12,100,33,147,12,232,183]},"announce":[],"urlList":[]}}