{"title":"Avatar: The Legend of Aang (Nintendo DS)","uid":4808605,"size":67108864,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:c77a9bf62bdd31971c49b2b58d5b61694dc52979&amp;dn=Avatar%3A+The+Legend+of+Aang+%28Nintendo+DS%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Toomanypixels","files":-1,"time":1238281728,"description":"Enjoy PC gaming in never before gaming platforms. &quot;Avatar: The Legend of Aang&quot;, also popular as Avatar: The Last Airbender is an exotic game, full of intrigues, revelations and adventurous events. Add a zing to your life with lifelike PC gaming in &quot;Avatar: The Legend of Aang&quot;.\n\nUnlike most other games of this generation, &quot;Avatar: The Legend of Aang&quot;, is filled with thrilling moments and exhilarating game play. The players have the opportunity to use the tactics of martial arts in a Avatar arena. The players would play as Aang, Katara and Haru and also explore unknown nations and fight with f urious enemies.\n\nPlayers find great excitement while playing a game like this. With lot many things to imagine, the players explore the unknown. In a stimulating combat combined with magic and martial art, the characters march hand-in-hand towards victory. You can also use your imagination and customizable powers to master over the enemies. Also, players can try to master over earthly elements like air, earth, water and fire.\n\nCheck in to the detailed environment of the avatar nations. Also, the amazing graphic effects of the game would actually appeal you.\n\nAvatar: The Legend of Aang (Nintendo DS) is full of breathtaking events. It is a single player game that features martial art. Also the &quot;blending powers&quot; for mastering the elements of the earth are customizable. Further, players are introduced to various TV artists as well as never encountered enemies.\n\nPlaying a cool game like &quot;Avatar: The Legend of Aang&quot;, in the PC is an amazing experience. Especially, with lot of exciting moments like firing enemies, discovering the environment of the Avatar nations and combating with enemies is an exciting experience. Avatar: The Legend of Aang (Nintendo DS) is here to make your gameplay more thrilling and wonderful. What more--from sensational combats to exciting exploration and a superb platform like the Nintendo DS, this game has everything you require for a stimulating gameplay.","torrent":{"xt":"urn:btih:c77a9bf62bdd31971c49b2b58d5b61694dc52979","amp;dn":"Avatar%3A+The+Legend+of+Aang+%28Nintendo+DS%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c77a9bf62bdd31971c49b2b58d5b61694dc52979","infoHashBuffer":{"type":"Buffer","data":[199,122,155,246,43,221,49,151,28,73,178,181,141,91,97,105,77,197,41,121]},"announce":[],"urlList":[]}}