{"title":"Stray Cats - Stray Cat Strut [Friday Night, 1981].VOB","uid":9340054,"size":155256832,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c828d619bb6a56b80a649e10e755cfc364bed7a7&amp;dn=Stray+Cats+-+Stray+Cat+Strut+%5BFriday+Night%2C+1981%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1386913292,"description":"Stray Cats - Stray Cat Strut [Friday Night, 1981].VOB\n\n\nHQ rare &quot;Friday Night&quot; TV show live performance music video. &quot;Stray Cat Strut&quot; is the eighth track on the Stray Cats' debut album, Stray Cats, released in 1981 in the UK. In the US, the song was first released in 1982 on Built for Speed. The song became a hit in the US, peaking at number three on the Billboard Hot 100, over a year after it had reached its number eleven peak in the UK. The music video for the song received extensive airplay on MTV during the channel's early days. The video consists of band members (and extras) performing in an alley while an irate resident throws things at them. It also features scenes from the 1949 MGM cartoon Bad Luck Blackie, and a bass line derived from The Cat Came Back.\n\nIn the October 1998 issue of Guitar World magazine, Brian Setzer's solo from &quot;Stray Cat Strut&quot; ranked #92 on the &quot;Top 100 Guitar Solos of All Time&quot; list.  (He really nails the solo in this awesome performance :)\n \nThe Stray Cats are an American rockabilly band formed in 1980 by upright bassist Lee Rocker, Slim Jim Phantom (drums) and guitarist Brian Setzer in the Long Island town of Massapequa, New York. The group had numerous hit singles in the UK, Australia, Canada and the U.S. including &quot;Stray Cat Strut&quot;, &quot;(She's) Sexy + 17&quot;, &quot;Look at That Cadillac,&quot; &quot;I Won't Stand in Your Way&quot;, &quot;Bring it Back Again&quot;, and &quot;Rock This Town&quot;, which the Rock and Roll Hall of Fame has listed as one of the 500 most important songs in the history of rock and roll.\n\nThe group, whose style was based upon the sounds of Sun Records artists and other artists from the 1950s, were heavily influenced by Eddie Cochran, Carl Perkins, Gene Vincent and Bill Haley &amp; His Comets. The Stray Cats quickly developed a large following in the New York music scene playing at CBGB and Max's Kansas City as well as venues on Long Island. When the Cats heard a rumor that there was a revival of the 1950s Teddy Boy youth subculture in England, the band moved to the UK. They then spearheaded the nascent rockabilly revival, by blending the 1950s Sun Studio sound with modern punk musical elements. In terms of visual style the Stray Cats also blended elements of 1950 rockabilly clothes such as wearing drape jackets, brothel creepers and western shirts with punk clothes such as tight black zipper trousers and modern versions of 1950s hair styles.\n\nThe Stray Cats have reunited periodically for live performances. Setzer is still part of his 1990s swing-revival band The Brian Setzer Orchestra. Rocker continued recording and touring throughout the 1990s and on to today. His albums include Black Cat Bone and Racin' the Devil on Alligator records as well as Bulletproof.\n\nThe band was inducted into the Long Island Music Hall of Fame on October 15, 2006.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Stray_Cat_Strut&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Stray_Cat_Strut&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/jAeNPAaFd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/jAeNPAaFd&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 7000kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:03:22\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.1\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:c828d619bb6a56b80a649e10e755cfc364bed7a7","amp;dn":"Stray+Cats+-+Stray+Cat+Strut+%5BFriday+Night%2C+1981%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c828d619bb6a56b80a649e10e755cfc364bed7a7","infoHashBuffer":{"type":"Buffer","data":[200,40,214,25,187,106,86,184,10,100,158,16,231,85,207,195,100,190,215,167]},"announce":[],"urlList":[]}}