{"title":"Alex Jones Show - 2014 July 21 MO [sebaygo1]","uid":10607512,"size":66909285,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:c93f7205b801fb26ebf53a5b931af230164d776c&amp;dn=Alex+Jones+Show+-+2014+July+21+MO+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sebaygo1","files":11,"time":1405999835,"description":"\nThe Alex Jones Show\nMonday, 18 July 2014\n\n\n[sebaygo1]\n\n\nShow Description\n................\nFrom the Infowars web site :: On the Monday, July 21 edition of The Alex Jones Show, Alex breaks down the mounting tensions accelerating the globalist agenda throughout the world, as western media continues to blame Russia for a downed Malaysian airliner, despite a highly-respected establishment journalist receiving credible word that Ukrainian troops shot down the plane. \n\nAnd in the Gaza strip, where Israeli rockets have bombarded the relatively tiny patch of land killing more than 500 Palestinians. On today's show, Alex welcomes the president of the non-profit organization American Border Patrol.com, Glenn Spencer, Jr., to discuss satellite images purporting to show gaping holes in U.S. border fences where fencing never went up. \n\nJones also invites geopolitical analyst and Syrian activist Mimi Al-Laham, a/k/a Syrian Girl, to talk about how ISIS is reshaping the Middle East, and how the west uses the terror group to divide and conquer nations, bringing about order out of chaos.\n\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n\n It is my opinion that in this time it is virtually\n essential to seek information from a variety of sources, \n to listen to a spectrum of voices in order to better \n understand the &quot;big picture.&quot; A reliance solely upon\n mainstream corporate media for news and info is a \n prescription for ignorance. I try to share information\n that counters the monotone of mainstream corporate media.\n \n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents. \n\n Think for yourself!\n To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n\n !! please try some of the other shows I upload too !!\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.","torrent":{"xt":"urn:btih:c93f7205b801fb26ebf53a5b931af230164d776c","amp;dn":"Alex+Jones+Show+-+2014+July+21+MO+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c93f7205b801fb26ebf53a5b931af230164d776c","infoHashBuffer":{"type":"Buffer","data":[201,63,114,5,184,1,251,38,235,245,58,91,147,26,242,48,22,77,119,108]},"announce":[],"urlList":[]}}