{"title":"Peppermint Trolley - Peppermint Trolley","uid":10621591,"size":1230835794,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c9df41016ce94efb5e927efeca1d9ade6d6ebdf1&amp;dn=Peppermint+Trolley+-+Peppermint+Trolley&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Roman_Bornski","files":54,"time":1406172120,"description":"The Peppermint Trolley Company was formed in Redlands, California in 1966, when the band the Mark V, consisting of members Danny Faragher, Jimmy Faragher, Steve Hauser, Dave Kelliher, Brad Madson and Dick Owens, teamed up with producer Dan Dalton, who urged the band to change its name. The Peppermint Trolley Company's name was originally proposed by Jimmy Faragher and chosen by a committee of the Mark V band members. The single Lollipop Train was released (with B-side Bored to Tears) on Valiant Records.\n\nIn January 1967 the band broke up, leaving brothers Danny and Jimmy Faragher as the sole members. Recording continued and a deal was signed with Acta Records. The single She's the Kind of Girl was released in the spring of 1967. Casey Cunningham (drums) joined the band that June. The single It's a Lazy Summer Day was released the same month. Patrick McClure (guitar) joined shortly thereafter.\n\nIn the fall of 1967, Patrick McClure left the band and was replaced by Greg Tornquist (guitar). In November, recording began for Baby You Come Rollin' Across My Mind, which was subsequently released in January 1968 and peaked on the charts at #59 that summer.\n\nThe single Trust, written by Paul Williams and Roger Nichols, was released in September 1968, and the self-titled album The Peppermint Trolley Company was released that same month. While the album failed to chart, according to the liner notes of the 2009 reissue, &quot;it sold well in many markets and can be easily found 40 years later, implying good distribution and multiple pressings.&quot;\n\nIn January 1969, The Peppermint Trolley Company left Acta Records and changed its name to Bones, going on to record two albums for Signpost Records and MCA.\n\nThe Peppermint Trolley Company made many notable television appearances, including Mannix, The Beverly Hillbillies, Happening '68 and Upbeat.\n\nThe Peppermint Trolley Company is credited with arranging and singing The Brady Bunch theme song for the show's pilot. After the band left Acta Records, the vocals were rerecorded and sung by studio singers Paul Parish, John Beland and Lois Fletcher, leaving the original music intact.\n\nIn 2009, the Peppermint Trolley Company's self-titled album was re-released on Now Sounds, a division of Cherry Red. Produced for reissue by Steve Stanley, Beautiful Sun contained all 11 of the original album's tracks as well as 16 bonus tracks, including many B-sides and singles from The Mark V.\n\nThis torrent is that CD re-issue","torrent":{"xt":"urn:btih:c9df41016ce94efb5e927efeca1d9ade6d6ebdf1","amp;dn":"Peppermint+Trolley+-+Peppermint+Trolley","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9df41016ce94efb5e927efeca1d9ade6d6ebdf1","infoHashBuffer":{"type":"Buffer","data":[201,223,65,1,108,233,78,251,94,146,126,254,202,29,154,222,109,110,189,241]},"announce":[],"urlList":[]}}