{"title":"Quissa.Punjab-HEVC-720p","uid":13153942,"size":2356195385,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:cae7647c9d4cc3bbe0393e3d6fbd4559f4e5a6c4&amp;dn=Quissa.Punjab-HEVC-720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":1,"time":1452085589,"description":"DDR Presents\r\n\r\n\r\nQissa Panjab(2015)\r\n(A film by Jatinder Mauhar)\r\n\r\nPunjabi - DVD Upscale - 1280x544p (2.35:1)- 2.19 GB - x.265.AAC.Esubs - 1 Hrs:34 Min\r\n\r\nHIGH EFFICIENCY VIDEO ENCODING (HEVC)\r\n \nhttp://extraimago.com/image/HCn \nhttp://extraimago.com/image/HCj \nhttp://extraimago.com/image/HCT \nhttp://extraimago.com/image/HCN \nhttp://extraimago.com/image/HC2 \nhttp://extraimago.com/image/HCw \nhttp://extraimago.com/image/HCa \nhttp://extraimago.com/image/HC8 \nhttp://extraimago.com/image/HBf \nhttp://extraimago.com/image/HBv\r\n\r\nTech Specifications:\r\n \nhttp://extraimago.com/image/HBA\r\n\r\nSynopsis:\r\nQissa Panjab is a story of six different people, with different backgrounds, aspirations and dreams. Arjun (Preet Bhullar) is a rich young boy into substance abuse and his only ambition is getting his next fix. Deep (Aman Dhaliwal) is a basketball player who desperately needs a job and then life puts him on to a very different path. Kismet (Kul Sidhu) is a struggling dancer who aspires to be a great actress. Speed (Jagjeet Sandhu) is a petty thief who wants to migrate to Italy. Sukhjeet (Harsjot Kaur) is a young orphan struggling to finish her studies. Heera (Dheeraj Kumar) is a singer who wants to make it big in the world of music. As they lead their lives their paths cross and the unexpected happens.\r\n\r\nComments:\r\nQissa Panjab is a brroding film, where even the funny scenes are really black comedy. It is a story of youth in Panjab and and the cross currents that buffet them - not the least being the ever present use of drugs and substance abuse. The story is gripping because it is a honest one and screenplay and dialogues by Uday Pratap Singh help create the ambience.\r\n\r\nIn keeping with the mood of the film, the camera does not give us the rich green and gold fields of Panjab. Instead we get the foggy winter scenario, which is also beautiful. Some imaginative camera work gives us a glimpse of daily lives that is not often seen on celluloid.\r\n\r\nThe actors too excel. Preet Bhullar as the rich man's son who is heavily into substance abuse does very well as does Dheeraj Kumar as the folk singer, but all the main characters do superbly. Music by Gurmohi is good, with one song by the Noorani Sisters standing out.\r\n\r\nBut this review would not be complete without a word of appreciation for the Director, who uses every scene judiciously. He does not allow himself the freedom of languid sequences. The incidents are taut and almost cruelly composed into short sequences. The editors too do a great job.\r\n\r\nOverall the film is one of the best I have seen coming out of Punjab.\r\n\r\nUploader's Notes:\r\nAs is clear from the above, the entire DVD depends on , low contrast scenes. Even the outdoor scenes are of diffused sunlight and sometimes foggy conditions. I ahve made no attempts to play with the original coloring, preferring only to gently play with the luminance in order to increase the contrast and enhance details. The use of HEVC/x265 and 10-bits encoding has also helped in reducing ringing and other artifacts and allowed me to compress the rip to just 1/2 DVD size.\r\n\r\nPlease note that this rip (and all HEVC rips) will not play on any stand-alone device. You can only watch this on a computer. Be sure that you have the latest versions of VLC (2.1.5 or higher) or Media Player Classic (Ver 1.7.9) or SMPlayer (14.9.0). Earlier versions may not work\r\n\r\n\r\nMake sure it is Genuine DDR release @ ExtraTorrent.com\r\n   \nhttp://extratorrent.cc/   \nhttp://extratorrent.com/   \nhttp://extratorrent.ws/   \nhttp://etproxy.com/   \nhttp://extratorrentlive.com/   \nhttp://extratorrentonline.com/   \nhttp://etmirror.com/   \nhttp://extratorrent.works/   \nhttp://extratorrent.date/\r\n\r\n\r\nShare your Images with:\r\n   \nhttp://extraimago.com/\r\n\r\nHelp us by donating with Bitcoin: 1XeH1kKXWYbzZcFHokGiZ4d3MWW5WyXzU","torrent":{"xt":"urn:btih:cae7647c9d4cc3bbe0393e3d6fbd4559f4e5a6c4","amp;dn":"Quissa.Punjab-HEVC-720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cae7647c9d4cc3bbe0393e3d6fbd4559f4e5a6c4","infoHashBuffer":{"type":"Buffer","data":[202,231,100,124,157,76,195,187,224,57,62,61,111,189,69,89,244,229,166,196]},"announce":[],"urlList":[]}}