{"title":"Mariah Carey - All I Want For Christmas Is You  (2nafish)","uid":5201056,"size":134604804,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:cbdcde2476baca2829a65b8c249094d1cfbed356&amp;dn=Mariah+Carey+-+All+I+Want+For+Christmas+Is+You++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1260164584,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;All I Want for Christmas Is You&quot; is a song by American singer Mariah Carey and Walter Afanasieff, recorded for Carey's fifth album Merry Christmas (1994). Its protagonist declares that she does not care about Christmas presents or lights; all she wants for Christmas is to be with her lover. It is unrelated to the 1989 Christmas hit single by novelty act Vince Vance &amp; The Valiants. It was released as the album's first single in December 1994 and reached the top ten in several countries.\n\nAccording to The New Yorker, it is &quot;one of the few worthy modern additions to the holiday canon.&quot; Despite the common misconception that Carey covered this song, the track is an original song written by Carey and Walter Afanasieff. It has been covered by singers such as John Mayer, Shania Twain, Samantha Mumba, bands such as My Chemical Romance, girl group The Cheetah Girls, and Miley Cyrus (Hannah Montana). It was performed by Olivia Olson in the film Love Actually (2003). By late 2006, it had become the best-selling holiday ringtone of all time in the U.S. &quot;All I Want for Christmas Is You&quot; is the best-selling contemporary holiday ringtone in the U.S. for third consecutive year with cumulative sales topping 1.8 million, and is the first holiday song to sell one million digital downloads in the U.S.\n\nA video was created for the remix, but it does not feature Carey or the rappers and is animated instead. The style of the animation is based on a scene in the video for Carey's &quot;Heartbreaker&quot; (1999). Besides cartoon cameo appearances by Carey, Jermaine Dupri, and Lil' Bow Wow, the video also features cameos from Luis Miguel (Carey's boyfriend at the time), her dog (Jack), and Santa Claus. The music video director is credited as Kris Kringle.\n\nMerry Christmas is a holiday album by American singer Mariah Carey. Released in the United States on November 1, 1994 by Columbia Records, it is a holiday album featuring both cover versions and original material.\n\nIt was released at what was the peak of the initial stretch of Carey's career, between Music Box (1993) and Daydream (1995). It subsequently went on to become the best-selling Christmas albums of all time, selling 11 million copies worldwide. It was certified 5x platinum by the RIAA for shipments of 5 million copies in the U.S. This album was re-released in 2005 in DualDisc format with bonus tracks and music videos.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:cbdcde2476baca2829a65b8c249094d1cfbed356","amp;dn":"Mariah+Carey+-+All+I+Want+For+Christmas+Is+You++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbdcde2476baca2829a65b8c249094d1cfbed356","infoHashBuffer":{"type":"Buffer","data":[203,220,222,36,118,186,202,40,41,166,91,140,36,144,148,209,207,190,211,86]},"announce":[],"urlList":[]}}