{"title":"State-Sponsored Terrorism, Crimes, and Lies - Collection 31 (Rus","uid":13247639,"size":156908991,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ccd3cbbfd0096ea7cbd03f4147bcc8db1519438e&amp;dn=State-Sponsored+Terrorism%2C+Crimes%2C+and+Lies+-+Collection+31+%28Rus&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moman73","files":35,"time":1453133203,"description":"State-Sponsored Terrorism, Crimes, and Lies - Collection 31 (Russia 7):\r\n\r\nWe have 35 titles here:\r\n\r\n-  Amnesty Int. - 'Civilian Objects Were Undamaged'; Russia's Statements on its Attacks in Syria Unmasked (2015)\r\n\r\n-  Amnesty Int. - Civilians in the Aftermath of War; the Georgia-Russia Conflict One Year On (2009)\r\n\r\n-  Aron (Ed.) - Putin's Russia; How It Rose, How It is Maintained, and How It Might End (2015)\r\n\r\n-  Bobic - Words or Swords; Russia's Strategies in Handling its Territorial Disputes (2013)\r\n\r\n-  Chechnya; the Inner Abroad, International Crisis Group (June 2015)\r\n\r\n-  Covington - Putin's Choice for Russia, Belfer Center, Harvard Kennedy School (Aug 2015)\r\n\r\n-  Czuperski et al - Hiding in Plain Sight; Putin's War in Ukraine, Atlantic Council (2015)\r\n\r\n-  Daalder et al - Preserving Ukraine's Independence, Resisting Russian Aggression; What the United States and NATO Must Do, Atlantic Council (2015)\r\n\r\n-  Dowling - Russia at War; From the Mongol Conquest to Afghanistan, Chechnya, and Beyond (2015)\r\n\r\n-  Ferrari (Ed.) - Beyond Ukraine; EU and Russia in Search of a New Relation (2015)\r\n\r\n-  Figes - The Crimean War; a History (2010)\r\n\r\n-  Foxall - Putin's Peninsula; Crimea's Annexation and Deterioration, Russia Studies Centre (March 2015)\r\n\r\n-  Getty &amp; Manning (Eds.) - Stalinist Terror; New Perspectives (1993)\r\n\r\n-  Giles et al - The Russian Challenge, Chatham House Report (June 2015)\r\n\r\n-  Griffin et al (Eds.) - Fascism Past and Present, West and East; an International Debate on Concepts and Cases.. (2014)\r\n\r\n-  HRW - Barriers Everywhere; Lack of Accessibility for People with Disabilities in Russia (2013)\r\n\r\n-  HRW - Russia-Syria, Extensive Recent Use of Cluster Munitions; Indiscriminate Attacks Despite Syria's Written Guarantees (Dec 2015)\r\n\r\n-  Kasapoglu - Russia in Foreign Skies; Assessing Russian Air Operations in Syria and Violations of Turkish Airspace, EDAM (2015)\r\n\r\n-  Khlevniuk - Stalin; New Biography of a Dictator (2015)\r\n\r\n-  Klymenko - Human Rights Abuses in Russian-Occupied Crimea, Atlantic Council (2015)\r\n\r\n-  Kremlin's Black Book; Russian War Against Ukraine (Feb 2015)\r\n\r\n-  Kuzio - Ukraine; Democratization, Corruption, and the New Russian Imperialism (2015)\r\n\r\n-  Laruelle - The 'Russian World'; Russia's Soft Power and Geopolitical Imagination (2015)\r\n\r\n-  McNabb - Vladimir Putin and Russia's Imperial Revival (2016)\r\n\r\n-  Mohseni (Ed.) - Disrupting the Chessboard; Perspectives on the Russian Intervention in Syria, Belfer Center, Harvard Kennedy School (Oct 2015)\r\n\r\n-  Oushakine - The Patriotism of Despair; Nation, War, and Loss in Russia (2009)\r\n\r\n-  Pacepa &amp; Rychlak - Disinformation (2013)\r\n\r\n-  per Concordiam - Rolling Backward; Russia's Troubled Relations with its Neighbors, Vol. 5, Issue 4 (2014)\r\n\r\n-  Rousso (Ed.) - Stalinism and Nazism; History and Memory Compared (1999)\r\n\r\n-  Slaveski - The Soviet Occupation of Germany; Hunger, Mass Violence, and the Struggle for Peace, 1945-1947 (2013)\r\n\r\n-  Stanton - Russia, Sanctions and the Way Forward; Balancing Assertiveness with Engagement, Bertlsmann Foundation (2015)\r\n\r\n-  Stephenson - Gangs of Russia; From the Streets to the Corridors of Power (2015)\r\n\r\n-  Van Metre et al - The Ukraine-Russia Conflict; Signals and Scenarios for the Broader Region, U.S. Inst. of Peace (2015)\r\n\r\n-  Villahermosa - Putin as Warlord, Modern War (Mar-Apr 2015)\r\n\r\n-  Yashin &amp; Shorina (Eds.) - Putin. War; an Independent Expert Report, Based on Materials from Boris Nemtsov (2015)","torrent":{"xt":"urn:btih:ccd3cbbfd0096ea7cbd03f4147bcc8db1519438e","amp;dn":"State-Sponsored+Terrorism%2C+Crimes%2C+and+Lies+-+Collection+31+%28Rus","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccd3cbbfd0096ea7cbd03f4147bcc8db1519438e","infoHashBuffer":{"type":"Buffer","data":[204,211,203,191,208,9,110,167,203,208,63,65,71,188,200,219,21,25,67,142]},"announce":[],"urlList":[]}}