{"title":"Iceni.Technology.InfixPro.PDF.Editor.v4.04.Cracked-EAT","uid":5155999,"size":23434319,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ced5f2db8c37f7591b6d0245eebae54c906f5cb2&amp;dn=Iceni.Technology.InfixPro.PDF.Editor.v4.04.Cracked-EAT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aoloffline","files":-1,"time":1257813146,"description":"The smartest PDF editor on the planet!\nEdit text the way you do in a word processor - using tabs, alignment, search &amp; replace and spell check. Annotate, crop, import graphics and more... \nInfix PDF Editor Made Simple. For the first time it is now possible to edit text in any PDF document using tools familiar to anyone who uses a word processor. Easily edit the text in your PDFs, reflow and re-justify text, change fonts, colours and sizes. Resize, reposition and change images as you would in a professional publishing application.\n\nInfix PDF Editor is a tool that allows you edit PDF and text documents.To ensure your edited documents look their best, Infix includes the kind of professional-quality hyphenation and justification (H and J) found in packages such as Adobe InDesign and Quark Express.\n\nCoupled with fine control over letter, word and line spacing, you can be confident that your edits will be undetectable. Infix is the quality PDF Editor giving unparalleled ease of use combined with high quality text formatting.On top of its advanced text-handling, Infix offers all of the standard editing facilities you would expect such as page cropping, annotation, cut &amp; paste between PDFs, graphics manipulation and more.\nFeatures:\n\nEdit the text in your PDFs like a word processor using rulers, tabs, search and replace and spell checking.\n- Easily edit the text in any PDF\n- Works just like a Word Processor\n- Add &amp; replace photos\n- Copy/paste images, tables and drawings from other PDFs\n- Spell-check in five languages\n- Full search &amp; replace\n- Use tabs, margins and indents ","torrent":{"xt":"urn:btih:ced5f2db8c37f7591b6d0245eebae54c906f5cb2","amp;dn":"Iceni.Technology.InfixPro.PDF.Editor.v4.04.Cracked-EAT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ced5f2db8c37f7591b6d0245eebae54c906f5cb2","infoHashBuffer":{"type":"Buffer","data":[206,213,242,219,140,55,247,89,27,109,2,69,238,186,229,76,144,111,92,178]},"announce":[],"urlList":[]}}