{"title":"Daniele Luttazzi - Satyricon - Puntata 06 - RaiDue 2001","uid":4598170,"size":747077238,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d0bf5549c9aff08655572b09f75c648878766bc2&amp;dn=Daniele+Luttazzi+-+Satyricon+-+Puntata+06+-+RaiDue+2001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tracert8899","files":1,"time":1230087957,"description":"Satyricon ÃƒÂ¨ stata una trasmissione televisiva satirica, scritta e interpretata da Daniele Luttazzi, con la regia di Franza di Rosa. ÃƒË† andato in onda con cadenza settimanale (salvo sospensione-censura di una puntata) in seconda serata su Rai Due da gennaio ad aprile 2001.\n\nUno degli episodi che ha fatto piÃƒÂ¹ discutere nella storia della Tv italiana, ÃƒÂ¨ stata l'intervista all'allora quasi sconosciuto giornalista Marco Travaglio.\n\nQuesti aveva da circa un mese pubblicato il libro L'odore dei soldi, scritto a quattro mani con Elio Veltri, in cui si riferiva di ciÃƒÂ² che stava emergendo in quel momento in alcuni processi a carico di Marcello Dell'Utri (condannato poi in primo grado a nove anni per concorso esterno in associazione mafiosa), e che riguardava anche l'origine delle fortune di Silvio Berlusconi, il candidato premier del centrodestra alle elezioni che si sarebbero tenute da li a due mesi. Riguardo al diritto di replica, Silvio Berlusconi non accettÃƒÂ² l'invito di Luttazzi di comparire in trasmissione (invito presentato mesi prima dell'inizio del programma).\n\nDopo le polemiche seguite all'intervista di Luttazzi a Marco Travaglio su Berlusconi e Dell'Utri, il programma viene sospeso per una settimana. Nel 2002, diventato presidente del Consiglio, Berlusconi metterÃƒÂ  Luttazzi all'indice insieme con Enzo Biagi e Michele Santoro. Da allora fino al 2007 Luttazzi non ha piÃƒÂ¹ potuto fare programmi tv.\n\n\nSCARICATE ANCHE:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4402793&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4402793&lt;/a&gt;","torrent":{"xt":"urn:btih:d0bf5549c9aff08655572b09f75c648878766bc2","amp;dn":"Daniele+Luttazzi+-+Satyricon+-+Puntata+06+-+RaiDue+2001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0bf5549c9aff08655572b09f75c648878766bc2","infoHashBuffer":{"type":"Buffer","data":[208,191,85,73,201,175,240,134,85,87,43,9,247,92,100,136,120,118,107,194]},"announce":[],"urlList":[]}}