{"title":"Forgiving Ararat - Gita Nazareth.mobi","uid":9141658,"size":479173,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d0f30abf43c32f5bf7e81523e2a50cc7dce9edb6&amp;dn=Forgiving+Ararat+-+Gita+Nazareth.mobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1383520106,"description":"THE #1 BESTSELLER IN HEAVEN...AVAILABLE FOR THE FIRST TIME ON EARTH. &quot;Think Alice Sebold ('The Lovely Bones') meets William Young ('The Shack') and John Grisham ('The Firm')...in the afterlife.&quot; Brek Cuttler, a young lawyer, new mother, and wife of a popular television news reporter, dies unexpectedly and, arriving in heaven, learns she has been chosen to join the elite lawyers who defend souls at the Final Judgment. Yet Brek longs for her lost life, and the cause of her death remains a mystery. Searching for answers, Brek attempts to re-create the world she once knew and visits her family in their dreams; but it is her first client in heaven, a young convict, who holds the secret-a shocking crime long repressed. Guided by her mentor, Luas, a lawyer who has been prosecuting souls for thousands of years, Brek embarks on a quest traversing heaven and earth to bring her killer to justice, uncovering an interlocking past that places her own soul in jeopardy. Entering the courtroom to face her killer at the Final Judgment, Brek must make a momentous choice that will alter her eternity. POSTHUMOUS PRAISE FOR FORGIVING ARARAT: &quot;This glorious, triumphant work leads its readers from the wrathful lands of the east...and back to the Garden of Eden.&quot; -John Steinbeck, author of Grapes of Wrath and East of Eden. &quot;With mythical prose at times approaching verse, Forgiving Ararat works a miracle, bridging the chasm between life and death.&quot; -Emily Dickinson, author of Poems. &quot;At the center of Forgiving Ararat is the Trial each of us must one day face-and the profound metamorphosis each of us must undergo to win.&quot; -Franz Kafka, author of The Trial and The Metamorphosis. &quot;This book is the next 'Lovely Bones '&quot; -Anonymous Recently Departed Reader \nGenre: Fiction, Contemporary ","torrent":{"xt":"urn:btih:d0f30abf43c32f5bf7e81523e2a50cc7dce9edb6","amp;dn":"Forgiving+Ararat+-+Gita+Nazareth.mobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0f30abf43c32f5bf7e81523e2a50cc7dce9edb6","infoHashBuffer":{"type":"Buffer","data":[208,243,10,191,67,195,47,91,247,232,21,35,226,165,12,199,220,233,237,182]},"announce":[],"urlList":[]}}