{"title":"The Kossoy Sisters and Erik Darling - Bowling Green 1956","uid":6911382,"size":41271692,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d1e8b8d63adaa992cbef586d82e85ec5bd1b6645&amp;dn=The+Kossoy+Sisters+and+Erik+Darling+-+Bowling+Green+1956&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nathan81706","files":12,"time":1324832373,"description":"The Kossoy Sisters, Irene Saletan and Ellen Christenson, are an American folk and old time music act based around the identical twin sisters Irene Saletan and Ellen Christenson.[1] In their music, Irene sings mezzo soprano vocal, and Ellen supplies soprano harmony, with Irene on guitar and Ellen playing the 5-string banjo in a traditional up-picking technique. Their performances are notable examples of close harmonies singing. They began performing professionally in their mid teens and are esteemed as a significant part of the popular folk music movement that started in the mid 1950s.\n\nThe sisters were born on May 11, 1938 in New York City, USA. The twins began singing together at about the age of six, in imitation of harmonies created in the home by their mother and aunt. At fifteen they attended a summer camp at which Pete Seeger and other well known folk singers often performed, and they developed a lifelong attachment to the genre. They quickly discovered the bustling folk music scene in the Greenwich Village section of New York City and mingled with the people who congregated in Washington Square Park.[2]\n\nWhen they were seventeen, they recorded the album Bowling Green which features the sisters' close harmonies and accompaniment by Erik Darling.[3] The duo were introduced to a new audience when their version of &quot;I'll Fly Away&quot; from this album was used in the film O Brother, Where Art Thou?.","torrent":{"xt":"urn:btih:d1e8b8d63adaa992cbef586d82e85ec5bd1b6645","amp;dn":"The+Kossoy+Sisters+and+Erik+Darling+-+Bowling+Green+1956","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1e8b8d63adaa992cbef586d82e85ec5bd1b6645","infoHashBuffer":{"type":"Buffer","data":[209,232,184,214,58,218,169,146,203,239,88,109,130,232,94,197,189,27,102,69]},"announce":[],"urlList":[]}}