{"title":"Gary Taylor - Castration. An Abbreviated History of Western Manh","uid":10429081,"size":1194493,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d1f1b8122d786c11d6d440c716dbff186ff13e45&amp;dn=Gary+Taylor+-+Castration.+An+Abbreviated+History+of+Western+Manh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1403783000,"description":"Description\nProduct Details\nBook Title: Castration: An Abbreviated History of Western Manhood\t\nBook Author: Gary Taylor (Author)\nHardcover: 304 pages\nPublisher: Routledge; First Edition edition (October 27, 2000)\nLanguage: English\nISBN-10: 0415927854\nISBN-13: 978-0415927857\n\n===================================================================================\nBook Description\nPublication Date: October 27, 2000 | ISBN-10: 0415927854 | ISBN-13: 978-0415927857 | Edition: First Edition\nCastration is a lively history of the meaning, function, and act of castration from its place in the early church to its secular reinvention in the Renaissance as a spiritualized form of masculinity in its 20th century position at the core of psychoanalysis.\n\n===================================================================================\nEditorial Review\nFrom Publishers Weekly\nEarly in this absorbing treatise on the changing nature of manhood in Western culture, English professor Taylor remarks, &quot;This is a specter that has haunted men for centuries: the fear that manhood will become, or has already become, obsolete, superfluous, ridiculous, at best quaint, at worst disgusting.&quot; Nowhere, he contends, is this specter more obvious than in the cringing reaction most men have to the word &quot;castration.&quot; In this book, Taylor uses an imaginative analysis of the history and purposes of castration to examine the cultural construct of masculinity specifically in relation to reproduction. Equally comfortable discussing the implications of pop singer Tori Amos's lyrics as he is reinterpreting the antisexual writings of church fathers Justin Martyr, Clement and Tertullian or Margaret Atwood's The Handmaid's Tale, Taylor gracefully guides the reader through carefully constructed arguments that go so far as to declare that, in some times and cultures, being a eunuch is a social advantage. In a feat of bravura literary criticism, he uses a detailed explication of Thomas Middleton's obscure but important 1624 play A Game of Chess (a metaphysical commentary on the Reformation) as the centerpiece of his many-pronged cultural investigation, a move that is both audacious and illuminating. But while Taylor's expertise as a Renaissance scholar shines here, he shrewdly and subtly links the play's concerns to such varied historical events as the history of psychoanalysis and sexual racism toward blacks and Jews. Though of primary interest to literary scholars and historians of sexuality, this work will also reward sophisticated general readers with its wit (including a cover depicting the upper torso and wincing head of a Greek male statue) and insight. (Nov. 30)\n\n===================================================================================\nReviews\n...the good news is that Taylor is riveting on Middleton. ...Taylor knows his stuff... -- Rowan Pelling, New Statesman\n\nThe journey is entertaining and informative... -- Rowan Pelling, New Statesman\n\n...Taylor seems as cheerily loony as his title. His prose style springs from the groovy prof school of writing, so Abelard and Foucault are quoted alongside Christina Aguilera and Tori Amos... -- Rowan Pelling, New Statesman\n\nNot for purists; great fun for anyone else. -- Choice, M.J. Emery, Cottey College\n\nThis dense, scholarly yet thoroughly entertaining book examines the uses of castration... along with thousands of years' worth of popular attitudes about the male genitals. Taylor posits that understanding what it means to be biologically unmanned is an excellent way to understand what it means to be a man. You don't need to be enthusiastic about this thesis -- or even to be male -- to find Castration terrific reading. -- Salon\n\nA passionate, provocative history of ideas about male sexuality--and the best account of castration you're ever likely to read. -- Maggie Paley, author of The Book of the Penis\n\nGary Taylor's Castration is learned, provocative, and surprisingly persuasive. It is entirely characteristic of its author, at once polemical and reasonable, historically detailedand wildly imaginative. I found it endlessly informative and compulsively readable. -- Stephen Orgel\n\nTaylor's writing is academic in the best sense -- well-researched and unapologetically informed (and opinionated) about both high and popular culture. This isn't USA Today-style speculation about trends and people. Taylor's ideas are so well-reasoned that the reader is gladly seduced into following each argument as far as it goes. Taylor's uxtaposition of history, culture, and psychology, along with his comfort about sexuality, breaks new ground here. The reader's relationship to genitalia -- his/her own and others' -- is forever changed after reading this excellent book. By examining sexuality in its historical context, crucial for understanding other civilizations, he makes the arbitrariness of our own erotic beliefs startlingly visible. - Marty Klein, Ph.D Libido: the Journal of Sex and Sensibility.\n\nTaylor has written a thoroughly engaging and witty account of the history and misconceptions of castration... Castration provides a useful, original, lively, and long overdue look at one of mankind;s most essential physical and cultural components. -Virginia Quarterly Review.\n\n===================================================================================\nAbout the Author\nGary Taylor is Professor of English and Director of the Hudson Strode Program in Renaissance Studies at the University of Alabama. His books include Cultural Selection: Why Some Achievements Stand the Test of Time and Others Don't and Reinventing Shakespeare: A Cultural History from the Restoration to the Present. He is the general editor of the Oxford Shakespeare.\n===================================================================================","torrent":{"xt":"urn:btih:d1f1b8122d786c11d6d440c716dbff186ff13e45","amp;dn":"Gary+Taylor+-+Castration.+An+Abbreviated+History+of+Western+Manh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1f1b8122d786c11d6d440c716dbff186ff13e45","infoHashBuffer":{"type":"Buffer","data":[209,241,184,18,45,120,108,17,214,212,64,199,22,219,255,24,111,241,62,69]},"announce":[],"urlList":[]}}