{"title":"Red Hot Chili Peppers-Live In Hyde Park(2004) 320 vtwin88cube","uid":5681055,"size":304808304,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:d2eec908a9820f05b076b16490db34afa7a8cdea&amp;dn=Red+Hot+Chili+Peppers-Live+In+Hyde+Park%282004%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"matcarpes","files":28,"time":1278829404,"description":"Red Hot Chili Peppers - Live In Hyde Park (2004)\nConstant bit rate 320.\nCleanly tagged with enhanced 600x600 cover art.\n\nDisc 1\n1. Intro\n2. Can't Stop\n3. Around The World\n4. Scar Tissue\n5. By The Way\n6. Fortune Faded\n7. I Feel Love\n8. Otherside\n9. Easily\n10. Universally Speaking\n11. Get On Top\n12. Brandy\n13. Don't Forget Me\n14. Rolling Sly Stone\n\nDisc 2\n1. Throw Away Your Television\n2. Leverage Of Space\n3. Purple Stain\n4. Zephyr Song\n5. Californication\n6. Right On Time\n7. Parallel Universe\n8. Drum Homage Medley\n9. Under The Bridge\n10. Black Cross\n11. Flea's Trumpet By Treated By John\n12. Give It Away \n\n\nTaken from their mammoth shows in June 2004, Live in Hyde Park captures the Red Hot Chili Peppers at their very best. The scene was set by changeable weather, the Godfather of Soul, James Brown, and Chicks on Speed being unfairly jeered off the stage.\n\nHeralded by a tense intro, the funky, fists-in-the-air sound of &quot;Can't Stop&quot; cutting through the ether is one of those moments that make live albums so compelling for those who were there and those who weren't. The Peppers go on to play through 2 CDs' worth of favorites from By the Way and Californication plus newer material such as &quot;Fortune Faded,&quot; &quot;Rolling Sly Stone,&quot; and &quot;Leverage of Space&quot;.\n\nIt's difficult to pick highlights, as the level of musicianship from the four was high as ever but unexpected, quirky numbers such as John and Flea's rendition of Donna Summer's &quot;I Feel Love&quot; stand out as memorable euphoric moments. Sadly, the only pre-Californication songs were old favorites &quot;Under the Bridge&quot; and &quot;Give it Away,&quot; both sounding fresh despite being 13 years old.\n\nLive in Hyde Park is definitely a worthy addition to any record collection. It's amazing that a band in their third decade of success can release their full debut live album, but the Chili Peppers prove that they've still got it (now, more than ever) and will be around for a very long time to come. --David Trueman --This text refers to an out of print or unavailable edition of this title.\nProduct Description\nThe Funky Foursome from LA crossed the pond to record this double live disc to capitalize on the vast reverence accorded them in continental Europe. &quot;Live In Hyde Park&quot; is a distillation of the three shows performed in London from June 2004. The setlist includes three previously unreleased songs: &quot;Rolling Sly Stone&quot;, &quot;Leverage Of Space&quot; and &quot;Mini-Epic&quot; as well as covers of songs originally by Donna Summer, Looking Glass and 45 Grave.\n\n\nThis is classic RHCP. If you like it, (you will trust me)seed it!\n\nThanks for choosing my torrents!","torrent":{"xt":"urn:btih:d2eec908a9820f05b076b16490db34afa7a8cdea","amp;dn":"Red+Hot+Chili+Peppers-Live+In+Hyde+Park%282004%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2eec908a9820f05b076b16490db34afa7a8cdea","infoHashBuffer":{"type":"Buffer","data":[210,238,201,8,169,130,15,5,176,118,177,100,144,219,52,175,167,168,205,234]},"announce":[],"urlList":[]}}