{"title":"Broken Hope / American Death Metal","uid":9233302,"size":1740690587,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d374b5318f5abe7b8693d2db3d62c816a37a5be8&amp;dn=Broken+Hope+%2F+American+Death+Metal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sidmal","files":-1,"time":1385080627,"description":"4om wiki:\nBroken Hope is an American death metal band from Chicago, Illinois\n\nBroken Hope was founded in 1988. They were known as an accomplished mid-paced style death metal band with low-pitched growling vocals. As a band, they spanned roughly twelve years, recording five albums between 1991 and 1999.\n\nThe early lineup of Broken Hope was Joe Ptacek (vocals), Jeremy Wagner (rhythm guitar), Brian Griffin (lead guitar), and Ryan Stanek (drums). They scored a deal with the then-fledging Grindcore/RedLight Label and recorded their debut album, Swamped in Gore.[1]\n\nFollowing the release, Metal Blade Records signed the band, who released their second album, The Bowels of Repugnance, in 1993.[1] The band's third album, 1995's Repulsive Conception, reached CMJ New Music Monthly's Metal Top 25 chart,[2] as did the follow-up, 1997's Loathing,[3] an album which explored topics such as political domination, necrophilia, and safe sex.[4]\n\nThe band moved to newly formed indie Martyr Records for their fifth album, Grotesque Blessings, released in 1999.[1] Rumors of the band's demise circulated at this time,This also marks the last album Joe Ptacek was ever on[5] and by April 2002, Broken Hope disbanded.[6]\n\nIn a 2007 interview, Wagner explained that several factors, including band dysfunction and a lack of support in Europe from Metal Blade, contributed to the split.[7] Wagner added that the band members had met &quot;face to face&quot; for the first time in five years and discussed a possible reunion.[7]\n\nOn January 20, 2010, vocalist Joe Ptacek committed suicide.[8][9] He was 37 years old.\n\nThe band reunited in 2012 with Shaun Glass- Bass Jeremy Wagner Guitars and new vocalist Damian Leski from Gorgasm, playing a North American tour with Obituary, Decrepit Birth, Jungle Rot, and Encrust\n\n\nAlbums\nSwamped in Gore (1991)\nThe Bowels of Repugnance (1993)\nRepulsive Conception (1995)\nLoathing (1997)\nGrotesque Blessings (1999)\nOmen of Disease (2013)\n","torrent":{"xt":"urn:btih:d374b5318f5abe7b8693d2db3d62c816a37a5be8","amp;dn":"Broken+Hope+%2F+American+Death+Metal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d374b5318f5abe7b8693d2db3d62c816a37a5be8","infoHashBuffer":{"type":"Buffer","data":[211,116,181,49,143,90,190,123,134,147,210,219,61,98,200,22,163,122,91,232]},"announce":[],"urlList":[]}}