{"title":"Arnold - Hillside [1998]","uid":9744279,"size":361418970,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d3c65b0a825ccdfc6abbf060d75055e3df95dadf&amp;dn=Arnold+-+Hillside+%5B1998%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1394559682,"description":"Review by Stewart Mason  [-]\nPart of the new mini-trend of rural British psychedelia that spawned Gorky's Zygotic Mynci, the Beta Band, and Gomez, Arnold is a young trio from a small village in Kent whose full-length debut, 1998's Hillside, positively trounces the demo-quality EP that had preceded it. From the first notes of the ghostly opener &quot;Fleas Don't Fly,&quot; Arnold's intriguing mixture of Floydian atmospherics, Robert Wyatt-style whimsy and post-post-punk stylistic diversity makes Hillside one of the most ambitious debut albums of its year. These slowly unfolding, mostly minor-key songs blend acoustic guitars, vintage synths, tape effects, and found sound into a compelling form of lo-fi psych pop. A couple of tracks have an unfortunate element of weird for weird's sake, especially the expendable and overlong spoken word interlude &quot;Rabbit.&quot; Most of the time, though, singing drummer Phil Morris' breathy voice and Mark Saxby's textured guitar raise the tunes beyond the merely clever or trippy. Songs like the mournful &quot;Windsor Park,&quot; which is slowly overwhelmed by a rising tide of white noise, or the harsher &quot;Ira Jones Goes to the Country&quot; recall the fuzzy desperation of Big Star's Sister Lovers, but on playfully experimental tracks like the near-montage &quot;Rubber Duck (Parts One, Two, and Three)&quot; and the Teenage Fanclub-like raver &quot;Moroccan Roll (Part Two),&quot; Arnold show an endearing sense of humor that keeps Hillside from sounding mopey. (4.5/5)","torrent":{"xt":"urn:btih:d3c65b0a825ccdfc6abbf060d75055e3df95dadf","amp;dn":"Arnold+-+Hillside+%5B1998%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3c65b0a825ccdfc6abbf060d75055e3df95dadf","infoHashBuffer":{"type":"Buffer","data":[211,198,91,10,130,92,205,252,106,187,240,96,215,80,85,227,223,149,218,223]},"announce":[],"urlList":[]}}