{"title":"C. J. Cherryh - Defender","uid":11469472,"size":197299657,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d4a97a98af0b8ad88e9369148ebf9757b4d83e4f&amp;dn=C.+J.+Cherryh+-+Defender&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybotage","files":1,"time":1416067240,"description":"Nearly ten years after the unexpected return of the starship Phoenix, the alien atevi have three functioning space shuttles, and teams of atevi engineers labor in orbit to renovate the space station. But these monumental advances not only add a dangerously powerful third party to an already precarious diplomatic situation, but rouse pro- and anti=s[ace factions in atevi society to incendiary levels. To help negotiate these treacherous diplomatic waters, Tabini-aiji, the powerful head of the atevi's Western Association, has sent the only human he fully trusts into space: his own paidhi, Bren Cameron.\n\nHowever, the threat of possible invasion by hostile aliens who attacked Phoenix's station in a far-off sector of space hangs over them all. And when one of the senior captains of the Phoenix confesses that this station was not completely destroyed, as had been previously thought, the crew mutinies. How can Bren hope to mediate on a station overcome by a rebellious crew intent on taking the Phoenix on a rescue mission back into hostile alien territory?\n\nThe long-running Foreigner series can also be enjoyed by more casual genre readers in sub-trilogy installments. Defender is the 5th Foreigner book. It is also the 2nd book in the second subtrilogy","torrent":{"xt":"urn:btih:d4a97a98af0b8ad88e9369148ebf9757b4d83e4f","amp;dn":"C.+J.+Cherryh+-+Defender","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4a97a98af0b8ad88e9369148ebf9757b4d83e4f","infoHashBuffer":{"type":"Buffer","data":[212,169,122,152,175,11,138,216,142,147,105,20,142,191,151,87,180,216,62,79]},"announce":[],"urlList":[]}}