{"title":"The Myth of the Six Million","uid":11715740,"size":1072293,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d5511da1aecc4aa6182a2ff79b7a748778d1d016&amp;dn=The+Myth+of+the+Six+Million&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1424566322,"description":"Since the day of its publication, The Myth of the Six Million has generated controversy and heated debate. Prof. David L. Hoggan, the author of this work-and a history professor at Stanford University at the time it was written-at first refused to attach his name to the manuscript for fear of academic retribution. The original text was therefore first published under &quot;Anonymous.&quot; Other publishers deemed the book &quot;too hot to handle&quot; and refused even to bring it to press. What is it that is so &quot;dangerous&quot; about this little book? Why has it been suppressed again and again during its short lifetime? And why is it now so important to get the information contained herein out to as many citizens as possible? For answers, we suggest you take a look inside. But understand, one of the gravest crimes any historian can commit in our 21st century thought gulag is that of &quot;holocaust denial.&quot; In cases where the defendant is accused of this crime, according to judges and prosecutors, &quot;truth is no defense.&quot; So beware: This book may turn you into a &quot;holocaust denier,&quot; as you witness the &quot;myth of the six million&quot; dragged out into the light of honest history. Includes a never-beforepublished insider's history of how TBR publisher Willis A. Carto first came across this &quot;banned&quot; manuscript back in the 1960s","torrent":{"xt":"urn:btih:d5511da1aecc4aa6182a2ff79b7a748778d1d016","amp;dn":"The+Myth+of+the+Six+Million","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5511da1aecc4aa6182a2ff79b7a748778d1d016","infoHashBuffer":{"type":"Buffer","data":[213,81,29,161,174,204,74,166,24,42,47,247,155,122,116,135,120,209,208,22]},"announce":[],"urlList":[]}}