{"title":"Worlds Finest v1 (002 - 323 + World's Best 001) (1941 - 1986)","uid":11167382,"size":10616377331,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d6644721e9c0cdcacef22aafb100fb88b01bd2f7&amp;dn=Worlds+Finest+v1+%28002+-+323+%2B+World%27s+Best+001%29+%281941+-+1986%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"nemesis43","files":323,"time":1412647190,"description":"Worlds Finest v1 (002 - 323 + World's Best 001) (1941 - 1986)\n\n\nNumbering continued from World's Best Comics #1\n\nEarly issues are published by World's Best Comics, National Comics, and National Periodical Publications. From #2 onwards the title of the magazine became World's Finest Comics and featured Batman and Superman every issue - although they did not have their first team up until issue # 71. As well as Superman and Batman, the early issues of World's Finest also featured many other heroes from the Golden Age, including, Sandman, Hop Harrigan, Dan the Dyna-mite, Crimson Avenger, Star Spangled Kid, Aquaman, Zatara, Tomahawk, Boy Commandos and Green Arrow. From issue #71 onwards, the lead story would always feature a team up between Superman &amp; Batman and this remained the case through to issue #198, which saw the man of steel in a super speed race with the Flash to try and establish just who is the fastest man alive.\n\nDuring their long unbroken stint of team ups, the World's Finest heroes (as they became known to regular readers of the magazine) would often be joined by Robin Jimmy Olsen, and less frequently by Batwoman, Supergirl, both versions of the Silver Age Batgirl as they battled the likes of Luthor, Joker, Brainiac, Penguin, etc. Carrying the byline &quot;Your two favourite heroes in one magazine&quot; the popularity of World's Finest was no doubt boosted by the 60's Batman TV show (as were other DC titles at the time).\n\nWith issue # 198, DC began the experiment of teaming Superman with heroes other than Batman. Despite the novelty and freedom this allowed the creators, and the fact that this meant the likes of Robin, Diana Prince, Teen Titans and the Atom got extra exposure, the experiment clearly didn't go down too well with the readership of the book, and following team ups with the Caped Crusader in #207 #211, the World's Finest duo resumed their regular team-ups from # 215 onwards.\n\nThe book introduced us to the &quot;Sons of Superman Batman&quot; in #221, an imaginary future, where the offspring of the World's Finest Heroes began to learn how to pick the mantle of their famous fathers. This feature proved popular with the readership as the Super Sons made fairly frequent appearances for a while. All good things come to an end, however, and with issue #323, dated Jan 1986, the series came to a close. During their time in World's Finest, Superman and Batman were always depicted as the best of friends, always seeing eye to eye and never having a disagreement. In the post-crisis, post World's Finest world, their relationship has sometimes seemed strained (especially in the John Byrne time on Superman) and in other ways it has clearly evolved. &quot;World's Finest&quot; may have belonged to another era, but it formed the basis of the friendship that Superman and Batman now share in the magazine of the same name.","torrent":{"xt":"urn:btih:d6644721e9c0cdcacef22aafb100fb88b01bd2f7","amp;dn":"Worlds+Finest+v1+%28002+-+323+%2B+World%27s+Best+001%29+%281941+-+1986%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6644721e9c0cdcacef22aafb100fb88b01bd2f7","infoHashBuffer":{"type":"Buffer","data":[214,100,71,33,233,192,205,202,206,242,42,175,177,0,251,136,176,27,210,247]},"announce":[],"urlList":[]}}