{"title":"Michael Hedges In Concert,Somerville 11-12-1997","uid":3681689,"size":1267518896,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d667283dd1f48d083e420e1704254b36686e6df9&amp;dn=Michael+Hedges+In+Concert%2CSomerville+11-12-1997&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"stinkhole","files":2,"time":1178413378,"description":"Michael Hedges is perhaps the most innovative and kinetic acoustic guitarist in the history of the instrument, but he is first and foremost a composer who plays guitar, not a guitarist who plays compositions. His innovative techniques are a means to an end resulting from the demands of his compositions rather than conspicuous attempts at virtuosity. Michael?s embodiment of contemporary composer, innovative guitarist, and flamboyant performer all in one has led to an eclectic style, which consistently defies categorization.\nMichael Hedges was killed in an automobile crash in November 1997. He was 43. Hedges died in a one-car crash on State Route 128 in rural Mendocino County, about 100 miles northwest of San Francisco.\n\nThis concert was recorded November 12 1997, approximately 2 weeks before his death. Tis is a video transfer from a VHS tape, it is what it is. This has been encoded in the VCD MPEG-1 format.\n\n\nThe Children of Michael Hedges Fund\nDespite his considerable artistic achievements, like most of us, Michael did not have significant financial reserves. Unfortunately, neither did he have significant life insurance in place when he died. In response to inquiries from caring fans, friends, and colleagues as to what they could do to help this situation, a fund was established to help meet the needs of Michael&amp;#039;s children. The fund is currently accepting contributions, and will remain open until it is no longer needed.\n\n\n?Children of Michael Hedges?\nc/o Bank of America\n228 North Main Street\nFort Bragg, CA 95437\nUSA\nPlease write in the lower left hand corner of the envelope: &quot;Please open at branch.&quot;\n\n\n","torrent":{"xt":"urn:btih:d667283dd1f48d083e420e1704254b36686e6df9","amp;dn":"Michael+Hedges+In+Concert%2CSomerville+11-12-1997","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d667283dd1f48d083e420e1704254b36686e6df9","infoHashBuffer":{"type":"Buffer","data":[214,103,40,61,209,244,141,8,62,66,14,23,4,37,75,54,104,110,109,249]},"announce":[],"urlList":[]}}