{"title":"Tom.Clancys.Ghost.Recon.Future.Soldier.Khyber.Strike.DLC-SKIDROW","uid":8215451,"size":1842136544,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d686e63be2d7ba09d29f7d681d6fcef67873c930&amp;dn=Tom.Clancys.Ghost.Recon.Future.Soldier.Khyber.Strike.DLC-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Mr.Stifmeister","files":153,"time":1362331572,"description":"                           S  K  I  D  R  O  W\n                           .the leading force.\n\n                            proudly presents\n       Tom Clancy's Ghost Recon: Future Soldier Khyber Strike DLC\n\n\n   03-03-2013......Release Date  Protection...........Ubisoft DRM\n   FPS/TPS............Game Type  Disk(s)......................DLC\n\n\n   RELEASE NOTES\n\n\nThe third downloadable content pack for Tom Clancy's Ghost Recon Future\nSoldier, Khyber Strike features three new multiplayer maps, a new\nmultiplayer game mode called Takeover, a new Guerrilla Mode co-op map,\nnew achievements, and an increased level cap.\n\nContent includes:\n\nThree new multiplayer maps\n- Switchback: Step off the main road leading down into the city and\n  into a maze of ancient buildings and narrow alleys. The twists and\n  turns of the alleyways turn every corner into a close-quarters\n  deathtrap.\n- Palace: There's no time for reflection even in this magnificent\n  relic. What once was a museum dedicated to showing the glories of the\n  past is now a battlefield, with a massive courtyard at the heart of\n  its contested ground.\n- Transit: A Moscow metro station makes for close quarters and\n  close-range combat. Trains pulling into and out of the station add to\n  the danger as Ghosts and Bodark slug it out underground.\n\nOne new multiplayer game mode: Takeover\nSimilar to a classic team deathmatch, score points for your team by\neliminating enemies.  Tip the scales by taking control of the enemy's\nobjective and earn a score multiplier for your team.  Defend your\nteam's objective to prevent the enemy from gaining the same advantage.\nChoose to split your team to defend and attack at the same time, or\nmove as a group and overwhelm your enemy.  When the mission ends, the\nteam with the highest score wins.\n\nOne Guerrilla Mode map Village (four players online / two players in\nlocal split screen)\n\nA peaceful country village finds itself transformed into a\nbattleground, as fighting rages around its central bus station. Long\nalleyways that run between war-damaged buildings make a perfect\nhunting ground for snipers, and a shootout near the town's gas station\ncould turn explosive.\n\nLevel cap increase of +10\n\n\n   INSTALL NOTES\n\n\n1. Install our Tom.Clancys.Ghost.Recon.Future.Soldier-SKIDROW release\n2. Unpack this release\n3. Install every update in chronological version order - if you haven't\n   updated your game to v1.7 yet. All updates are included in UPDATES\n   folder with this release\n4. Run GRFS_DLC3_installer.exe\n5. Install\n6. Copy the cracked content from the SKIDROW folder and into the main\n   install folder and overwrite\n7. Block the game in your firewall and mark our cracked content as\n   secure/trusted in your antivirus program\n8. Start game from Future Soldier.exe\n9. Play the game\n10. Support the companies, which software you actually enjoy!\n\n\n   ADDITIONAL NOTES\n\n\nThis DLC package requires v1.7 Update!\n\nWe decided to implent and emulate the latest version of the Ubisofts\norbit launcher, to enable every offline function, that their orbit\nservice gives users who actually owns the original. Simply to offer\nemulated functions that noone else in the scene currently offers.\n\nYou'll notice it when you see it!\n\n\n   GREETINGS\n\n\nTo all friends of the family and honorable rival groups!\n\n\n                                ascii art by the\n                               godlike &amp; terrific duo\n                                   malodix + irokos\n                                    titan artdivision\n","torrent":{"xt":"urn:btih:d686e63be2d7ba09d29f7d681d6fcef67873c930","amp;dn":"Tom.Clancys.Ghost.Recon.Future.Soldier.Khyber.Strike.DLC-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d686e63be2d7ba09d29f7d681d6fcef67873c930","infoHashBuffer":{"type":"Buffer","data":[214,134,230,59,226,215,186,9,210,159,125,104,29,111,206,246,120,115,201,48]},"announce":[],"urlList":[]}}