{"title":"Bare Faced Messiah - L Ron Hubbard Exposed","uid":5483935,"size":3846372,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d6f331ade422f7179cb912087a4a9fe0b3292949&amp;dn=Bare+Faced+Messiah+-+L+Ron+Hubbard+Exposed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"artpepper","files":-1,"time":1270592762,"description":"Bare Faced Messiah: The True Story of L. Ron Hubbard by Russell Miller\n\nMichael Joseph Ltd  1987\n\n\nIt gives you chills to consider that present Scientologists might believe even one-tenth of the lunacy of the L. Ron Hubbard that this book reveals as a paranoid, authoritarian, self-aggrandising, destructive, and pathological fuck-bucket.\n\nHubbard was clearly a severely disturbed individual, and his motivation for founding Scientology was also clearly a direct result of his delusions and desire for attention, and, later, for cash.\n\nScientology itself is revealed as a mixture of pop psychology, new age healing techniques, and belief in our heritage as space aliens - all three spiced-up by the illicit thrill that only secret knowledge (priced in US$ of course) can bring.\n\nIn other words, welcome to 20th Century free market Gnosticism, with a bit of everything tossed in, for good measure, by a deranged cook who seems to have no taste buds at all.\n\nEven assuming (following the death of Hubbard) there has been a corporate sanitising of the whackier aspects of his philosophy (and trust me here, the book is overflowing with examples of these), the fact that anyone would choose such an obviously broken foundation stone to build anything on, is enough cause for the alarm bells to start ringing.\n\nThe book is exhaustively researched and is a completely mind-boggling read (you keep putting the book down and saying 'what? shit, no...nobody's stupid enough to believe this crap' and then you remember Tom Cruise).  \n\nThe reader follows Hubby from a creative childhood --we learn about Hubbard's natural talent for story-telling that later developed into his relatively successful science-fiction career-- to a progressively-stunted adulthood where lies became the main creative medium he worked with.\n\nIt would be good to see a follow up that deals less with Hubbard and more with how the Scientologists absorbed his legacy into their current practice (quite well, it would seem, from the myriad of media reports of destructive cultic behaviour).\n\n\n\nThe book has a ring of authenticity and stands as a credible portrait of a destructive cartoon character who - unfortunately - more than a few people saw as their messiah.","torrent":{"xt":"urn:btih:d6f331ade422f7179cb912087a4a9fe0b3292949","amp;dn":"Bare+Faced+Messiah+-+L+Ron+Hubbard+Exposed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6f331ade422f7179cb912087a4a9fe0b3292949","infoHashBuffer":{"type":"Buffer","data":[214,243,49,173,228,34,247,23,156,185,18,8,122,74,159,224,179,41,41,73]},"announce":[],"urlList":[]}}