{"title":"Hard Rain(subs-ned eng sp)(2Lions-Team)","uid":5446046,"size":4682218624,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d8160c28eec5ee9a35cdd35e447280230dd0aae0&amp;dn=Hard+Rain%28subs-ned+eng+sp%29%282Lions-Team%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"JUULTJE","files":-1,"time":1269018659,"description":"Hard Rain (1998)\n\nVerenigde Staten / Verenigd Koninkrijk / Denemarken / Frankrijk / Japan / Nieuw-Zeeland\nActie / Misdaad\n97 minuten\n\ngeregisseerd door Mikael Salomon\nmet Christian Slater, Morgan Freeman en Minnie Driver\n\nTijdens een grote overstroming wordt truckbewaker Tom in een klein dorpje overvallen door de crimineel Jim. Tom weet met het geld te ontsnappen, en verstopt het. In paniek vertelt hij de sheriff waar hij het geld verstopt heeft, waarna hij opgesloten wordt. Tom moet nu zorgen dat hij het geld krijgt, zichzelf in leven houdt, en de sheriff, Jim, en zijn crew te slim is.\n\nEngels\n\nHeavy Rainfall causes a Indiana river to swell and flood the town. All inhabitants are forced by public services to leave instantly. Tom and his uncle Charlie work for a money transport firm and their assignment is to evacuate all cash from the banks along the flooding river. So, their truck is loaded with about three million Dollars. Hank tries to prevent further flooding, as he's the guy responsible for the dam up the river, but he has to open one gate in order to save the old dam from breaking. Only the police under the Sheriff's leadership stay in town to prevent looting. As the water level rises, Tom and Charlie's Truck gets stuck in the flooded road. This is the moment, Jim, an elderly thief, and his gang have been waiting for. In an attempt to get the money from the truck, Charlie gets shot and Tom swims off to save the cash bags. While trying to hide, he meets Karen, who resisted to leave the old church she has been restoring for eight months. She thinks he is a looter, and calls the cops to bring him in. But as the Sheriff finds out about that much cash in a situation like this, he radios his old pal Hank, up at the dam\n\nWeblink http://www.imdb.com/title/tt0120696/\nWeblink http://www.moviemeter.nl/film/477\n\nVideo               : DVD Rip\nAudio               : Engels Spaans\nSubs                : Engels Nederlands Spaans \nID                  : 0xE0\nFormat              : MPEG Video\nFormat version      : Version 2\nBit rate mode       : Variable\nWidth               : 720 pixels\nHeight              : 576 pixels\nDisplay aspect ratio: 4:3\nFrame rate          : 25.000 fps\nStandard            : PAL 2.4\nCover               : Yes\n\n*****************************************\n\nBrought to you by Juultje\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n                          &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\t\t\n\n","torrent":{"xt":"urn:btih:d8160c28eec5ee9a35cdd35e447280230dd0aae0","amp;dn":"Hard+Rain%28subs-ned+eng+sp%29%282Lions-Team%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8160c28eec5ee9a35cdd35e447280230dd0aae0","infoHashBuffer":{"type":"Buffer","data":[216,22,12,40,238,197,238,154,53,205,211,94,68,114,128,35,13,208,170,224]},"announce":[],"urlList":[]}}