{"title":"Text Atlas of Penile Surgery{BBS}","uid":6675607,"size":21750566,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d83fffab7c5ccf539285ffe0e4f9f801dde0a9b1&amp;dn=Text+Atlas+of+Penile+Surgery%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1316016265,"description":"With increasing awareness among physicians and the general public, and the good to excellent results obtained with their repair, the surgical treatment of penile deformities are becoming established procedures. In many cases the relative ease in achieving a cosmetically acceptable penile appearance drives the patients or their families to apply for a surgical correction of the deformity or dysfunction. Congenital penile curvatures can be diagnosed even in childhood, usually by the parents. These curvatures reflect those we encounter in adulthood. This groundbreaking text is the only available to cover penile surgery. It offers the reader detailed surgical anatomy of the penis and description of the commonly used operative procedures, as well as the surgical procedures of many uncommon penile pathologies. Almost all penile deformations are surgically treatable conditions; however, not all need to be treated. Written by one of the world's leading urological surgeons and heavily illustrated, the aim of this book is to provide practical surgical solutions to congenital or acquired penile anomalies and diseases to the practicing urologist who encounters them in their daily practice, including the way to approach these patients, and how to evaluate them. In this book, starting from surgical anatomy, Daniel Yachia gives easy-to-follow practical details on the procedures he performs to ensure successful outcomes, making this a must for all urological surgeons.\nProduct Details\n\n    * Hardcover: 304 pages\n    * Publisher: Informa Healthcare; 1 edition (September 1, 2007)\n    * Language: English\n    * ISBN-10: 1841845175\n    * ISBN-13: 978-1841845173","torrent":{"xt":"urn:btih:d83fffab7c5ccf539285ffe0e4f9f801dde0a9b1","amp;dn":"Text+Atlas+of+Penile+Surgery%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d83fffab7c5ccf539285ffe0e4f9f801dde0a9b1","infoHashBuffer":{"type":"Buffer","data":[216,63,255,171,124,92,207,83,146,133,255,224,228,249,248,1,221,224,169,177]},"announce":[],"urlList":[]}}