{"title":"A Most Sacred Right_a freedom ebook.pdf","uid":4506266,"size":1489733,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d8628720dbf05e9fa7720ce116f9cd115d2570fc&amp;dn=A+Most+Sacred+Right_a+freedom+ebook.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"robertlukens","files":1,"time":1226603283,"description":"PDF format\n\n&quot;A Most Sacred Right,&quot; is an E-book about a concept whose time has come.\n\nFor more info or MS Reader version or to read online, go to http://soverindi.com\n\nWhen a group of patriots come to the conclusion that things are never going to get better in America, because the majority of the people are unaware or don&amp;#039;t care about the steady loss of freedom, they decide to do something about it. If you can&amp;#039;t beat them, leave them behind. \n\nQuestion: What do an ambitious young man, whose &quot;mother&quot; found him, as a newborn, in a pile of trash; an environmental activist and her parents; a political writer; an ex-CIA deep-cover operative; a professor of economics and one of psychology; a constitutional scholar; an FBI agent; a librarian; and two movie stars have in common?\n\nAnswer: A common fear. A common enemy. A common goal. A common plan to achieve the uncommon. They see their rights tattered and torn, disappearing into nothingness. Their privacy is a thing of the past. Their every move can now be observed and recorded. They are appalled to see hundreds of thousands of human lives callously extinguished and millions more lives destroyed completely, with little more concern than would be accorded an equal quantity of insects. They see young people, who might be the hope of the world, sent instead to die for the benefit of a few with great wealth and the power that wealth buys. They see those who purport to love their fellow man, but are the first to want to kill him. They see those who surely love their children, but send them to a senseless death in a conflict contrived for the benefit of parties generally unknown to them. \n\nThey wonder if there is any way whatsoever for them to regain their rights, to retain the fruits of their labor, and to save the lives that are being wasted, at least the lives of those nearest and dearest to them. Alarmed by the rapid march toward all out tyranny in their country and the high-tech surveillance being installed to reinforce it; dismayed that the vast majority of the people are oblivious or unconcerned, they search for a way out. They conclude that there is no hope that enough people could be made aware of the problems, less hope that they would ever be concerned about them, and far less hope that they would ever act to improve things. They realize that, as long as their fate is controlled by the disconnected majority, they are doomed. As things stand, those few who know better will go down with the multitudes who don&amp;#039;t. The situation appears hopeless. The government is too evil and too powerful. The vast majority of the people either don&amp;#039;t see what is happening, or they see it and don&amp;#039;t care.\n\nNevertheless, the characters in this book refuse to lay down and die. Nor are they going to stand as deer in the headlights, watching disaster coming at them. They are not going to be treated as cattle to be corralled and milked dry. They know that, sprinkled among the mindless robots, there have to be others like them. They will find them, and, together, they will do whatever it takes. Their goal could not be more important. The odds against them could not be greater. They will not sit and wait for &quot;something&quot; to happen. They embark on an all or nothing gamble for their freedom to live as they know men were meant to live, as sovereign individuals. Like Hannibal, facing the impossible task of moving his army across the Alps, they will either find a way, or they will make one. They have a right to be free, a most sacred right.\n","torrent":{"xt":"urn:btih:d8628720dbf05e9fa7720ce116f9cd115d2570fc","amp;dn":"A+Most+Sacred+Right_a+freedom+ebook.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8628720dbf05e9fa7720ce116f9cd115d2570fc","infoHashBuffer":{"type":"Buffer","data":[216,98,135,32,219,240,94,159,167,114,12,225,22,249,205,17,93,37,112,252]},"announce":[],"urlList":[]}}