{"title":"On the Line - Serena Williams.mobi","uid":9579933,"size":623002,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d883125815108606da682922e41cf602dbce68b4&amp;dn=On+the+Line+-+Serena+Williams.mobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ebooksports","files":1,"time":1391745160,"description":"                              Serena Williams - On The Line  (Ebook) \n\n\n\n\nOne of the biggest stars in tennis, Serena Williams has captured every major title. Her 2009 Australia Open championship earned her the #1 world ranking for the third time in her illustrious career - and marked only the latest exclamation point on a life well and purposefully lived. As a young girl, Serena began training with an adult-sized racquet that was almost as big as her. Rather than dropping the racquet, Serena saw it as a challenge to overcome-and she has confronted every obstacle on her path to success with the same unflagging spirit. From growing up in the tough, hardscrabble neighborhood of Compton, California, to being trained by her father on public tennis courts littered with broken glass and drug paraphernalia, to becoming the top women's player in the world, Serena has proven to be an inspiration to her legions of fans both young and old. Her accomplishments have not been without struggle: being derailed by injury, devastated by the tragic shooting of her older sister, and criticized for her unorthodox approach to tennis. Yet somehow, Serena always manages to prevail. Both on the court and off, she's applied the strength and determination that helped her to become a champion to successful pursuits in philanthropy, fashion, television and film. In this compelling and poignant memoir, Serena takes an empowering look at her extraordinary life and what is still to come.","torrent":{"xt":"urn:btih:d883125815108606da682922e41cf602dbce68b4","amp;dn":"On+the+Line+-+Serena+Williams.mobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d883125815108606da682922e41cf602dbce68b4","infoHashBuffer":{"type":"Buffer","data":[216,131,18,88,21,16,134,6,218,104,41,34,228,28,246,2,219,206,104,180]},"announce":[],"urlList":[]}}