{"title":"Sword.of.the.Stars.The.Pit.Update.v1.0.4.0-violett","uid":8353434,"size":703493019,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d93d0a2be1f2b11252f0f869f2f87117b8ca72e8&amp;dn=Sword.of.the.Stars.The.Pit.Update.v1.0.4.0-violett&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"violett7","files":335,"time":1365417642,"description":"Unrar,\nstart ThePit.exe to play the game.\nif it doesnt start install XNA from the folder _CommonRedistXNA4.0xnafx40_redist.msi\n\nv.1.0.4.0\nCritical fixes:\n- Fixed rare keyboard crash a couple players reported.\n\nOther fixes:\n- Fixed (finally) bug: Burst-fire sometimes misfiring when poisoned/choked.\n- Fixed bug: Level up sound playing when earning first experience in new game.\n- Fixed attack animations holding last frame while shot travels to target.\n- Fixed bug: Charge Hub infinite XP exploit.\n- Fixed bug: Selection color in recipe list for crafting.\n- Fixed bug: Enemies occupying the same square.\n- Fixed visual issues with attack animations.\n- Fixed bug: Interacting with devices while blind causing Outline to disappear.\n- Fixed bug: Skill/Stat modifiers not showing descriptions when loading save game.\n- Fixed bug: Extra ammo/items being discarded when picking up loot with full inventory.\n\nAdditions and changes:\n- Enviromentally sealed armors now protect against gas attacks.\n- Added notification if player equips a weapon they don't meet the requirements for.\n- Added HUD toggle.\n- Quantum Scan Helmet now reveals props.\n- Adjusted monster variety on Floor 30 on Hard/Insane difficulty.\n- Added dragging item onto another of the same size to swap positions in inventory.\n- Added more info to SotsDex entries for weapons/armor/characters.\n- Added moves remaining to HUD.\n- Added grouping similar items when auto-sorting inventory.\n- Added log entries in SotSDex for experience earned.\n- Added context menu for shortcut items in Inventory.\n- Auto-targeting will track last target.\n- Skills now show stat contribution.\n- Biomods/Keys grouped together in SotsDex, including post-identification.\n- Energy Drink reduced speed increase from 2 to 1\n- Changed recipe failure dialog colors. Green for success, yellow for valid but failed recipe, red for invalid recipe.\n- New recipes and monsters.\n\n1.0.3.0\nFixes:\n- Changed anti-venom to have immediate effect (reduce poison 1 level.)\n- Game now breaks grab if grabbing enemy is not within 1 square of target.\n- Fixed some tools were not being used when crafting recipes.\n- Fixed saved game exploits and bugs.\n- Fixed no sounds for floors 11,16,21.\n- Fixed some grenade issues.\n- Fixed a grabbed character no longer moves when confused.\n- Fixed tooltips showing for hidden traps when using quantum scan helmet.\n- Fixed super Image Inducer bug.\n- Fixed Knife/Blade/Spear skills are now based on Finesse (instead of Might.)\n- Fixed enemy weapons not firing because they are too close to a wall.\n- Fixed can now upgrade skill/stat, even if boosted over 100.\n- Fixed AI sometimes appearing to teleport through objects.\n- Fixed splash damage from shotguns would bypass armor for secondary targets. (sorry, gang)\n- Fixed grenades were being destroyed by explosive damage frequently. They are now treated as items, not weapons.\n- Fixed cyber scrambler would make organic enemies go berserk as well. \n- Fixed lab station could be reused over and over by damaging it and repairing it.\n\nOther changes and additions:\n- Added &quot;Auto Sort&quot; to inventory.\n- Added &quot;Drop All&quot; button to inventory.\n- Added &quot;Destoy&quot; to context menu for inventory items.\n- Added confirmation to &quot;Destroy&quot; and &quot;Unload and Destroy&quot; actions.\n- Added warning when poison/radiation reduces stats below 5.\n- Added recipe details to SotSDex.\n- Task Dialog now selects tools which are &quot;free&quot; to use by default.\n- Player gets credit for monsters killed by traps.\n- charging hubs and repair stations made more efficient.\n-Improved usability of large inventories by adjusting the grid to use more vertical space.\n- Added &quot;Equip Time&quot; for armor to info displays.\n- Added &quot;Reload Time&quot; for weapons to info displays.\n- Sort SotsDex entries alphabetically.\n- Added method to display custom stats for items (eg repair factor for repair tools.)\n- Temporarily Removed GAMEPAD from build configuration until final compatibility is complete.\n- Added recipe info for messages that unlock recipes.\n- Augmentation hubs now use Decipher skill.\n- If mimicked player attacks enemy, enemy will attack back.\n- Added fully translated messages are Green in the SotsDex.\n- Added more details to repair dialog.\n- 7 new achievements.\n- 3 new weapons.\n- 2 new monsters.\n- Basket-load of new Easter items.\n- New recipes and messages.\n\n1.0.2.0 \nNew Additions \n- Two new monsters \n- Five new recipes \n- Four new items \n- Two new weapons \nCritical Fixes \n- Fixed Shrinking Inventory / Dropped Item crash \n- Fixed Projectile crash \n- Fixed equipping/dropped armor crash \nOther Fixes \n- Fixed various outlying issues \n- Greek letters on key-card doors no longer display when door destroyed \n- Characters wearing self-contained armor or who are immune to radiation no longer affected when in an irradiated room \n- Play Again remembers Difficulty setting \n- Fixed Hero Sotswich achievement unlocking prematurely \nOther changes \n- Added reload value to weapon stats \n- Irradiated rooms now show effect for visual warning \n- Tweaks to auto-save to make it more robust \n- Three auto-save slots, one for each character class (meaning you can now have three different games on the go , one for each character) \n- Added mouse targeting for weapons \n- Increased force field belt duration \n- Added access to SotSDex in main menu \n- Decrypted recipes messages now unlock recipes in SotSDex automatically","torrent":{"xt":"urn:btih:d93d0a2be1f2b11252f0f869f2f87117b8ca72e8","amp;dn":"Sword.of.the.Stars.The.Pit.Update.v1.0.4.0-violett","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d93d0a2be1f2b11252f0f869f2f87117b8ca72e8","infoHashBuffer":{"type":"Buffer","data":[217,61,10,43,225,242,177,18,82,240,248,105,242,248,113,23,184,202,114,232]},"announce":[],"urlList":[]}}