{"title":"Shall the Religious Inherit the Earth by Eric P. Kaufmann","uid":10379423,"size":17635038,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d9ad614c1ebf4bb2ee73f46bb1bd08d11f2ba0fc&amp;dn=Shall+the+Religious+Inherit+the+Earth+by+Eric+P.+Kaufmann&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"superp69","files":-1,"time":1403051530,"description":"Shall the Religious Inherit the Earth - Demography and Politics in the Twenty-First Century (2010) by Eric P. Kaufmann.epub\n\nDawkins and Hitchens have convinced many western intellectuals that secularism is the way forward. But most people don't read their books before deciding whether to be religious. Instead, they inherit their faith from their parents, who often innoculate them against the elegant arguments of secularists. And what no one has noticed is that far from declining, the religious are expanding their share of the population: in fact, the more religious people are, the more children they have. The cumulative effect of immigration from religious countries, and religious fertility will be to reverse the secularisation process in the West. Not only will the religious eventually triumph over the non-religious, but it is those who are the most extreme in their beliefs who have the largest families.\n\nWithin Judaism, the Ultra-Orthodox may achieve majority status over their liberal counterparts by mid-century. Islamist Muslims have won the culture war in much of the Muslim world, and their success provides a glimpse of what awaits the Christian West and Israel. Based on a wealth of demographic research, considering questions of multiculturalism and terrorism, Kaufmann examines the implications of the decline in liberal secularism as religious conservatism rises - and what this means for the future of western modernity.\n\nPaperback: 320 pages\nPublisher: Profile Books (April 19, 2011)\nLanguage: English\nISBN-10: 1846681448\nISBN-13: 978-1846681448","torrent":{"xt":"urn:btih:d9ad614c1ebf4bb2ee73f46bb1bd08d11f2ba0fc","amp;dn":"Shall+the+Religious+Inherit+the+Earth+by+Eric+P.+Kaufmann","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9ad614c1ebf4bb2ee73f46bb1bd08d11f2ba0fc","infoHashBuffer":{"type":"Buffer","data":[217,173,97,76,30,191,75,178,238,115,244,107,177,189,8,209,31,43,160,252]},"announce":[],"urlList":[]}}