{"title":"Coast to Coast AM February 12 2013","uid":8139415,"size":56297445,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d9c243bb1075eb763d2d64dcfde9b503752a9377&amp;dn=Coast+to+Coast+AM+February+12+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1360777871,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t02-12-13\nHost: \tGeorge Noory\nGuests: \tJim Marrs, Mitchell Scott Lewis, Lionel Fanthorpe\n\nAppearing during the middle two hours, author and journalist Jim Marrs discussed archeological discoveries that not only support the notion that human civilization originated from ETs, but that advanced civilizations have made Earth their home long before the recorded dates in our history books. He also addressed how mainstream science and institutions have worked to hide our possible true heritage. He connected &quot;ancient aliens&quot;-- the idea that ETs were on our planet thousands of years ago tinkering with mankind's genetics, with the wealthy elite-- a group of about 13 families that try to run the world. Marrs suggested that the elite know of the ancient astronaut connection, and believe they are possibly connected/descended from them.\n\nThe government controls secret knowledge of the past such as the evidence for ancient aliens, as well as giants, he said, and there is a whole hidden history of advanced civilizations, as well, exemplified by sites like the mysterious Gobekli Tepe, which is 7,000 years older than Stonehenge. Marrs touched on various UFO incidents throughout history, including the UFO crash reported in Aurora, Texas in 1897. According to his research, a type of aluminum was found buried at the crash site that was not of the same make-up as modern aluminum. He also presented his theory that UFOs are flying in energy fields that nullify gravity and time, which explains why vehicles suddenly stop, and people experience missing time during a sighting.\nAstrology &amp; Economy\n\nFirst hour guest, astrologer and author Mitchell Lewis talked about how astrological signs are pointing to major financial chaos ahead. He foresees April 2014-- a &quot;grand cross&quot; when Uranus and Pluto square, and Jupiter and Mars square, as a time of great stress economically, and otherwise. We are going to see market corrections before then, as there is no reason for a bull market now, he continued. &quot;I think it's going to take at least until 2017 for the aspects we're going to go under to dissipate, then giving us the freedom to start another bull market,&quot; he said.\nA Visit From Lionel\n\nIn the last hour, author Lionel Fanthorpe discussed UFOs, as well as the Book of Revelation. One possibility is that UFOs are time ships rather than spaceships, he theorized, adding that &quot;they provide evidence when something appears that one of our remote descendants at some time in the future has overcome the problems of time.&quot; He also recounted some of his favorite tales, including the mysteries of the Oak Island Money Pit, and the Barbados coffins.\n\nNews segment guests: Lance Gooden, Christian Wilde\nWebsite(s):\n\n    jimmarrs.com\n    mitchastro.com\n    lionel-fanthorpe.com\n\nBook(s):\n\n    Our Occulted History: Do the Global Elite Conceal Ancient Aliens?\n    Rule by Secrecy\n    Alien Agenda\n    The Rise of the Fourth Reich\n    Murder in the 11th House\n    Death in the 12th House\n\n","torrent":{"xt":"urn:btih:d9c243bb1075eb763d2d64dcfde9b503752a9377","amp;dn":"Coast+to+Coast+AM+February+12+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9c243bb1075eb763d2d64dcfde9b503752a9377","infoHashBuffer":{"type":"Buffer","data":[217,194,67,187,16,117,235,118,61,45,100,220,253,233,181,3,117,42,147,119]},"announce":[],"urlList":[]}}