{"title":"Love Unscripted by Tina Reber (Love Book 1)","uid":7678880,"size":1389678,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:da32fd9038fecf9abf021a3737a07af4004c69bb&amp;dn=Love+Unscripted+by+Tina+Reber+%28Love+Book+1%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"azizex666","files":-1,"time":1348769534,"description":"Ryan Christensen just wanted to be an actor. Never in his wildest dreams did he ever think that accepting a role in an unknown film would toss his career into overdrive. His new fame has cost him dearly; anonymity is no longer an option. His fans stalk him, the paparazzi hound him, and Hollywood studios all want a piece of him. Despite all of that, Ryan Christensen craves the most basic of human needs - to have love in his heart and privacy in his life.\n\nTaryn Mitchell, the story's protagonist, is a realist. She's been feigning contentment, running the family pub in Seaport, Rhode Island, while quietly nursing her own internal heartaches. Her feet are fairly glued to the ground and she doesn't buy into all the hype that has descended on her tiny, coastal town. In her world, men are safe if they're kept at a distance.\n\nFate has other plans for these two when their paths cross one sunny afternoon. A group of female fans has attacked him, leaving his shirt torn, his face cut, and Ryan in obvious distress. Bonds between them form from the most dramatic of circumstances while jealousy, insecurity, and the stress of his celebrity life try to tear them apart.\n\nThrough all the tabloid lies, secrecy, and pressure, can Taryn's peace and Ryan's high-profile insanity live together in harmony?\n\n\n\n                             Format 1 - .ePUB\n\n                             Format 2 - .Mobi\n\n\n           **Support Your Favorite Authors By Buying Their Books**\n\n               Check out all my Magazine and ebook uploads here.\n\n                  &lt;a href=&quot; https://thepiratebay.se/user/azizex666/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/azizex666/&lt;/a&gt;","torrent":{"xt":"urn:btih:da32fd9038fecf9abf021a3737a07af4004c69bb","amp;dn":"Love+Unscripted+by+Tina+Reber+%28Love+Book+1%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da32fd9038fecf9abf021a3737a07af4004c69bb","infoHashBuffer":{"type":"Buffer","data":[218,50,253,144,56,254,207,154,191,2,26,55,55,160,122,244,0,76,105,187]},"announce":[],"urlList":[]}}