{"title":"Goldfrapp - Ooh La La (Xvid-2nafish)","uid":5992345,"size":67236560,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:dbbacd251c8df3fc875e50fefeb6ab9b703dfd2e&amp;dn=Goldfrapp+-+Ooh+La+La+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1290931159,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:17\n\n[Video]\nResolution : 640x264\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 2596 Kbps\nQuality Factor : 0.52 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Ooh La La&quot; is a 2005 electronic dance song performed bygroup Goldfrapp. The song was written and produced by Alison Goldfrapp and Will Gregory for the duo's third album Supernature (2005). The song is based around a synthesizer and guitar arrangement and was inspired by the disco era.\n\nThe song was released as the album's lead single in August 2005 to positive reviews from music critics. It was a commercial success, reaching the top forty on the majority of the charts it entered, and topped the United States dance chart. The song has been remixed a number of times and was nominated for &quot;Best Dance Recording&quot; at the 49th Grammy Awards in 2007.\n\nThe music video for &quot;Ooh La La&quot; was directed by Dawn Shadforth. Inspired by &quot;glam rock 70's TV&quot;, the video features Goldfrapp and a backing band (not portrayed by her regular live musicians) performing in a large green room. Scenes of Alison Goldfrapp riding on a digital sparkling horse are intercut toward the end of the video. Alison Goldfrapp has described the video as &quot;harking back to Eno era Roxy Music and old Top of the Pops&quot;. The complete version of &quot;Ooh La La&quot; featured in the music video has been released commercially through CD singles and digital downloads, and some include remixes by Benny Benassi, Tiefschwarz, and Andy Bell.\n\nGoldfrapp began work on &quot;Ooh La La&quot; in late 2004 in a small rented house in the countryside of Bath, England. The song was composed as a collaborative effort between Alison Goldfrapp and Will Gregory while jamming in the recording studio, bouncing song ideas off each other. Goldfrapp contributed the song's lyrics, and has described the song as being &quot;sulky, sexual and a bit ambiguous&quot;. In &quot;Ooh La La&quot;, she confesses to wanting only a sexual relationship without romance.\n\n&quot;Ooh La La&quot; was Goldfrapp's first song to feature the electric guitar, an instrument that they had avoided due to its overly recognisable rhythm. When they recorded the song, Gregory played the keyboard bass as Goldfrapp sang. Her microphone picked up the &quot;clattering&quot; of Gregory's pressing the keys, which they added to the chorus. The song is written in the common verse-chorus form and features additional instrumentation from synthesizers and a bass guitar.\n\nThe song has been compared to Norman Greenbaum's 1969 glam rock song &quot;Spirit in the Sky&quot; and Rachel Stevens' 2004 electropop song &quot;Some Girls&quot;(itself heavily influenced by Goldfrapp's own &quot;Strict Machine&quot;). Gregory noted that comparisons to Greenbaum were made when the duo released the song &quot;Train&quot; in 2003, adding that the two tracks share the same glam swing. Goldfrapp rejected comparisons to Stevens, stating that &quot;Some Girls&quot; was &quot;very bland&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:dbbacd251c8df3fc875e50fefeb6ab9b703dfd2e","amp;dn":"Goldfrapp+-+Ooh+La+La+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbbacd251c8df3fc875e50fefeb6ab9b703dfd2e","infoHashBuffer":{"type":"Buffer","data":[219,186,205,37,28,141,243,252,135,94,80,254,254,182,171,155,112,61,253,46]},"announce":[],"urlList":[]}}