{"title":"Incautos.DVDRIP.(spanish).","uid":5798044,"size":733948556,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dbcbd4106fce72dacadfb11486fbe5b2a9c41eb5&amp;dn=Incautos.DVDRIP.%28spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zurera","files":-1,"time":1283153735,"description":"Calidad de la pelicula: DVDRip\nTamaÃƒÂ±o del archivo: 689Mb\nGenero: Drama\nDuracion: 110 min.\nDirector: Miguel Bardem\nReparto: Victoria Abril, Ernesto Alterio, Federico Luppi, Manuel Alexandre, Gilbert Melki, Alejandro Casaseca, Luis CastejÃƒÂ³n, Manuel MorÃƒÂ³n\n\nSinopsis: Desde que tiene uso de razÃƒÂ³n, Ernesto sÃƒÂ³lo ha hecho una cosa: engaÃƒÂ±ar. Conoce los entresijos del timo de la mano de un viejo timador llamado el Manco. Las vÃƒÂ­ctimas son incautos de clase media o baja y los botines no superan las doscientas mil pesetas. Al cabo de un tiempo, el Manco pone a Ernesto en contacto con quien ÃƒÂ©l considera el mejor timador que ha existido: Federico, un estafador elegante, astuto y metÃƒÂ³dico. Mientras la mayorÃƒÂ­a de los ciudadanos se hipotecan en lo bancos y son exprimidos por los impuestos, Federico tima a Banqueros, PolÃƒÂ­ticos, Generales... y jamÃƒÂ¡s paga una letra, y mucho menos a Hacienda. La vida no puede ser mÃƒÂ¡s perfecta, hasta que irrumpe Pilar, la antigua amante y socia de Federico, a quien dejÃƒÂ³ plantado hace aÃƒÂ±os llevÃƒÂ¡ndose el dinero de una estafa. Pilar ofrece a Federico lo que entre los timadores es conocido como un &quot;Mirlo Blanco&quot;, el gran golpe para retirarse: un incuato confiado, avaricioso y podrido de dinero negro. Ernesto se verÃƒÂ¡ inmerso en el centro de un peligroso triÃƒÂ¡ngulo formado por la codicia, la traiciÃƒÂ³n y la venganza. ","torrent":{"xt":"urn:btih:dbcbd4106fce72dacadfb11486fbe5b2a9c41eb5","amp;dn":"Incautos.DVDRIP.%28spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbcbd4106fce72dacadfb11486fbe5b2a9c41eb5","infoHashBuffer":{"type":"Buffer","data":[219,203,212,16,111,206,114,218,202,223,177,20,134,251,229,178,169,196,30,181]},"announce":[],"urlList":[]}}