{"title":"The Value of Violence (2013) epub","uid":8951194,"size":897261,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc838be6905cc90c4b32a1bb34e7292414ac7785&amp;dn=The+Value+of+Violence+%282013%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1379889418,"description":"This provocative thesis calls violence the driving force not just of war, but of politics and even social stability.\n\n Though violence is commonly deplored, political scientist Ginsberg argues that in many ways it is indispensable, unavoidable, and valuable. \n Ginsberg sees violence manifested in society in many ways. &quot;Law-preserving violence&quot; (using Walter Benjamin's phrase) is the chief means by which society preserves social order. Behind the security of a stable society are the blunt instruments of the police, prisons, and the power of the bureaucratic state to coerce and manipulate.\n Ginsberg also discusses violence as a tool of social change, whether used in outright revolution or as a means of reform in public protests or the threat of insurrection. He notes that even groups committed to nonviolent tactics rely on the violent reactions of their opponents to achieve their ends. And to avoid the threat of unrest, modern states resort to social welfare systems (a prudent use of the carrot instead of the stick). \n Emphasizing the unavoidability of violence to create major change, Ginsberg points out that few today would trade our current situation for the alternative had our forefathers not resorted to the violence of the American Revolution and the Civil War.\n\n2013","torrent":{"xt":"urn:btih:dc838be6905cc90c4b32a1bb34e7292414ac7785","amp;dn":"The+Value+of+Violence+%282013%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc838be6905cc90c4b32a1bb34e7292414ac7785","infoHashBuffer":{"type":"Buffer","data":[220,131,139,230,144,92,201,12,75,50,161,187,52,231,41,36,20,172,119,133]},"announce":[],"urlList":[]}}