{"title":"Your Own Worst Enemy: Breaking the Habit of Adult Underachieveme","uid":12374170,"size":438125,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd0cfd15f9506f3dc66b2f88276067a37f4cc13c&amp;dn=Your+Own+Worst+Enemy%3A+Breaking+the+Habit+of+Adult+Underachieveme&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mdusanjay","files":1,"time":1441682620,"description":"Your Own Worst Enemy: Breaking the Habit of Adult Underachievement by Kenneth W. Christian\n\nOverview: If you or someone you love isn't living up to his or her potential -- and suffers from even one or two of the above feelings -- here is a program that can help. Your Own Worst Enemy is the first book devoted to the problem of adult underachievement, a problem stemming from common behavior patterns that can manifest itself in almost every walk of life -- from twentysomethings stuck in dead-end jobs to outwardly successful businesspeople who can't help feeling they've missed their true calling.\n\nIn Your Own Worst Enemy, Dr. Kenneth Christian details the telltale signs of what he calls self-limiting behavior -- everyday habits that can seem harless (like taking unchallenging jobs) or even worthwhile (like setting absurdly high standards), but that over time can send high-potential people into a tailspin of dead ends and frustration. He identifies underachieving types, from charmers, who substitute congeniality for effort, to extreme risk-takers, who casually gamble their future away, to best-or-nothings, who refuse to play if they can't win. And he offers practical 15-step guide to help underachievers shake off their old habits and start taking an active hand in their own future","torrent":{"xt":"urn:btih:dd0cfd15f9506f3dc66b2f88276067a37f4cc13c","amp;dn":"Your+Own+Worst+Enemy%3A+Breaking+the+Habit+of+Adult+Underachieveme","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd0cfd15f9506f3dc66b2f88276067a37f4cc13c","infoHashBuffer":{"type":"Buffer","data":[221,12,253,21,249,80,111,61,198,107,47,136,39,96,103,163,127,76,193,60]},"announce":[],"urlList":[]}}