{"title":"Irish Driver Theory Test 5th Edition 2011 with Bus &amp; Truck f","uid":7184278,"size":698610074,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:dd5bcd821a0e2e17dbe772220f4fedeb7b8ef693&amp;dn=Irish+Driver+Theory+Test+5th+Edition+2011+with+Bus+%26amp%3B+Truck+f&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"grakk","files":6,"time":1334373727,"description":"Irish Driver Theory Test 5th Edition (October 2011)\n\nAlso includes official fix for practice Bus &amp; Truck theory tests (http://www.imagitech.co.uk/SoftwareUpdate/The Official Driver Theory Test/2.0/English/The Official Driver Theory Test 5th Edition Update 1 (English) Setup.exe)\n\n\nThis torrent contains an ISO rip of the official test CD which has been slightly modified to include the official Bus &amp; Truck update fix as well as instructions and tools to make this version work. The test software has some rather weak copy protection. Below are some workarounds for this copy protection. Try them one at a time, in any order until one method works for you.\n\nOption 1. Mount the ISO file to a virtual drive: Install Alcohol 52% Free (included in torrent and CD image) or Daemon Tools Lite (http://www.disc-tools.com/download/daemon). Note: Daemon Tools only worked for me using emulated SCSI drives, but not when using the default DT drives. Ensure you check the SPTD option when installing this. Once you installed either of these, mount TODTT_2011.iso to the virtual drive. Fingers crossed.\n\nOption 2. Burn the ISO image to a CD (CD-R preferably) and try the disk in a CD-ROM (non-burner) drive. The copy protection looks for information from the CD that is only present in burned media. CD-ROM drives cannot read this info :)\n\nOption 3. Burn the ISO image to a CD (CD-R preferably). Now hide the fact that the CD-R (burned CD) is not a CD-ROM (pressed original disk) to defeat the copy protection. Here's how. Install Alcohol 52% Free and start it up. Select &quot;Emulation&quot; from the Options section and check the first option, &quot;Ignore Media Type&quot;. This option forces software to ignore writeable media types, allowing it to be recognised as CD-ROM media (one caveat here though - you would need to turn this option off again if you need to burn a CD/DVD as this option shows burners as read-only drives).\n\nGood Luck.\n\nPS. A nice touch from our benevolent masters' lackeys in the RSA; they outsourced this work to Prometric who then outsourced it again Imagitech in the UK. Who knows, maybe the work eventually got done in India or beyond. You'd think they could've managed to find someone here in Ireland to spend about two days knocking this app together (which is about all the time spent on it by the looks of it).","torrent":{"xt":"urn:btih:dd5bcd821a0e2e17dbe772220f4fedeb7b8ef693","amp;dn":"Irish+Driver+Theory+Test+5th+Edition+2011+with+Bus+%26amp%3B+Truck+f","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd5bcd821a0e2e17dbe772220f4fedeb7b8ef693","infoHashBuffer":{"type":"Buffer","data":[221,91,205,130,26,14,46,23,219,231,114,34,15,79,237,235,123,142,246,147]},"announce":[],"urlList":[]}}