{"title":"CPA Exam Study Guides, Wiley 2013-14 [PDF]","uid":9332895,"size":87278374,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dec39965979ab4850ba95fb85f7408e0c0d15cba&amp;dn=CPA+Exam+Study+Guides%2C+Wiley+2013-14+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"F1restorm","files":-1,"time":1386799714,"description":"CPA Exam Study Guides, Focus Notes and Exam Reviews, Wiley 2013-14\n1. Wiley CPA Exam Review 2013-14 Vol 1: Outlines and Study Guides\n2. Wiley CPA Exam Review 2013-14 Vol 2: Problems and Solutions\n3. Wiley CPAexcel Exam Review 2014 Study Guide, Auditing and Attestation\n4. Wiley CPAexcel Exam Review 2014 Focus Notes, Auditing and Attestation\n5. Wiley CPAexcel Exam Review 2014 Study Guide, Financial Accounting and Reporting\n6. Wiley CPAexcel Exam Review 2014 Focus Notes, Financial Accounting and Reporting\n7. Wiley CPAexcel Exam Review 2014 Study Guide, Regulation\n8. WIley CPAexcel Exam Review 2014 Focus Notes, Regulation\n9. Wiley CPAexcel Exam Review 2014 Study Guide, Business Environment and Concepts\n10.Wiley CPAexcel Exam Review 2014 Focus Notes, Business Environment and Concepts \nAuthor: O Ray Whittington\nPublished: 2013\nPublisher: Wiley\nFormat: Retail PDF\nReader Required: Adobe Reader, Adobe Digital Editions\n\nTested on the above readers with no problems on laptop and Android tablet. Please note the new Adobe Reader XI is a bit unstable and won't open files where it thinks the file names are too long. I've shortened the file names but if you do get an error just shorten it further. I re-downloaded it from the seedbox and checked it and it was fine but you never know. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps! :D\n______________________________________________________________________________________\n\nDescription from Wiley CPA Exam Review 2013-14 Vol 1 and 2\nThe #1 CPA exam review self-study leader\nThe CPA exam review self-study program more CPA candidates trust to prepare for the CPA exam and pass it, Wiley CPA Exam Review 40th Edition contains more than 4,200 multiple-choice questions and includes complete information on the Task Based Simulations. Published annually, this comprehensive two-volume paperback set provides all the information candidates need in order topass the Uniform CPA Examination format.\n\nFeatures multiple-choice questions, AICPA Task Based Simulations, and written communication questions, all based on the CBT-e format\nCovers all requirements and divides the exam into 47 self-contained modules for flexible study\nOffers nearly three times as many examples as other CPA exam study guides\nWith timely and up-to-the-minute coverage, Wiley CPA Exam Review 40th Edition covers all requirements for the CPA Exam, giving the candidate maximum flexibility in planning their course of study, and success.\n","torrent":{"xt":"urn:btih:dec39965979ab4850ba95fb85f7408e0c0d15cba","amp;dn":"CPA+Exam+Study+Guides%2C+Wiley+2013-14+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dec39965979ab4850ba95fb85f7408e0c0d15cba","infoHashBuffer":{"type":"Buffer","data":[222,195,153,101,151,154,180,133,11,169,95,184,95,116,8,224,192,209,92,186]},"announce":[],"urlList":[]}}