{"title":"Atlas of World Architecture {BBS}","uid":7558302,"size":65683826,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:df7bde8983cd3c4eb858bb4de99b1ae9c9dd5c53&amp;dn=Atlas+of+World+Architecture+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1345677174,"description":"In the past five years, the globalised trend of interior design has seemingly been led by the five cities-renowned as the cities of design, including Tokyo, Paris, Milan, London and New York. At the same time, it has become a common realization of designers around the world to explore and employ the local features for each project with the advancement of economy and culture.\n\nThe book, Atlas of World Interiors, with 500 projects selected, is a detailed and comprehensive portrayal of the best and newest interior projects from 6 continents of more than 50 countries. In detail, the projects are of different styles, such as the pragmatism of North America, the naturalism of South America, the regionalism of Asia, the minimalism of North Europe and the luxurism of the Mediterranean area.\n\nIn countries such as, Iran, United Arab Emirates, South Africa, Morocco, Tunisia and so on, the history and culture of a particular location was subtly integrated into the interior design through innovative approaches. Moreover, designers can also be inspired a lot by this book to search a balance between the overwhelmingly globalized trend and the increasingly personalized feature.\n\nThis book offers readers a visual feast with the collection of world's most classic interior projects and is categorized into 10 parts, including culture and leisure, restaurant, bar, shop and showroom, spa and fitness, hospital and pharmacy, office, teaching and research, house, hotel, transport and factory. Each project is illustrated with real photos, plans and text. In addition, each geographic region is distinguished by a different color-code. We firmly believe and hope it will serve as a source of pleasure and inspiration to all its readers.\n\nAs one of the series books Atlas of World Interiors, this book is featured with its timeliness, globalization, regionalization, and professionalization to help readers from all over the world to find inspiration, and approach new materials and the cultural heritage.\n\n\n\n# Hardcover: 508 pages\n# Publisher: Design Media Publishing Ltd (May 28, 2011)\n# Language: English\n# ISBN-10: 988197397X\n# ISBN-13: 978-9881973979","torrent":{"xt":"urn:btih:df7bde8983cd3c4eb858bb4de99b1ae9c9dd5c53","amp;dn":"Atlas+of+World+Architecture+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df7bde8983cd3c4eb858bb4de99b1ae9c9dd5c53","infoHashBuffer":{"type":"Buffer","data":[223,123,222,137,131,205,60,78,184,88,187,77,233,155,26,233,201,221,92,83]},"announce":[],"urlList":[]}}