{"title":"The Power of Art (Art Ebook).pdf","uid":12938908,"size":77328985,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dff15a60b6a45fa0b8297f534fd356f89fa5188f&amp;dn=The+Power+of+Art+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1449611289,"description":"The Power of Art, 2 edition by Richard L. Lewis, Susan Ingalls Lewis\r\nEnglish | 2008 | ISBN 0534641032 | 528 pages | PDF | 73,7 MB\r\n\r\nBrief, visual, and relevant, THE POWER OF ART, 2e delivers an engaging, jargon-free survey for the art appreciation course. Richard and Susan Lewis open your eyes to the power of art with their captivating writing, so lively and succinct that you'll be able to complete your reading quickly, concentrate on the accompanying illustrations, and come to class prepared. \r\n\r\nThe book's reproductions -- larger than in other art appreciation texts -- make it easier to focus on the key details important to understanding the artwork. The text does an exceptional job of focusing on the Western tradition while incorporating non-Western material in key points to demonstrate cultural intersections and mutual influences. Clear discussions of artistic forms and art in Western culture are complemented by boxed features like &quot;Art News&quot; and &quot;Global View&quot; \r\n\r\nthat highlight the relevance of art today, controversial topics, and the impact of non-Western cultures on the West. In addition to its excellent art history coverage, THE POWER OF ART features a diverse mix of artists and spotlights the latest technologies used to create art. This solid text also is bolstered by ArtExperience Online's rich learning tools. The Advantage pricing of this text delivers an unrivaled value!","torrent":{"xt":"urn:btih:dff15a60b6a45fa0b8297f534fd356f89fa5188f","amp;dn":"The+Power+of+Art+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dff15a60b6a45fa0b8297f534fd356f89fa5188f","infoHashBuffer":{"type":"Buffer","data":[223,241,90,96,182,164,95,160,184,41,127,83,79,211,86,248,159,165,24,143]},"announce":[],"urlList":[]}}