{"title":"Unfinished Evolution How a New Age Revival can change your life ","uid":6083487,"size":22516975,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e1966dd60c7dc347a4fde975761d3d6dce350f2f&amp;dn=Unfinished+Evolution+How+a+New+Age+Revival+can+change+your+life+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pardeep333","files":6,"time":1294216084,"description":"Unfinished Evolution: How a New Age Revival Can Change Your Life and Save the World Book\n \n\nScotalyn Press | 2009 | ISBN: 0615229727 | 352 pages | PDF |\n\nIF YOU WANT TO SAVE THE WORLD START HERE! Despite rumors to the contrary, the New Age \nmovement is alive and well and still our best hope for creating a more enlightened society. True, \nthe term New Age has fallen from fashion. That s one reason why those of us who are spiritual \nbut not religious 24 percent of Americans according to a recent Newsweek poll have been stuck \nin an identity crisis over what to call ourselves. Are we part of a Holistic Movement, an Aquarian \nConspiracy, a Cultural Creative Renaissance, what? We don t know, and mostly likely, we haven't \nbeen too concerned about it; we find labels much too limiting. But our disdain for naming ourselves \nhas been purchased at enormous cost. Most of us walk alone and often lonely on our individual paths, \nunable to share our efforts. We walk alone, our numbers uncounted, our opinions unconsidered, and \nour voices unheard by the society we hope to transform. Today, with global warming and terrorism \ndire threats to our future survival, transforming society is no longer a pleasant option, but urgent \nnecessity. It s time for the New Age to get is mojo back. It s time for us to tap into the power of a \ncollective identity. Unfinished Evolution is a roll call for all spiritual idealists all 50 million of us cultural \ncreatives, liberal Christians and Jews, bohemians, treehuggers, peaceniks, yoga enthusiasts, holistic \nhealers, pagans, armchair Buddhists and other alternative sorts. It is time to come out of hiding, \ntime to declare the courage of your convictions, time to stand up and be counted as an agent of \nchange. &quot;In case you thought the dream of a 'new age' of consciousness was dead, think -- and \nread -- again. This book, wise, intimate, and deeply informative, is a clarion call about the greatest \nof conversations: about the future of humanity.&quot; -Michael Grosso, Ph.D., author of The Millennium \nMyth and Experiencing the Next World Now &quot;Booth dares to pick up the tattered and torn banner \nof the New Age and restore it to the meaning it once had... [Her book] made me feel like an old \nNew Age workhorse ready to wear the saddle again. I was inspired. &quot; -From the foreword by David \nSpangler, author of Reimagination of the World, and Blessing: The Art and the Practice","torrent":{"xt":"urn:btih:e1966dd60c7dc347a4fde975761d3d6dce350f2f","amp;dn":"Unfinished+Evolution+How+a+New+Age+Revival+can+change+your+life+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1966dd60c7dc347a4fde975761d3d6dce350f2f","infoHashBuffer":{"type":"Buffer","data":[225,150,109,214,12,125,195,71,164,253,233,117,118,29,61,109,206,53,15,47]},"announce":[],"urlList":[]}}