{"title":"Religion in Personality Theory by Frederick Walborn (2014) [PDF]","uid":10566807,"size":3376379,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e1cb324418e7cae74a943f26a9d1f34108aa7aa3&amp;dn=Religion+in+Personality+Theory+by+Frederick+Walborn+%282014%29+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1405529994,"description":"Title: Religion in Personality Theory\nAuthor: Frederick Walborn\nCategory: Academic/Religion\nPublisher: Academic Press; 1 edition (January 21, 2014)\nLanguage: English\nISBN-10: 0124078648\nISBN-13: 978-0124078642\n\nPromotional info/Publisher's summary - &quot;Religion in Personality Theory makes clear the link between theory and research and personality and religion. Presently, most personality texts have a limited discussion of religion and reference few theorists other than Freud and Maslow in relation to the subject. This book reviews the theory and the empirical literature on the writings of 14 theorists. Every chapter concludes with a summation of the current research on the theorist's proposals.&quot;\n\nReviews:\n&quot;Frederick Walborn has written an excellent text that explores the degree to which classical personality theorists were personally influenced by and focused upon religion in developing their personality theories. Each theorist is presented in sufficient detail so that their personal views of religion are seen to influence the theories they developed. In addition, the current status of the empirical evidence in the psychology of religion is explored in the context of the theorist and theory to which the data is most relevant. Current and up to date, this text is appropriate for either a course in Personality or as an introduction to the Psychology of Religion. The author's own comprehensive theory of religion and spirituality creatively integrates the positive contributions of the classical personality theorist to the contemporary psychology of religion.&quot; -Ralph W. Hood Jr., Professor of Psychology, University of Tennessee at Chattanooga\n\n&quot;In this interesting and accessible book, Frederick Walborn thoughtfully probes the place of religion and spirituality in the writings of a broad range of classical psychological thinkers and offers an insightful critique of current empirical research on the complex relation of religion and spirituality to individual well-being.&quot; -Michele Dillon, Ph.D., Professor and Chair, Department of Sociology, University of New Hampshire, Durham, New Hampshire\n\n\nThis torrent contains a browse-able and searchable copy of the book in PDF format. The front cover image of the hardcover is also included (though the copy enclosed has a different cover page). Please seed, and enjoy.\n\nPlease visit and support my Suprbay release thread here, I would appreciate it:       &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&lt;/a&gt;","torrent":{"xt":"urn:btih:e1cb324418e7cae74a943f26a9d1f34108aa7aa3","amp;dn":"Religion+in+Personality+Theory+by+Frederick+Walborn+%282014%29+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1cb324418e7cae74a943f26a9d1f34108aa7aa3","infoHashBuffer":{"type":"Buffer","data":[225,203,50,68,24,231,202,231,74,148,63,38,169,209,243,65,8,170,122,163]},"announce":[],"urlList":[]}}