{"title":"Ore no Imouto ga Konnani Kawaii Wake ga Nai season 1 and special","uid":8637081,"size":10609340858,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e1dfa2db0e436e588498bbedbe80ae5a14f3ac13&amp;dn=Ore+no+Imouto+ga+Konnani+Kawaii+Wake+ga+Nai+season+1+and+special&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zahur4","files":-1,"time":1372784244,"description":"Kyousuke Kousaka, a normal seventeen-year-old high school student, hasn't gotten along with his younger sister, Kirino, in years. For longer than he can remember, Kirino has ignored his comings and goings and looked at him with spurning eyes. It seemed as if the relationship between Kyousuke and his sister, now fourteen, would continue this way forever. \n\nOne day, however, Kyousuke finds a DVD case of a magical girl anime entitled Hoshikuzu Witch Meruru (Stardust Witch Meruru), which had fallen into the entranceway of his house. To Kyousuke's surprise, inside the case is a hidden adult video game titled Imouto to Koishiyo! (Love with Little Sister!). Kyousuke attempts to fish out the culprit who dropped the case by bringing up the topic of magical girl anime at the family dinner table. All that comes out is a strong negative reaction from his parents, especially his anti-otaku policeman father.\n\nThat night, Kirino bursts into Kyousuke's room and, in perhaps the first conversation she has initiated with him in years, says they &quot;have things to talk about.&quot; Kirino brings Kyousuke to her room and shows him an extensive collection of moe anime and lolicon bishoujo games she has been collecting in secret.\n","torrent":{"xt":"urn:btih:e1dfa2db0e436e588498bbedbe80ae5a14f3ac13","amp;dn":"Ore+no+Imouto+ga+Konnani+Kawaii+Wake+ga+Nai+season+1+and+special","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1dfa2db0e436e588498bbedbe80ae5a14f3ac13","infoHashBuffer":{"type":"Buffer","data":[225,223,162,219,14,67,110,88,132,152,187,237,190,128,174,90,20,243,172,19]},"announce":[],"urlList":[]}}