{"title":"Mariah Carey - It's Like That   (2nafish)","uid":5376156,"size":139149316,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e2f08dafb3dcaaed4601d78a84d66297c74788c3&amp;dn=Mariah+Carey+-+It%5C%27s+Like+That+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1266539407,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;It's Like That&quot; is a song written by Mariah Carey, Jermaine Dupri, Manuel Seal, and JohntÃƒÂ¡ Austin, and produced by Carey, Dupri, and Seal for Carey's tenth studio album, The Emancipation of Mimi (2005). It borrows the hook &quot;it's like that y'all&quot; from the Run-D.M.C. tracks &quot;Hollis Crew&quot; (1984) and &quot;Here We Go (Live)&quot; (1983), showing the strong influence of old school hip hop on Carey's 2005 sound. The song also shared its name with another Run DMC song. It was the first single to be released from the album, in 2005. It was a top twenty hit in several countries, including the United States, and was nominated for a 2006 Grammy Award for Best Female Pop Vocal Performance. &quot;It's Like That&quot; and &quot;I Know What You Want&quot; are considered to be Carey's return to prominence after major failures of her previous works.\n\nAn official remix produced by Scott Storch has a more Middle Eastern flavor and a rap by Fat Joe. Dance remixes, with re-recorded vocals by Carey, were produced by David Morales. Peter Rauhofer and Pound Boys (a.k.a. Mayhem &amp; Craig C.) also remixed &quot;It's like That&quot;, but their remixes were not released. Because many singles by 2005 did not have commercial CD single releases, the remixes were only released on twelve-inch vinyl maxi single. Two maxi singles were released.\n\nThe single's music video was directed by Brett Ratner, who directed some of Carey's other videos. Initially, Carey had wanted Paul Hunter to direct the video. Carey, a close friend of Ratner, was reluctant at first because Ratner had stopped directing videos for the most part, but after hearing a proposed treatment, she approved. The main setting of the video, which was shot on location at Greystone Park Mansion in Beverly Hills, California, is a party at a mansion turned nightclub on the night before Carey's character's wedding to Eric Roberts. Several guests are seen wearing masks, and there are celebrity cameo appearances by Brian McKnight, Randy Jackson, and the two featured rappers on the track, Dupri and Fatman Scoop. Carey is singing along to Fatman Scoop's outro rap when she sees a party guest (played by Wentworth Miller) taking off his mask and revealing himself to be an ex-lover of hers. The video ends on a cliffhanger, which leads to the video for the album's second single, &quot;We Belong Together&quot; (the two videos were filmed simultaneously).\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:e2f08dafb3dcaaed4601d78a84d66297c74788c3","amp;dn":"Mariah+Carey+-+It%5C%27s+Like+That+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2f08dafb3dcaaed4601d78a84d66297c74788c3","infoHashBuffer":{"type":"Buffer","data":[226,240,141,175,179,220,170,237,70,1,215,138,132,214,98,151,199,71,136,195]},"announce":[],"urlList":[]}}