{"title":"Paul McKenna - Instant Confidence","uid":4022679,"size":38914176,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e336156783b19874a0f7dd9261b67720b421d17e&amp;dn=Paul+McKenna+-+Instant+Confidence&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"prince213","files":1,"time":1202746683,"description":"Would you like to have the confidence to go for anything you want in life? Paul McKenna Ph.D. is the world's leading hypnotist and Britain's most successful self-improvement author. In this groundbreaking new book, he reveals the secrets of mastering your emotions and living with a greater sense of ease and certainty than ever before. You will learn how to push the 'off' switch for fear and desperation and create massive amounts of confidence and motivation in just a few moments. Before you've even finished the book, your whole attitude to life will begin to change for the better! Would you like to feel strong in difficult situations? Whether you want to feel totally confident in business, romance, or any other area of your life, Paul will walk you step by step through a series of simple yet powerful techniques normally only available to his private clients and seminar attendees. In addition, the book contains a mind-programming CD which uses the latest psychological techniques to fill your mind with positive thoughts and feelings. Each time you listen, you will be re-enforcing positive optimism and programming your mind for success. If you're ready to feel completely comfortable in yourself and finally achieve what you are truly capable of, this CD is for you!\n\nVisit http://prince213.blogspot.com/ for more...","torrent":{"xt":"urn:btih:e336156783b19874a0f7dd9261b67720b421d17e","amp;dn":"Paul+McKenna+-+Instant+Confidence","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e336156783b19874a0f7dd9261b67720b421d17e","infoHashBuffer":{"type":"Buffer","data":[227,54,21,103,131,177,152,116,160,247,221,146,97,182,119,32,180,33,209,126]},"announce":[],"urlList":[]}}