{"title":"Best Picture - 1946 - The Best Years of Our Lives (Fredric March","uid":6781851,"size":1501768670,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e34868d10733a6515f679089c60b9f18aa0ce3de&amp;dn=Best+Picture+-+1946+-+The+Best+Years+of+Our+Lives+%28Fredric+March&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1319931110,"description":"Best Picture - 1946 - The Best Years of Our Lives (Fredric March, Dana Andrews) \n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 952kbps \nDuration.............: 2:49:58\nResolution...........: 600*452 \nFramerate............: 23.976 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 192 kbps CBR \nAudio Channels.......: 2 \nFilesize.............: 1,472,768,852 \nSubtitles............: Spanish, French\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0036868/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0036868/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Best_Years_of_Our_Lives&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Best_Years_of_Our_Lives&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/cAkHeAadL&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/cAkHeAadL&lt;/a&gt;\n\n\nAmazon.com\n\nWinner of seven Academy Awards, including best picture, director, actor, and screenplay, William Wyler's brilliant drama about domestic life after World War II remains one of the all-time classics of American cinema. Inspired by a pictorial article about returning soldiers in Life magazine, the story focuses on three war veterans (Fredric March, Dana Andrews, and Harold Russell in unforgettable roles) and their rocky readjustment to civilian life in their Midwestern town of Boone City. Capturing the contradictory moods of America in the mid to late 1940s, this three-hour drama spans a complex range of honest emotions, from joyous celebration and happy reunion to deep-rooted ambivalence and reassessment of personal priorities. A movie milestone when released in 1946, The Best Years of Our Lives still packs a punch with powerful, timeless themes. --Jeff Shannon\n\nProduct Description\n\nIt's the hope that sustains the spirit of every GI: the dream of the day when he will finally return home. For three WWII veterans, the day has arrived. But for each man, the dream is about to become a nightmare. Captain Fred Derry (Dana Andrews) is returning to a loveless marriage; Sergeant Al Stephenson (Fredric March) is a stranger to a family that's grown up without him; and young sailor Homer Parrish (Harold Russell) is tormented by the loss of his hands. Can these three men find the courage to rebuild their world? Or are the best years of their lives a thing of the past? Featuring a brilliant cast that includes Myrna Loy and Virginia Mayo, this postwar classic garnered* seven Oscars, including Best Picture. Heart-wrenching, touching and &quot;filled with emotional dynamite&quot; (The Hollywood Reporter), it remains &quot;one of the best films about war veterans ever made&quot; (American Movie Classics). *1946: Director, Actor, Supporting Actor, Writing/Screenplay, Film Editing, Music/Scoring of a Dramatic or Comedy Picture\n\nCast\n\nMyrna Loy as Milly Stephenson\nFredric March as Technical Sergeant Al Stephenson\nDana Andrews as Captain Fred Derry\nTeresa Wright as Peggy Stephenson\nVirginia Mayo as Marie Derry\nCathy O'Donnell as Wilma Cameron\nHoagy Carmichael as Uncle Butch\nHarold Russell as Petty Officer 2nd Class Homer Parish\nGladys George as Hortense Derry\nRoman Bohnen as Pat Derry\nRay Collins as Mr. Milton\nMinna Gombell as Mrs. Parish\nWalter Baldwin as Mr. Parish\nSteve Cochran as Cliff\nDorothy Adams as Mrs. Cameron\nDon Beddoe as Mr. Cameron\nCharles Halton as Prew\nRay Teal as Mr. Mollett\nErskine Sanford as Bullard\nVictor Cutler as Woody\n\nReception\n\nUpon its release, the film received extremely positive reviews from critics. Shortly after its premiere at the Astor Theater, New York, Bosley Crowther, film critic for The New York Times, hailed the film as a masterpiece. He wrote, &quot;It is seldom that there comes a motion picture which can be wholly and enthusiastically endorsed not only as superlative entertainment but as food for quiet and humanizing thought... In working out their solutions Mr. Sherwood and Mr. Wyler have achieved some of the most beautiful and inspiring demonstrations of human fortitude that we have had in films.&quot; He also said the ensemble casting gave the &quot;'best' performance in this best film this year from Hollywood.&quot;\n\nA contemporary critic, Dave Kehr, wrote,\n\n&quot;The film is very proud of itself, exuding a stifling piety at times, but it works as well as this sort of thing can, thanks to accomplished performances by Fredric March, Myrna Loy, and Dana Andrews, who keep the human element afloat. Gregg Toland's deep-focus photography, though, remains the primary source of interest for today's audiences.&quot;\n\nDavid Thomson offers tempered praise: &quot;I would concede that Best Years is decent and humane... acutely observed, despite being so meticulous a package. It would have taken uncommon genius and daring at that time to sneak a view of an untidy or unresolved America past Goldwyn or the public.&quot;\n\nNot everyone was as complimentary. The critic Manny Farber called it &quot;a horse-drawn truckload of liberal schmaltz.&quot;\n\nIn July 2010, the film has a 97% &quot;Fresh&quot; rating at Rotten Tomatoes, based on 36 reviews. The film enjoys a 100% &quot;Fresh&quot; rating on the site's &quot;Top Critics&quot; section, based on 8 reviews. Chicago Sun Times film critic Roger Ebert put the film on his &quot;Great Movies&quot; list in 2007, calling it &quot;...modern, lean, and honest.&quot;\n\nThe film was a massive popular success. When box office prices are adjusted for inflation, it remains one of the top 100 grossing films in U.S. history. Among films released before 1950, only Gone With the Wind, The Bells of St. Mary's and four Disney titles have done more total business, in part due to later re-releases. (Reliable box office figures for certain early films such as Birth of a Nation and Charlie Chaplin's comedies are unavailable.)","torrent":{"xt":"urn:btih:e34868d10733a6515f679089c60b9f18aa0ce3de","amp;dn":"Best+Picture+-+1946+-+The+Best+Years+of+Our+Lives+%28Fredric+March","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e34868d10733a6515f679089c60b9f18aa0ce3de","infoHashBuffer":{"type":"Buffer","data":[227,72,104,209,7,51,166,81,95,103,144,137,198,11,159,24,170,12,227,222]},"announce":[],"urlList":[]}}