{"title":"Superboy and Superman Cartoon Shorts + Film Serial","uid":9357975,"size":7274342702,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e416de950217bf59aa9b88a18c4f89d3ccf1185e&amp;dn=Superboy+and+Superman+Cartoon+Shorts+%2B+Film+Serial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MaxiDownloads","files":-1,"time":1387249059,"description":"Superboy and Superman Film Serials and Cartoons\n\nThis is a collection of cartoon shorts and serials that were produced for Superboy and Superman. There are four sets in all, which are described below. All of them are named for series, title, and episode name. Please be aware that the video and audio quality has several limitations, due to the fact that many of these come from television recordings on consumer equipment available at the time of broadcast. Sometimes the sound is mono with audio on only one side. However, this is a great vintage collection that any classic superman fan will enjoy. All videos are AVI and require DivX for video and AAC Audio. Please help keep these timeless treasures alive, many not available on DVD.\n\n\n\n1941 Superman Cartoon Shorts\n\nThe Fleischer &amp; Famous Superman cartoons are a series of seventeen animated Technicolor short films released by Paramount Pictures and based upon the comic book character Superman. The pilot and first eight shorts were produced by Fleischer Studios from 1941 to 1942, while the final eight were produced by Famous Studios, a successor company to Fleischer Studios, from 1942 to 1943. Superman was the final animated series initiated under Fleischer Studios, before Famous Studios officially took over production in May 1942\n\n\n\n1948 Superman Serial\n\nSuperman (1948) is a 15-part black-and-white Columbia film serial based on the comic book character Superman. It stars an uncredited Kirk Alyn(billed only by his character name, Superman; but credited on the promotional posters) and Noel Neill as Lois Lane. It is notable as the first live-action appearance of Superman on film and for the longevity of its distribution. The serial was directed by Thomas Carr, who later directed many early episodes of the Adventures of Superman television show, and Spencer Gordon Bennet, produced by Sam Katzman and shot in and around Los Angeles, California. It was originally screened at movie matines and after the first three scene-setting chapters, every episode ends in a cliffhanger. The Superman-in-flight scenes are animations, in part due to the small production budget. \n\n\n\n1950 Atom-Man vs. Superman Serial\n\nAtom Man vs. Superman (1950), Columbia's 43rd serial and the second live-action Superman screen appearance, both featuring Kirk Alyn as Superman, finds Lex Luthor (Lyle Talbot), secretly the Atom Man, blackmailing the city of Metropolis by threatening to destroy the entire community. Perry White (Pierre Watkin), editor of the Daily Planet, assigns Lois Lane (Noel Neill), Jimmy Olsen (Tommy Bond) and Clark Kent (Kirk Alyn) to cover the story. \n\n\n\n1961 Unaired Adventures of Superboy Pilot\n\nThe Adventures of Superboy is a proposed TV series that was put into production in 1961. It was meant to capitalize on the success of Adventures of Superman, which went out of production in 1957, but only a pilot episode (&quot;Rajah's Ransom&quot;) was produced. It featured the first non-comic book portrayals ever of Superboy and Lana Lang and stands as a forerunner of later series Superboy, which lasted four seasons and Smallville, which lasted ten seasons.\n\n\n\n1966 Superboy Cartoon\n\nThe Adventures of Superboy is a series of six-minute animated Superboy cartoons produced by Filmation that were broadcast on CBS between 1966 and 1969. The 34 segments appeared as part of three different programs during that time, packaged with similar shorts featuring The New Adventures of Superman other DC Comics superheroes. These adventures marked the animation debut of Superboy, as well as his teenage alter ego Clark Kent, who acted as the bespectacled, mild-mannered disguise for the young hero, Lana Lang, and Krypto the super-powered dog who would accompany his master on every dangerous mission. Other characters such as Pa and Ma Kent, foster parents of the Boy of Steel, and the town of Smallville were also faithfully recreated from comic book adventures. As a result of the production's budget, the show featured a great amount of stock animation as well as limited movement from the characters.\n\n--- ALSO ---\n\nDo you like oldies? Check out MaxiMusic! MaxiMusic is a collection of popular and rare oldies from the 1910-2000's. Either search &quot;MaxiMusic&quot; on The Pirate Bay, or head over to this link:\n   &lt;a href=&quot;\nhttp://thepiratebay.se/user/MaxiMusic/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/MaxiMusic/&lt;/a&gt;\t","torrent":{"xt":"urn:btih:e416de950217bf59aa9b88a18c4f89d3ccf1185e","amp;dn":"Superboy+and+Superman+Cartoon+Shorts+%2B+Film+Serial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e416de950217bf59aa9b88a18c4f89d3ccf1185e","infoHashBuffer":{"type":"Buffer","data":[228,22,222,149,2,23,191,89,170,155,136,161,140,79,137,211,204,241,24,94]},"announce":[],"urlList":[]}}