{"title":"Steve Berry - Het Venetiaans bedrog, NL Ebook(epub).DMT","uid":6848157,"size":1319832,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e4f00938c7af21133864a55a43ddb682eda43a56&amp;dn=Steve+Berry+-+Het+Venetiaans+bedrog%2C+NL+Ebook%28epub%29.DMT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Falco_bis","files":-1,"time":1322422147,"description":"Steve Berry - Het Venetiaans bedrog, NL Ebook(epub).DMT\n\n\nAuteur: Steve Berry\nPagina\\'s: 472\nUitgever: Vbk Media\njaar van uitgifte: 2010\ngenre: Thriller\n\n\nBeschrijving\n\nDe belangrijkste nalatenschap van de legendarische heerser Alexander de Grote is nog steeds het grootste mysterie aller tijden... In 323 voor Christus had Alexander de Grote zijn zinnen gezet op het veroveren van de Arabische wereld, toen hij ten prooi viel aan een mysterieus virus. Archeologen en schatzoekers zoeken al 1500 jaar naar zijn laatste rustplaats, waar zich volgens de legende een wonderbaarlijk genezend serum zou bevinden. Nadat hij op het nippertje aan de dood is ontsnapt tijdens een brand in een Deens museum, hoort Cotton Malone van zijn goede vriendin Cassiopeia Vitt dat dit het zoveelste incident in een reeks van brandstichtingen door heel Europa blijkt te zijn. Het spoor leidt naar een aantal voormalige sovjetrepublieken dat zich heeft verenigd in een nieuwe staat, die wordt bestuurd door de meedogenloze dictator Irina Zovastina. Zij heeft maar ÃƒÂ©ÃƒÂ©n verlangen: Alexander de Grote te overtreffen als de grootste veroveraar uit de geschiedenis. Om de wereldheerschappij te bemachtigen verzamelt ze de meest vernietigende bacteriÃƒÂ«le wapens, waarmee ze een biologische oorlog wil ontketenen. Ze is vooral geobsedeerd door het serum in de tombe van Alexander de Grote. Malone en Vitt stellen alles in het werk om Zovastina tegen te houden. Hun doel om een wereldwijde pandemie te voorkomen leidt hen via de Deense kust en de Venetiaanse paleizen naar het ruige berggebied in Centraal-AziÃƒÂ«. Er staat veel op het spel: de ontcijfering van het eeuwenoude mysterie rond het serum van Alexander de Grote zou miljoenen levens kunnen redden ? of verwoesten...\n\n\n\n\nDit boek wordt u aangeboden door:\n\nDUTCH MOVIE THEATER\n","torrent":{"xt":"urn:btih:e4f00938c7af21133864a55a43ddb682eda43a56","amp;dn":"Steve+Berry+-+Het+Venetiaans+bedrog%2C+NL+Ebook%28epub%29.DMT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4f00938c7af21133864a55a43ddb682eda43a56","infoHashBuffer":{"type":"Buffer","data":[228,240,9,56,199,175,33,19,56,100,165,90,67,221,182,130,237,164,58,86]},"announce":[],"urlList":[]}}