{"title":"BRAQUO Episode07 DutchReleaseTeam DVDRIP NLSubs","uid":8977050,"size":423760958,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e50977b63a5594c1c1a7783be25bfae5fd02af82&amp;dn=BRAQUO+Episode07+DutchReleaseTeam+DVDRIP+NLSubs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Recon06","files":4,"time":1380469082,"description":"BRAQUO Episode07 DutchReleaseTeam DVDRIP NLSubs\n\n[IMG]http://i19.photobucket.com/albums/b187/vivitronl/Het%20Multimedia%20Cafe%20Afbeeldingen/Serie%20Screenshot/Braquodvdcase.png[/IMG]\n\n\nBRAQUO\nDe grimmige misdaadthriller Braquo wordt het Franse antwoord op The Wire genoemd. \nBraquo volgt de gebeurtenissen van een Parijse politie-eenheid die telkens op het randje van het legale opereert en dus het nodige geweld en intimidatie niet schuwt. \nDe agenten worden opgeschrikt wanneer hun teamleader zelfmoord pleegt na valse beschuldigingen van corruptie\n\nDetails\nDe agenten Caplan, Morlighem, Vachewski en Roxane van het SDPJ zijn werkzaam in het departement Hauts-de-Seine, tussen Neuilly en Nanterre in chique wijken en in gebieden waar de wet niet telt. \nMaar hun leven verandert drastisch als hun collega, commandant Rossi, zelfmoord pleegt omdat hij onterecht wordt beschuldigd van corruptie. \nVanaf dat moment omzeilen ze de wet om de naam van hun vriend van alle blaam te zuiveren. Ze zitten gevangen in een dodelijk raderwerk en moeten hun huid redden en hun gezinnen beschermen. \nDoor de tegenwerking van hun meerderen en achtervolgd door de IGS (de politie van de politie) gaan ze tegen alle gevestigde regels in en staat hun leven in het teken van adrenaline, risico's, bloed en de dood. Braquo volgt deze gewone mannen op de voet en krijgt te maken met geweld en paranoia tijdens het uitoefenen van hun beroep als agent. Dubbelleven. Dubbele personaliteiten. De grens tussen Goed en Kwaad. Al snel na hun eerste zaak worden ze zich bewust van het aanhoudende gevaar en de risico's. \nVoor hen en voor hun gezinnen. Ze zijn zich bewust van hun gevaarlijke reis. Met als eindpunt: de gevangenis of de dood.\n\nCast: Jean-Hugues Anglade, Nicolas Duvauchelle &amp; Joseph Malerba\nGenre: Thriller\nFilming Locations: Paris, France\nTaal orig. Versie : Frans\nLanguage: French\nOndertiteling: Nederlands\nSubtitles: Dutch (Hardcoded)\n\n\n[url=http://www.imdb.com/title/tt1429534/][img]http://hetmultimediacafe.nl/images/afbeeldingen/imdb.png[/img][/url]\n\n[url=http://www.mijnserie.nl/braquo/][img]http://img375.imageshack.us/img375/8939/mijnserie.png[/img][/url]\n\n\nSeizoen 1, Aflevering 7\n( 2 oktober 2009)\nTangente\nLemoine's lawyer is found dead. The prosecutor says the investigation Vanderbeke to the Central Office for the Repression of Banditry, led by Commander Marceau. Eddy and his team must find the first mobster to avoid being compromised. During this hunt, the death of Rossi takes a new light when his wife, Helen, documents discovered in a secret safe. While Walter and Theo's friend questioned Lemoine, Eddy goes to one of his contacts to find it. But Commander Marceau managed to find Lemoine together the team of Eddy.\n\n\n[color=red][size=200][b]Please give a feedback[/b][/size][/color]\n\n\nDutchReleaseteam = Hardcoded Dutch Subs\nDeze serie wordt u aangeboden door het DutchReleaseTeam.\nVoor de reviews van de nieuwste films, muziek, series, games etc\nKom eens langs op http://www.hetmultimediacafe.be","torrent":{"xt":"urn:btih:e50977b63a5594c1c1a7783be25bfae5fd02af82","amp;dn":"BRAQUO+Episode07+DutchReleaseTeam+DVDRIP+NLSubs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e50977b63a5594c1c1a7783be25bfae5fd02af82","infoHashBuffer":{"type":"Buffer","data":[229,9,119,182,58,85,148,193,193,167,120,59,226,91,250,229,253,2,175,130]},"announce":[],"urlList":[]}}