{"title":"The Searchers - 30th Anniversary Collection 1962-1992","uid":4901791,"size":534285641,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e523af8d1e079eb4cc3db3d7c17544340c2d6c95&amp;dn=The+Searchers+-+30th+Anniversary+Collection+1962-1992&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Iron_Horse","files":98,"time":1242672783,"description":"The Searchers - 30th Anniversary Collection 1962-1992 (3 CD SET)\nCD (1992) To Mp3 320 mbit/s\nIncluded: CD Covers and this Info\n\nReview\tby Richie Unterberger  allmusic.com\nAlthough it's missing one or two fairly strong tracks, this three-CD, 84-song set is a pretty definitive collection of the group's best '60s material for those who want to go beyond the greatest hits. Besides including all of their key A- and B-sides, it has an entire disc of their best '60s album tracks. The rarities disc includes foreign-language versions, outtakes, mid-'60s BBC performances, and solo discs by Tony Jackson and Chris Curtis. Highlights here include an alternate take of &quot;Someday We're Gonna Love Again,&quot; a BBC version of &quot;Blowin' in the Wind,&quot; and the previously unreleased &quot;Once Upon a Time&quot; (recorded by Dusty Springfield).\n\n\nThe Searchers are a British rock band who emerged as part of the 1960s merseybeat scene along with The Beatles, The Swinging Blue Jeans, and Gerry &amp; The Pacemakers.\n\nThe band's hits included a remake of the Drifters' 1961 hit, &quot;Sweets for My Sweet&quot;; remakes of Jackie DeShannon's &quot;Needles and Pins&quot; and &quot;When You Walk In The Room&quot; &quot;Sugar and Spice&quot; &quot;Don't Throw Your Love Away&quot; and a remake of The Clovers' &quot;Love Potion No. 9&quot;. They were the second group from Liverpool after the Beatles to have a hit in America when &quot;Needles and Pins&quot; charted during the first week of March 1964.\n\nBand history\nOriginally founded as a skiffle group in Liverpool in 1959 by John McNally and Mike Pender, the band took their name from the classic 1956 John Wayne western The Searchers. Prendergast claims that the name was his idea, but McNally ascribes it to 'Big Ron' Woodbridge (born Ronald Woodbridge, 1938, in Liverpool, Lancashire), their first lead singer. The genesis remains unresolved.\n\nThe band grew out of an earlier skiffle group formed by McNally, with his friends Brian Dolan (guitar) and Tony West (bass). When the other two members lost interest McNally was joined by his guitarist neighbour Mike Prendergast. They soon recruited Tony Jackson (born Anthony Paul Jackson, 16 July 1938, The Dingle, Liverpool, Lancashire - died 18 August 2003, Nottingham, Nottinghamshire) with his home-made bass guitar and amplifier and styled themselves 'Tony and the Searchers' with Joe Kelly on drums. Kelly soon left to be replaced by Norman McGarry (born 1 March 1942, Liverpool, Lancashire), and it is this line-up - McNally, Pender (as he soon became known), Jackson and McGarry - that is usually cited as the original foursome.\n\nMcGarry did not stay long, however, and in 1960 his place was taken by Chris Crummey (who later changed his name to Curtis). Later that year Big Ron had a successful audition with Mecca and became a ballroom singer. He was replaced by Billy Beck, who changed his name to Johnny Sandon (born William Beck, in 1941, Liverpool died 23 December 1996). The band had regular bookings at Liverpool's Iron Door Club as 'Johnny Sandon and the Searchers'.\n\nSandon left the band in late 1961 to join The Remo Four in February 1962. The group settled into a quartet sharing the vocal lead and billed simply as 'The Searchers'. They continued to play at the Iron Door, The Cavern, and other Liverpool clubs. Like many similar acts they would do as many as three shows at different venues in one night. They negotiated a contract with the Star-Club in the St. Pauli district Hamburg for 128 days, with three one-hour performances a night, starting in July 1962.\n\nThe band returned to a residency at the Iron Door Club and it was there that they tape-recorded the sessions that led to a recording contract with Pye Records with Tony Hatch as producer. Their first single was issued in US on Mercury, the second on Liberty without success and then a deal was arranged with U.S. based Kapp Records to distribute their records in America.\n\nHatch played piano on some recordings and wrote &quot;Sugar and Spice&quot;-the band's second number one record-under the pseudonym Fred Nightingale; a secret he kept from the band at the time.\n\nAfter scoring with their hit &quot;Needles and Pins&quot;, bassist Tony Jackson was fired from the band and was replaced by Hamburg pal Frank Allen (born Francis Renaud McNeice, 14 December 1943, Hayes, Middlesex) from Cliff Bennett and the Rebel Rousers.\n\nChris Curtis left the band in 1966 and was replaced by the Keith Moon-influenced John Blunt, who in turn was replaced by Billy Adamson in 1970. In 1967, Curtis formed a new band called Roundabout with keyboard player Jon Lord and guitarist Ritchie Blackmore. Although Curtis's involvement in the project was short-lived, Roundabout would eventually evolve into Deep Purple the following year.\n\nAs musical styles evolved, the Searchers could not keep up and as a result, the hits ran out. While they continued to record for Liberty Records and RCA Records, they ended up on the British &quot;Chicken in a Basket&quot; circuit, although they did score a minor US hit in 1971 with &quot;Desdemona&quot;.\n\nThe group continued to tour through the 1970s and were rewarded in 1979 when Sire Records signed the band to a multi-record deal. Two albums were released: The Searchers and Play for Today (retitled Love's Melodies outside the UK). Both records garnered critical acclaim but did not break into the charts. They did, however, revive the group's career.\n\nAccording to John McNally, the band were ready to head into the studio to record a third album for Sire when they were informed that due to label reorganization, their contract had been dropped. It was, in fact, because so few people bought the second album, although it was beloved by fans.\n\nIn 1981, the band signed to PRT Records (formerly Pye, their original label) and began recording an album. But only one single, &quot;I Don't Want To Be The One&quot; backed with &quot;Hollywood&quot;, ended up being released. The rest of the tracks would be included as part of 2004's 40th Anniversary collection.\n\nSoon after the PRT release, Mike Pender left the group amidst great acrimony and now tours as Mike Pender's Searchers. McNally and Allan recruited former First Class vocalist Spencer James to fill Pender's shoes.\n\nIn 1988, Coconut Records signed The Searchers and the album Hungry Hearts was the result. It featured updated remakes of &quot;Needles and Pins&quot; and &quot;Sweets For My Sweet&quot; plus live favorite &quot;Somebody Told Me You Were Crying&quot;. While the album was not a major hit, it did keep the group in the public eye.\n\nThe band continues to tour with Eddie Rothe replacing Adamson on drums and is considered to be one of the most popular 1960s bands on the UK concert circuit. The Searchers incorporate full band electric performances with an acoustic set as well. Creating ample amounts of confusion, former Searchers lead singer Mike Pender also tours, but with his new full band electric outfit Mike Pender's Searchers, as they perform hits of the Searchers and some new material of their own.   &lt;a href=&quot; http://en.wikipedia.org/wiki/The_Searchers_(band)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://en.wikipedia.org/wiki/The_Searchers_(band)&lt;/a&gt;\n\nThe Searchers timeline\n1957-1959\nJohn McNally: Guitar, Vocals\nRon Woodbridge: Vocals\nBrian Dolan: Guitar\nTony West: Bass\nJoe Kennedy: Drums\n\n1960-Feb 1962\nJohn McNally: Rhythm Guitar, Vocals\nMike Pender: Lead Guitar, Vocals\nChris Curtis: Drums, Vocals\nTony Jackson: Bass, Vocals\nJohnny Sandon: Lead Vocals\n\nFeb 1962-July 1964\nJohn McNally: Rhythm Guitar, Vocals\nMike Pender: Lead Guitar, Vocals\nChris Curtis: Drums, Lead Vocals\nTony Jackson: Bass, Lead Vocals\n\nAugust 1964-April 1966\nJohn McNally: Rhythm Guitar, Vocals\nMike Pender: Lead Guitar, Vocals\nChris Curtis: Drums, Lead Vocals\nFrank Allen: Bass, Lead Vocals\n\nMay 1966-December 1969\nJohn McNally: Rhythm Guitar, Vocals\nMike Pender: Lead Guitar, Vocals\nFrank Allen: Bass, Lead Vocals\nJohn Blunt: Drums\n\nJanuary 1970-December 1985\nJohn McNally: Rhythm Guitar, Vocals\nMike Pender: Lead Guitar, Vocals\nFrank Allen: Bass, Lead Vocals\nBilly Adamson: Drums\n\nJanuary 1986-November 1998\nJohn McNally: Rhythm Guitar, Vocals\nFrank Allen: Bass, Lead Vocals\nBilly Adamson: Drums\nSpencer James: Lead Guitar, Lead Vocals\n\nNovember 1998-present\nJohn McNally: Rhythm Guitar, Vocals\nFrank Allen: Bass, Lead Vocals\nSpencer James: Lead Guitar, Lead Vocals\nEddie Roth: Drums\n\nDisc One: The Singles:\n01. Sweets For My Sweet - 1963\n02. It's All Been A Dream - 1963\n03. Sugar And Spice - 1963\n04. Needles And Pins - 1964\n05. Saturday Night Out - 1964\n06. Don't Thorw Your Love Away - 1964\n07. I Pretend I'm With You - 1964\n08. Someday Were Gonna Love Again - 1964\n09. No One Else Could Love Me - 1964\n10. When You Walk In The Room - 1964\n11. I'll Be Missing You - 1964\n12. What Have They Done To The Rain - 1964\n13. This Feeling Inside - 1964\n14. Goodbye My Love - 1965\n15. Till I Met You - 1965\n16. He's Got No Love - 1965\n17. So Far Away - 1965\n18. When I Get Home - 1965\n19. I'm Never Coming Back - 1965\n20. Take Me For What I'm Worth - 1965\n21. Too Many Miles - 1965\n22. Take It Or Leave It - 1966\n23. Don't Hide Away - 1966\n24. Have You Ever Loved Somebody - 1966\n25. It's Just The Way (That Love Will Come And Go) - 1966\n26. Popcorn Double Feature - 1967\n27. Westen Union - 1967\n28. I'll Cry Tomorrow - 1966\n29. Second Hand Dealer - 1967\n30. Crazy Dreams - 1967\n\nDisc Two: The Albums &amp; EP's\n01. Ain't Gonna Kiss Ya - 1963\n02. Love Potion No. 9 - 1963\n03. System - 1964\n04. Bumble Bee - 1965\n05. Where Have All The Flowers Gone? - 1963\n06. Alright - 1963\n07. Farmer John - 1963\n08. Since You Broke My Heart - 1963\n09. Tricky Dicky - 1963\n10. Listen To Me - 1963\n11. Hungry For Love - 1963\n12. Ain't That Just Like Me - 1963\n13. Don't Cha Know  (Don't You Know - 1963)\n14. All My Sorrows - 1963\n15. It's In Her Kiss - 1964\n16. Sea Of Heartbreak - 1964\n17. I Count The Tears - 1964\n18. This Empty Space - 1964\n19. Can't Help Forgiving You - 1964\n20. Sho' Know A Lot About Love - 1963\n21. Magic Potion - 1965\n22. Till You Say You'll Be Mine - 1965\n23. I Don't Want To Go On Without You - 1965\n24. A Tear Fell - 1965\n25. If I Could Find Someone - 1965\n26. It's Time - 1965\n27. I'll Be Doggone - 1965\n28. Each Time - 1965\n29. You Can't Lie To A Liar - 1965\n30. Four Strong Winds - 1965\n\nDisc Three: The Rarities\n01. Tausend Nadelstiche (Needles &amp; Pins) - 1991\n02. Sub Ist Sie (Sugar And Spice) - 1991\n03. Bye Bye Johnny - 1992\n04. I Don't Want To Go On Without You - 1965\n05. I (Who Have Nothing) - 1992\n06. Shame, Shame, Shame - 1992\n07. Someday We're Gonna Love Again [Alternate Take] - 1992\n08. Verzeih' My Love (Goodbye My Love) - 1991\n09. I'll Be Doggone [Alternate Take] - 1992\n10. Once Upon A Time - 1992\n11. Sweet Little Sixteen [Live] - 1996\n12. Blowin' In the Wind [Live] - 2004\n13. See See Rider/Jenny Take A Ride [Live] - 2004\n14. Goodbye, So Long [Live] - 2004\n15. I'll Be Loving You [Live] - 2004\n16. I Don't Believe [Live] - 2004\n17. Stage Door - Tony Jackson (The Tony Jackson Group) - 1965\n18. Watch Your Step - Tony Jackson (Tony Jackson &amp; The Vibrations) - 1964\n19. Aggravation - Chris Curtis - 1966\n20. Innocent Victim - 1992\n21. A Good Way To Fall - 1992\n22. New Heart - 1992\n23. I Don't Want To Be The One - 1992\n24. Hollywood  - 1982\n","torrent":{"xt":"urn:btih:e523af8d1e079eb4cc3db3d7c17544340c2d6c95","amp;dn":"The+Searchers+-+30th+Anniversary+Collection+1962-1992","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e523af8d1e079eb4cc3db3d7c17544340c2d6c95","infoHashBuffer":{"type":"Buffer","data":[229,35,175,141,30,7,158,180,204,61,179,215,193,117,68,52,12,45,108,149]},"announce":[],"urlList":[]}}