{"title":"[1987] Breakfast Club - Breakfast Club [CDRip - flac]","uid":5328031,"size":268350984,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e55a499e2427080ce9671fb8a06c6f11899c4634&amp;dn=%5B1987%5D+Breakfast+Club+-+Breakfast+Club+%5BCDRip+-+flac%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ddawg","files":-1,"time":1265081115,"description":" &lt;a href=&quot;http://g-ecx.images-amazon.com/images/G/01/ciu/bd/a9/ea7a808a8da0db83708e5110.L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://g-ecx.images-amazon.com/images/G/01/ciu/bd/a9/ea7a808a8da0db83708e5110.L.jpg&lt;/a&gt;\n\n\nTitle: Breakfast Club\nArtist: Breakfast Club \nAudio CD (August 26, 1988) \nOriginal Release Date: 1987 \nNumber of Discs: 1\nGenre: pop\nFormat: flac\n\n\nTrack Listing:\n\n01. Never Be The Same \n02. Right On Track \n03. Kiss And Tell \n04. Always Be Like This \n05. Rico Mambo \n06. Expressway To Your Heart \n07. Specialty \n08. Standout \n09. Tongue Tied \n \n\nAllmusic Biography:\nDespite releasing just one album over a decade together, Breakfast Club will always have a place in the history books as the band that featured two of Madonna's ex-boyfriends -- drummer Stephen Bray and singer Dan Gilroy -- as well as the Material Girl herself, for a short time in her pre-fame days. The New York-based group formed in the late '70s, around the core of Gilroy and his guitarist brother, Ed. By 1979, the lineup featured bassist Angie Schmit and Madonna on drums, but Madonna left after reportedly angling for the lead vocalist's job. She would next go on to form her own band, Emmy, with her old Michigan friend Bray as the drummer and Gary Burke (who was also playing at the same time with the Gilroys) on bass. Madonna eventually began marketing herself as a solo act in the early '80s, armed with songs she and Bray had co-written, and that spelled the end of Emmy. But after the group dissolved, Bray joined the Gilroys and Burke in Breakfast Club, and the quartet signed to Ze Records. Despite Madonna's escalating stardom and the obvious chance at some residual success for Breakfast Club, no recordings surfaced, however, and the group later signed with MCA. The band's eponymous first album was released in early 1987, preceded by the Top 40 hit &quot;Right on Track.&quot; Dan Gilroy and Bray wrote most of the nine songs and Bray also added his production expertise to several of the catchy pop and R&amp;B numbers, but his golden touch with Madonna (for whom he'd co-written and produced several hits) didn't quite carry over. Two further singles, &quot;Never Be the Same&quot; and a cover of the old Gamble-Huff composition &quot;Expressway to Your Heart,&quot; dented the lower reaches of the charts, but the band's second album wasn't released and Breakfast Club broke up shortly afterward. \n \n\nAllmusic Review:\nMadonna was a former member of the New York-based dance-rock combo Breakfast Club, but she was already several years into her own highly successful solo career by the time her former band's eponymous major-label debut hit the shelves in 1987. Breakfast Club includes the engaging single &quot;Right on Track,&quot; the band's only Top Ten hit. The Latin-tinged &quot;Rico Mambo&quot; is another highlight, but the rest of the album is an utterly disposable collection of lightweight pop. Vocalist Dan Gilroy is a weak leader, and lackluster arrangements make most of the tracks on Breakfast Club indistinguishable from one another. Breakfast Club's success was short-lived, and the band never released a second album. Drummer Stephen Bray continued to collaborate with his former bandmate Madonna, co-writing and producing many of her biggest hits, including &quot;Into the Groove,&quot; &quot;Express Yourself,&quot; and &quot;Keep It Together.&quot; \n \n","torrent":{"xt":"urn:btih:e55a499e2427080ce9671fb8a06c6f11899c4634","amp;dn":"%5B1987%5D+Breakfast+Club+-+Breakfast+Club+%5BCDRip+-+flac%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e55a499e2427080ce9671fb8a06c6f11899c4634","infoHashBuffer":{"type":"Buffer","data":[229,90,73,158,36,39,8,12,233,103,31,184,160,108,111,17,137,156,70,52]},"announce":[],"urlList":[]}}