{"title":"Yoga Warrior Fitness System","uid":12074903,"size":5096940540,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e5a9e50e4c9fbcdedb7cc5218cf2259e974faf8b&amp;dn=Yoga+Warrior+Fitness+System&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MrTVGuy","files":55,"time":1435613128,"description":"Yoga Warrior 365 with Rudy Mettia Workout Program\n\nAbout the Classes\n\nThe Gathering - It is always good to start a journey with intention. The gathering is the beginning of the program.\n\nVersatile Warrior V- This class is a little bit of everything. It is intended to be the first of twelve yoga practices that you cycle through.\n\nResponsible Warrior - Also known as shouldering responsibility this class is all about strengthening and opening the shoulder girdle.\n\nFreed Warrior - Explore the femur bones, hip sockets, glutes, quadriceps and hamstrings as you gently touch and take care of those areas.\n\nFluid Warrior - The Fluid Warrior is a dynamic moving meditation.\n\nGentle Warrior - Use this class as early and as often as you need. This class is intended to promote healing and well being.\n\nFocused Warrior - The Focused Warrior is a class devoted to balancing postures. Use the breath to keep you balanced. Honed Warrior - You will go through four distinct sequences with each one adding an extra pose. This is one of the more challenging classes.\n\nStalking Warrior - By learning how to lift the hip points and soften the front ribs it allows us to move through each pose with grace and power.\n\nSeeking Warrior - The seeking warrior is one of the more philosophical of the practices as Rudy walks you through the five doorways.\n\nCoiled Warrior - Twisting by nature is detoxifying so make sure you come into the practice with an empty stomach and drink plenty of water.\n\nCompassionate Warrior - Our daily patterns are mainly forward moving and we tend to sit at our computers or desks hunched over.\n\nReturning Warrior - Every pose wants to get back to mountain pose and its fitting that this is the last of the yoga classes you will do in this program.\n\nBonus\n\nIncludes Modified Warrior, Mountain Warrior and Rudy's Musings (an exploration of Rudy's philosophy). Includes the Program Guide &amp; 36 Pose Tutorials\n\nAbout the Actor\nThrough a lifetime of exploration and a serious dedication to the practice of yoga, Rudy has developed a unique yet insightful way of teaching yoga. Combining the attention to detail of Iyengar and the powerful flow of Pattabhi Jois, Rudy s power yoga based practice will both challenge and heal your body. If you are an experienced practitioner or brand new to the practice, Rudy is the perfect teacher to for every level. He is a top yoga instructor in LA with Over 10,000 classroom hours of teaching","torrent":{"xt":"urn:btih:e5a9e50e4c9fbcdedb7cc5218cf2259e974faf8b","amp;dn":"Yoga+Warrior+Fitness+System","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5a9e50e4c9fbcdedb7cc5218cf2259e974faf8b","infoHashBuffer":{"type":"Buffer","data":[229,169,229,14,76,159,188,222,219,124,197,33,140,242,37,158,151,79,175,139]},"announce":[],"urlList":[]}}