{"title":"Love is the Drug by Alaya Dawn Johnson (retail) {dwg}","uid":11315865,"size":31443233,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e615d812299dc0713987316fac9efea8aaddc2f5&amp;dn=Love+is+the+Drug+by+Alaya+Dawn+Johnson+%28retail%29+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"gratefuldawg77","files":6,"time":1414550665,"description":"From the author of THE SUMMER PRINCE, a novel that's John Grisham's THE PELICAN BRIEF meets Michael Crichton's THE ANDROMEDA STRAIN set at an elite Washington D.C. prep school.\n\nEmily Bird was raised not to ask questions. She has perfect hair, the perfect boyfriend, and a perfect Ivy-League future. But a chance meeting with Roosevelt David, a homeland security agent, at a party for Washington DC's elite leads to Bird waking up in a hospital, days later, with no memory of the end of the night.\n\nMeanwhile, the world has fallen apart: A deadly flu virus is sweeping the nation, forcing quarantines, curfews, even martial law. And Roosevelt is certain that Bird knows something. Something about the virus--something about her parents' top secret scientific work--something she shouldn't know.\n\nThe only one Bird can trust is Coffee, a quiet, outsider genius who deals drugs to their classmates and is a firm believer in conspiracy theories. And he believes in Bird. But as Bird and Coffee dig deeper into what really happened that night, Bird finds that she might know more than she remembers. And what she knows could unleash the biggest government scandal in US history","torrent":{"xt":"urn:btih:e615d812299dc0713987316fac9efea8aaddc2f5","amp;dn":"Love+is+the+Drug+by+Alaya+Dawn+Johnson+%28retail%29+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e615d812299dc0713987316fac9efea8aaddc2f5","infoHashBuffer":{"type":"Buffer","data":[230,21,216,18,41,157,192,113,57,135,49,111,172,158,254,168,170,221,194,245]},"announce":[],"urlList":[]}}