{"title":"iTheme Themes for iPhone iPad and iPod Touch v4.4","uid":9843355,"size":36626354,"categoryP":"applications","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:e674e0a790522f1c02c45beec89ead1547b9356b&amp;dn=iTheme+Themes+for+iPhone+iPad+and+iPod+Touch+v4.4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Logandros","files":1,"time":1396029092,"description":"**WARNING** Requires a Jailbroken IOS device. - Search Google or Start here for information:\n\n\nCategory: Lifestyle\nUpdated: Mar 20, 2014\nVersion: 4.4\nSize: 38.4 MB\nLanguages: English, Arabic, Croatian, Czech, Dutch, French, German, Greek, Hebrew, Hindi, Indonesian, Italian, Japanese, Malay, Polish, Portuguese, Russian, Simplified Chinese, Spanish, Traditional Chinese, Turkish\n\nCompatibility: Requires iOS 5.0 or later. Compatible with iPhone, iPad, and iPod touch. This app is optimized for iPhone 5.\n\nDescription\n*** INCREDIBLE STYLING *** New themes added all the time *** GET IT NOW!! *** \n\n** iOS 7 compatible! **\n\n*** New version - lots of improvements ***\n- new and cleaner interface\n- more themes - now more than 500 themes on the iPhone/iPhone touch, more than 400 on the iPad \n- full screen preview on the iPhone &amp; iPod Touch\n- adjust saturation, brightness and contrast of each theme. \n- view all themes sorted by artist\n\nEach of our themes consists of a lock screen and a home screen - \ntheir designs match and transform your interface in a unique and superb way. \nTry it now. ItÎ“Ã‡Ã–s a cool and new experience. \n\n*** It's the best iTheme ever *** \n\niTheme is an universal app - compatible with iPhone, iPod Touch and now also the IPAD! \n\nTheme Editor included: Edit each theme to make it suit your taste! Infinite possibilities! \n\nChange the Lock Screen \n- Choose your favorite part of the original artwork, change Colors, add Calendars and other Overlays. \nChange the Home Screen \n- Change Colors, add Frames, Bookshelves and Special Effects \n\nMake your own, unique themes! With iTheme it's a snap! \n\nStyle your iPhone, iPad and iPod Touch with stunning and custom designed backgrounds! \n\nMore than 500 great themes included (More than 400 for the iPad, for iOS 7 about 150 themes yet, but we are uploading more daily). All kinds of designs - check out the screenshotsÎ“Ã‡Âª \nAll themes are available in Retina Resolution! \n\nWhat's New in Version 4.4\nBig Update: \nWith this version we introduce parallax detection for iTheme. \nNow iTheme is providing perfect fitted themes no matter if you enabled or disabled the &quot;Reduce motion&quot; option.\n\nWe also added new additional premium categories for you if you still want more themes (soon available in 'Add-ons')","torrent":{"xt":"urn:btih:e674e0a790522f1c02c45beec89ead1547b9356b","amp;dn":"iTheme+Themes+for+iPhone+iPad+and+iPod+Touch+v4.4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e674e0a790522f1c02c45beec89ead1547b9356b","infoHashBuffer":{"type":"Buffer","data":[230,116,224,167,144,82,47,28,2,196,91,238,200,158,173,21,71,185,53,107]},"announce":[],"urlList":[]}}