{"title":"Three Seeds","uid":6825624,"size":96780056,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e7a2ed9f13b7ed85621a665245338d9dc51e35c9&amp;dn=Three+Seeds&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EdLMack","files":11,"time":1321550559,"description":"from Wikipedia:\n\nFormed around 1990 by high school friends Damon Mitchell (lead vocals, guitar, harmonica), Jeff Hondubura (guitar, vocals), Sky Onosson (bass, vocals, keyboards) and Jason Kane (drums, percussion) started playing blues-influenced rock.\n\nReleases\n\nAfter releasing two independent albums, Experience is Lost and The Blue Meanies, they toured extensively throughout Western Canada in the early 1990s. In 1996 the band signed with Virgin Records. The band changed its name to the New Meanies due to the existence of another Blue Meanies based in Chicago, and recorded a new album Three Seeds in the Los Angeles area with producer Howard Benson. The album was released in 1998, and the single &quot;Letting Time Pass&quot; achieved major airplay on radio and television. In 2000, the band went indie again and released a new album, Highways, in 2001.\n\nCurrent status\n\nThe New Meanies are currently only performing sporadically.\n____________________\n\nFrom Your Uncle Ed:\n\nIt was a late summer's day and I was working in the cafeteria of a big steel plant, and the song Letting Time Pass came over the radio. They ended up playing the hell out of the song that summer, but I do remember it as being one of the last great summers for radio rock. Gorgeous song, but not the only song worth hearing on there. The title track is a great rip-roaring rocker, and the heaviest number I can think of is a piece called Hamster Wheel. I don't know how I can describe this stuff to you, but it's just a little slice of perfectly made Canadian Rock. Give it a try.\n\nAnd of course, if you ever come across a copy selling in stores, feel free to donate to the cause.","torrent":{"xt":"urn:btih:e7a2ed9f13b7ed85621a665245338d9dc51e35c9","amp;dn":"Three+Seeds","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7a2ed9f13b7ed85621a665245338d9dc51e35c9","infoHashBuffer":{"type":"Buffer","data":[231,162,237,159,19,183,237,133,98,26,102,82,69,51,141,157,197,30,53,201]},"announce":[],"urlList":[]}}