{"title":"[80's Rock/Pop] Curiosity Killed The Cat - GETAHEAD","uid":3553943,"size":54517511,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e7b1f5371a69e8e147a5b7ae42360c7aba2d8f86&amp;dn=%5B80%5C%27s+Rock%2FPop%5D+Curiosity+Killed+The+Cat+-+GETAHEAD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xenu dot net","files":12,"time":1163029713,"description":"Curiosity Killed the Cat was a British band who found success in the UK Singles Chart in the late 1980s and early 1990s.\n\nThey played soulful, funky pop jazz and were initially signed to Phonogram Records&amp;#039; Mercury imprint. The first came to notice of the UK music press when they hooked up with photographer Andy Warhol for the video of the 1986 single &quot;Misfit&quot;. This featured the band in New York and at one point featured frontman Ben Volpeliere-Pierrot dancing down a side street whilst Andy Warhol referenced Bob Dylan&amp;#039;s &quot;Subterranean Homesick Blues&quot; by dropping pieces of white card in time to the music (an effect that would also be copied by INXS in the video for their track Mediate of 1988).\n\nTheir debut album Keep Your Distance entered the UK Albums Chart at number one in May 1987, and stayed in the Top Ten for 13 weeks, however the release of that album&amp;#039;s &quot;Free&quot; as a single lost some of the momentum by limping to only Number 56 in the singles chart.\n\nThe band&amp;#039;s second album Getahead was lead by an upbeat funky track called &quot;Name and Number&quot;. Even though this record only reached Number 14 in 1989, the &quot;Hey How You Doin&amp;#039;&quot; refrain would find itself in the Top Ten two years later as part of the De La Soul song &quot;Ring Ring Ring (Hey Hey Hey)&quot;.\n\n\n    * Volpierre-Pierrot was best known for wearing a Frank Spencer-style beret in most pictures of the band. He later revealed it was in fact a peaked fisherman&amp;#039;s hat, turned round with the peak to the rear so that it resembled a beret.\n\n    * Like Wet Wet Wet, the band had an additional &amp;#039;fifth member&amp;#039; called Toby Anderson. However unlike that Scottish band, Toby Anderson was a &amp;#039;mystery member&amp;#039; and the band was accused of not only hiding Toby due to his looks but also being a front for his writing as in the case of The Brothers credit for Bros.\n\n    * On Name and Number the band and co-writer get writing credits, however on De La Soul&amp;#039;s &quot;Ring Ring Ring&quot; only the co-writer gets a credit even though it utilises the chorus of the Curiosity song.\n\t\t\n\nKids, always rembember Xenu is your friend.\nwww.xenu.net\n\n","torrent":{"xt":"urn:btih:e7b1f5371a69e8e147a5b7ae42360c7aba2d8f86","amp;dn":"%5B80%5C%27s+Rock%2FPop%5D+Curiosity+Killed+The+Cat+-+GETAHEAD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7b1f5371a69e8e147a5b7ae42360c7aba2d8f86","infoHashBuffer":{"type":"Buffer","data":[231,177,245,55,26,105,232,225,71,165,183,174,66,54,12,122,186,45,143,134]},"announce":[],"urlList":[]}}