{"title":"RABBIT IN THE MOON - DECADE - dvdrip - [A10-V10] repack","uid":4577689,"size":723154893,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e856bdbca0c13bf0b1cf99201b4c1f0dea42d686&amp;dn=RABBIT+IN+THE+MOON+-+DECADE+-+dvdrip+-+%5BA10-V10%5D+repack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bassfreq","files":4,"time":1229291940,"description":"=====================\n~:=QUALITY KONTROL=:~\n=====================\n\n*for those who have gotten stuck at 98% here is a re-packed RAR of the same torrent. happy holidaze\n\nDO YOUR PART AND SEED\n\n\nMOVIE\nRabbit in the Moon\n- DECADE - dvdrip - [A10-V10]\n\nTYPE\nDVD compressed to AVI\nSIZE 700 mb\n\nIMAGE\nwidth: 608px\nheight: 336px\n\nAUDIO\nduration: 1:17:50\nbitrate: 128 kbps\nformat: MPEG layer-3\n\nVIDEO:\nframe rate: 29 fps\ndata rate\n: 1226 kbps\n\n\nDESC.\nElectronica\nheroes Rabbit in the Moon have been ravaging the dance clubs for nearly 15 years now, ever since their &quot;Out-of-Body Experience&quot; single shook the rafters back in 1993. So shouldn't this compilation be called 14 Years instead of Decade? Well, it would if the original were featured on this collection, but instead it's a more recent remix, signaled by the slightly altered title &quot;Outer Body Experience.&quot; Jokes aside, the original duo of Confucius and DJ Monk, and Bunny of course, batted out a slew of heavy-hitting 12&quot; singles and remixes down through the years, with their live appearances heralded by fans with all the fervor of the Second Coming. Positioning themselves around the outer edge of hard house and the inner edge of trance, the pulsating rhythms that drove these numbers are what set dancers' blood pumping, but it was the group's disdain for conventions, musical or otherwise, that pricked up the ears. Featuring the odd new song (notably a phenomenal cover of David Bowie's &quot;Let's Dance&quot;), old numbers, and remixes, this set is missing enough crucial fan faves to negate a &quot;best-of&quot; tag. Still, as a broad overview, or even an introduction, Decade does the job with style. RITM's determined efforts to move dance music far beyond its straitjacketed house confines is evident throughout the set, so much so that some of the older numbers sound almost generic and hackneyed today. With their dizzying displays of genre bending -- tossing in psychedelic space effects, harsh industrial sounds, nods to the new wave, infectious melodies, creative vocal samples, grimy atmospheres, and hands-in-the-air auras\n, this Rabbit was a continually moving target, with music rarely running a smooth course and unexpected shifts the signature mark. Since they have always been a highly visual live act, the DVD is intrinsic to this set, featuring live performances and music videos of CD tracks plus videos for &quot;Hypno Conejo,&quot; &quot;God Shiva,&quot; and &quot;Eye Transformer.&quot; Rabbit's\npower to ocularly amaze may have dissipated somewhat with time, but this disc is a heady reminder of how the group helped transform the entire dance scene. So, a best-of set still awaits, but even so, Decade is a fine tribute to one of electronica's most inspiring and inspired acts.\n\ndont forget to seed!!!!\n\ncomplete the circle.... each one teach one. ","torrent":{"xt":"urn:btih:e856bdbca0c13bf0b1cf99201b4c1f0dea42d686","amp;dn":"RABBIT+IN+THE+MOON+-+DECADE+-+dvdrip+-+%5BA10-V10%5D+repack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e856bdbca0c13bf0b1cf99201b4c1f0dea42d686","infoHashBuffer":{"type":"Buffer","data":[232,86,189,188,160,193,59,240,177,207,153,32,27,76,31,13,234,66,214,134]},"announce":[],"urlList":[]}}