{"title":"Storie di caserma 2  (La pute du general 2 (1999) DVDRip","uid":12176024,"size":723762341,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e886bb921fbe94f388b3e6189869a4505837f617&amp;dn=Storie+di+caserma+2++%28La+pute+du+general+2+%281999%29+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Ctrlme","files":3,"time":1438312788,"description":"Storie di caserma 2  (La pute du general 2 (1999) DVDRip\n-----------------------------------------\nScreenshot(s):     &lt;a href=&quot;\nhttp://imgclover.com/image/E8t&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclover.com/image/E8t&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgclover.com/image/E8u&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclover.com/image/E8u&lt;/a&gt;\n\nAn angelic DOLL FACE named Sharon (Sandy Summers) listens as her mother (Nina Hartley) and stepfather Ken (Eric Edwards) make love all night. Four years later, she arrives at Ken's San Francisco doorstep, invading his new life with Rita (Maggie Randall), since she can no longer get along with her real mom.\n\nTrying to get her mind off her ex-stepfather's love plunger (she now watches instead of just listens), she takes in a sleazy San Francisco North Beach sex show and on a second trip becomes a willing part of the &quot;audience participation&quot;. As the story unfolds, you will be drawn into a compelling web of suspense that centers on Sharon's introduction to the world of sex. Is she an innocent waif or a conniving manipulating minx with a haunting secret?\n\nDOLL FACE fills up the storybook pages of your mind and supplies the combination of tension and heat that discriminating viewers demand.\n\ninfo\nResolution: 720x480\nRelease Date: 1986\nStudio: Metro\n\ncast\nLili Marlene, Maggie Randall, Nina Hartley, Sandy Summers, Don Fernando, Eric Edwards, Jason Jules (as Jason Powell), Joey Silvera\n\ndetails\nDetails from IAFD.\n\nScene 1. Nina Hartley, Eric Edwards\nScene 2. Maggie Randall, Eric Edwards\nScene 3. Lili Marlene, Jason Jules\nScene 4. Maggie Randall, Eric Edwards\nScene 5. Sandy Summers, Eric Edwards\nScene 6. Maggie Randall, Sandy Summers\nScene 7. Lili Marlene, Sandy Summers, Jason Jules\nScene 8. Nina Hartley, Don Fernando\nScene 9. Sandy Summers, Joey Silvera\n\nScene 1...Nina fucks Eric in their bedroom while Sharon listens in the next room. This sets the tone for the story. Nina is looking very hot in purple lingerie. She tackles Eric and then starts sucking him off. Eric then bends Nina over and starts licking and fingering her pussy from behind. They then fuck doggystyle, lying doggystyle with one of Nina's legs spread out, power missionary, and finish with a short reverse cowgirl with him cumming on her pubes. Nina turns over quickly to lick up the cum. Nina always great to watch. Love how aggressive she is throughout this scene. This was a pretty good scene with nice chemistry. Could have been longer though. 6 minute sex scene.\n\nScene 2...Maggie and Eric fuck in their bedroom with Sandy listening and then watching them. I found this to be a cold fuck. I couldn't tell if they were still in character or not. They start with a little foreplay with Eric licking her from behind. They then fuck doggystyle, missionary, sitting cowgirl, and finish in power missionary with a cumshot on the stomach. No real chemistry between the two to me. 9 very long minutes.\n\nScene 3...Sandy visits a live sex show and watches Lili Marlene give a blowjob with deep-throating to Jason Powell. Jason is wearing a hideous mask. As much as I like Lili, this was fast forward material. 4 minute sex scene.\n\nScene 4...Maggie and Eric go at it again with both a little more spirited, but still not really into it. Sandy is listening to them again. She gives him a weak blowjob, then they do it missionary again with a similar cumshot. 3 minute intercut sex scene.\n\nScene 5...Sandy fantasizes that she's fucking Eric while Eric's actually fucking Maggie. This scene is intercut with scene 4. There was a lot of sexual tension between these two characters throughout the movie. Sandy has a quiet intensity to her that plays perfectly for this pairing. Pounding music is played over their brief sex scene beautifully. The intensity between the two was perfect. She looked like she felt and enjoyed ever stroke. The intercut scene between Maggie and Eric was a little harder and faster then this one, but this one was way more believable. Unfortunately no cumshot, but a very impressive 3 minute intercut scene.\n\nScene 6...Sandy seduces Maggie in the bedroom. I'm not trying to pick on Maggie, but again she doesn't look into it. Sandy licks her pussy while Maggie basically just sits there. Luckily only 3 minutes.\n\nScene 7...Sandy goes back to the live sex club, but joins Lili and Jason this time. Sandy gives Jason a pretty good blowjob with some deep-throating thrown in. Lili has a vibrator in her pussy while this is happening. Jason then fucks Lili hard in missionary. Lili always looks like she enjoys getting fucked. A much better scene even though Jason is still wearing the mask. 7 minute sex scene.\n\nScene 8...Nina fucks her new boyfriend played by Don Fernardo. This scene felt thrown in to me, but since it was probably the best one, I'm not mad. I'll take any Nina Hartley I can get alway. Don starts by excellently going down on her. Nina then gives him a very spirited blowjob. They then do it in mish with Nina leg up in the air then with her legs down. Lots of kissing going on also, which is rare by todays standards. Don pulls out and drips his cum on her pubes. Don then puts it back in and they fuck for about another 30 seconds. Very hot scene indeed. 9 minute sex scene.\n\nScene 9...Sandy seduces and fucks a bible salesman named Williard played by Joey Silvera. Again very good chemistry between Sandy and the guy she's paired with. They start fucking right off in sitting cowgirl. Love this girls smile! They then switch to missionary. Joey pulls out and has her stroke his dick a little, then puts it back in. It ends with a powerful cumshot all over her body. 6 minute sex scene","torrent":{"xt":"urn:btih:e886bb921fbe94f388b3e6189869a4505837f617","amp;dn":"Storie+di+caserma+2++%28La+pute+du+general+2+%281999%29+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e886bb921fbe94f388b3e6189869a4505837f617","infoHashBuffer":{"type":"Buffer","data":[232,134,187,146,31,190,148,243,136,179,230,24,152,105,164,80,88,55,246,23]},"announce":[],"urlList":[]}}