{"title":"Cement-Based Composites - Materials, Mechanical Properties and P","uid":14532511,"size":12687919,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e90f8211a21d6fcb5f44f2e21c657d3ce612971b&amp;dn=Cement-Based+Composites+-+Materials%2C+Mechanical+Properties+and+P&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1462458620,"description":"Cement-Based Composites - Materials, Mechanical Properties and Performance 2nd ed - Andrzej M. Brandt (E &amp; FN Spon, 2009).pdf\r\n\r\nISBN 978-0-415-40909-4\r\n\r\nCement-Based Composites takes a different approach from most other books in the field by viewing concrete as an advanced composite material, and by considering the properties and behaviour of cement-based materials from this stance. It deals particularly, but not exclusively, with newer forms of cement-based materials. This new edition takes a critical approach to the subject as well as presenting up-to-date knowledge.\r\n\r\nEmphasis is given to non-conventional reinforcement and design methods, problems at the materials' interfaces and to the durability of structures. High strength composites and novel forms of cement-based composites are described in detail. After a basic introduction the book explores the various components of these materials and their properties. It then deals with mechanical properties and considers characteristics under various loading and environmental conditions, and concludes by examining design, optimization and economics with particular emphasis on high-performance concretes. Researchers, graduate students and practising engineers will find this book valuable","torrent":{"xt":"urn:btih:e90f8211a21d6fcb5f44f2e21c657d3ce612971b","amp;dn":"Cement-Based+Composites+-+Materials%2C+Mechanical+Properties+and+P","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e90f8211a21d6fcb5f44f2e21c657d3ce612971b","infoHashBuffer":{"type":"Buffer","data":[233,15,130,17,162,29,111,203,95,68,242,226,28,101,125,60,230,18,151,27]},"announce":[],"urlList":[]}}