{"title":"EL James - Fifty Shades of Grey,2011,Epub,Mobi, KK","uid":7732887,"size":1989367,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e914dd5608b4c0f73f76fb655949a023fc66cc9d&amp;dn=+EL+James+-+Fifty+Shades+of+Grey%2C2011%2CEpub%2CMobi%2C+KK+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"por8i","files":3,"time":1350386437,"description":" EL James - Fifty Shades of Grey,2011,Epub,Mobi, KK \n\nNominated for Best Romance in the 2011 Goodreads Choice Awards\n\nWhen literature student Anastasia Steele is drafted to interview the successful young entrepreneur Christian Grey for her campus magazine, she finds him attractive, enigmatic and intimidating. Convinced their meeting went badly, she tries to put Grey out of her mind - until he happens to turn up at the out-of-town hardware store where she works part-time.\n\nThe unworldly, innocent Ana is shocked to realize she wants this man, and when he warns her to keep her distance it only makes her more desperate to get close to him. Unable to resist Ana's quiet beauty, wit, and independent spirit, Grey admits he wants her - but on his own terms. Shocked yet thrilled by Grey's singular erotic tastes, Ana hesitates. For all the trappings of success - his multinational businesses, his vast wealth, his loving adoptive family - Grey is man tormented by demons and consumed by the need to control. When the couple embarks on a passionate, physical and daring affair, Ana learns more about her own dark desires.\n\nCan their relationship transcend physical passion? Will Ana find it in herself to submit to the self-indulgent Master? And if she does, will she still love what she finds?\n\nErotic, amusing, and deeply moving, the Fifty Shades Trilogy is a tale that will obsess you, possess you, and stay with you forever\n\n","torrent":{"xt":"urn:btih:e914dd5608b4c0f73f76fb655949a023fc66cc9d","amp;dn":"+EL+James+-+Fifty+Shades+of+Grey%2C2011%2CEpub%2CMobi%2C+KK+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e914dd5608b4c0f73f76fb655949a023fc66cc9d","infoHashBuffer":{"type":"Buffer","data":[233,20,221,86,8,180,192,247,63,118,251,101,89,73,160,35,252,102,204,157]},"announce":[],"urlList":[]}}