{"title":"The Changing Face of Anti-Semitism - Walter Laqueur","uid":11730078,"size":435544,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e93f1321aaacf16d1d371d117cff8f0af37e3d07&amp;dn=The+Changing+Face+of+Anti-Semitism+-+Walter+Laqueur&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1425265389,"description":"\nFor thirty years the director of the Wiener Library in London--the leading institute for the study of anti-Semitism--Walter Laqueur here offers both a comprehensive history of anti-Semitism as well as an illuminating look at the newest wave of this phenomenon.\nLaqueur begins with an invaluable historical account of this pernicious problem, tracing the evolution from a predominantly religious anti-Semitism--stretching back to the middle ages--to a racial anti-Semitism that developed in the late 19th and early 20th centuries. The author then uses this historical account as backdrop to a brilliant analysis of the newest species of anti-Semitism, explaining its origins and rationale, how it manifests itself, in what ways and why it is different from anti-Semitism in past ages, and what forms it may take in the future. The book reveals that what was historically a preoccupation of Christian and right-wing movements has become in our time even more frequent among Muslims and left-wing groups. Moreover, Laqueur argues that we can't simply equate this new anti-Semitism with anti-Zionism and write it off as merely anti-Israel sentiments. If Israel alone is singled out for heated condemnation, is the root of this reaction simply anti-Zionism or is it anti-Semitism?\nHere is both a summing up of the entire trajectory of anti-Semitism--the first comprehensive history of its kind--and an exploration of the new wave of anti-Semitism. \n\n\nAbout the author:\n Walter Laqueur was Co-Chairman of the International Research Council at the Center for Strategic and International Studies, in Washington D.C. . He is the author of many books and has published numerous articles in such newspapers and periodicals as the New York Times, Washington Post, Foreign Affairs, Encounter, and New Republic. His most recent works include Fascism: Past, Present, and Future and The New Terrorism: Fanaticism and the Arms of Mass Destruction","torrent":{"xt":"urn:btih:e93f1321aaacf16d1d371d117cff8f0af37e3d07","amp;dn":"The+Changing+Face+of+Anti-Semitism+-+Walter+Laqueur","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e93f1321aaacf16d1d371d117cff8f0af37e3d07","infoHashBuffer":{"type":"Buffer","data":[233,63,19,33,170,172,241,109,29,55,29,17,124,255,143,10,243,126,61,7]},"announce":[],"urlList":[]}}