{"title":"Practice &amp; Improve Your German Plus (MP3 + PDF)","uid":4976798,"size":118063353,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e9be283ae39df6e3cf6eb90f85b2236c4e3d6302&amp;dn=Practice+%26+Improve+Your+German+Plus+%28MP3+%2B+PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nvincent","files":-1,"time":1246038872,"description":"Practice &amp; Improve Your German Plus\n\n\nCassette rip- 64 kbps MP3\n\n\nListening Guide and Handbook- PDF scan\n\n\nThe Practice &amp; Improve language programs are a specially designed series that allows you to capitalize on the foreign language skills you already have to develop your ability to communicate in everyday situations.\n\nDesigned for relaxed and repeated listening, each Practice &amp; Improve program concentrates on realistic, spoken language through the use of four 60-minute cassette tapes. These tapes feature authentic German, in stereo, spoken at a natural pace and rhythm by native speakers - just as you would encounter it in Germany or wherever German is spoken. Each scene is interspersed with music and short practice sections that highlight useful language points.\n\nTwo books are also included to aid your language learning: a Listening Guide containing a complete transcript of the cassette recordings and a Handbook offering instruction on vocabulary and grammar. Both books supplement the program's main activity - listening.\n\nIn the continuing episodes of this Program, you will hear about Lilly Mohn, an assistant in an advertising agency who succeeds in building a flourishing business exchange program. The idea is to relax, listen to the story, share Lilly's experiences, and, in the process, absorb conversational German naturally.\n\nAs you listen to Lilly Mohn's business and social encounters, you will find yourself acquiring higher German-language skills: using official language; dealing with business matters; arranging meetings; dispelling misconceptions; giving subtle replies; talking on the telephone -- among others.","torrent":{"xt":"urn:btih:e9be283ae39df6e3cf6eb90f85b2236c4e3d6302","amp;dn":"Practice+%26+Improve+Your+German+Plus+%28MP3+%2B+PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9be283ae39df6e3cf6eb90f85b2236c4e3d6302","infoHashBuffer":{"type":"Buffer","data":[233,190,40,58,227,157,246,227,207,110,185,15,133,178,35,108,78,61,99,2]},"announce":[],"urlList":[]}}