{"title":"Underwater Warriors: Midget Submarine Operations in War","uid":10188184,"size":92110858,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e9f25ffcf9b941c224edc962ef384716f8e66e9f&amp;dn=Underwater+Warriors%3A+Midget+Submarine+Operations+in+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1400608448,"description":"Underwater Warriors: Midget Submarine Operations in War\nby Paul Kemp\n\nDESCRIPTION:\n\nMidget submarines are an important but relatively little-known part of the entire history of the submarine development and use. The Italians put the midget submarine into operation in the First World War and became the leaders in the field during the war and after. By the Second World War, midget submarines were used extensively and effectively by the Italians, Japanese, British, and Germans in a multitude of daring and dramatic sorties against seaborne, harbor, and land-based targets, a subject that is thoroughly covered in this study.\nThe author provides a complete design and operational history of midget submarines, supplying the reader with enough technical data to understand the mechanics of this element of naval warfare. He then takes the reader on a variety of subversive actions performed by the fascinating craft. For students of naval history and military intelligence work this substantial account of midget submarines and their crews will prove a major contribution to an intriguing topic. A large selection of photographs show the full range of development and experience.","torrent":{"xt":"urn:btih:e9f25ffcf9b941c224edc962ef384716f8e66e9f","amp;dn":"Underwater+Warriors%3A+Midget+Submarine+Operations+in+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9f25ffcf9b941c224edc962ef384716f8e66e9f","infoHashBuffer":{"type":"Buffer","data":[233,242,95,252,249,185,65,194,36,237,201,98,239,56,71,22,248,230,110,159]},"announce":[],"urlList":[]}}