{"title":"Jawbreaker - Dear You (1995) [FLAC] politux","uid":6865822,"size":392596345,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ea07151b50e12f28c70b9f855fae0f9ad29db1bb&amp;dn=Jawbreaker+-+Dear+You+%281995%29+%5BFLAC%5D+politux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1323099510,"description":"1995s Dear You finds Jawbreaker cleaning up and streamlining their punk-pop sound and coming up with a sleek, slick punk-grunge classic that relies as much on clever songwriting and restrained emotions as it does on the groups trademarked high-energy attack. From the opening chords of the anthemic Save Your Generation, Blake Schwarzenbachs vocals are the star. He was coming off of throat surgery that robbed him of a lot of his vocal power but gave him a smoky intimate sound that gives the feeling that he is whispering right in your ear. On songs like I Love You So Much Its Killing Us Both or Jet Black, he sounds wounded in a way that screaming could never convey. \n\nThe album is a powerful mix of jumpy punk-pop like Bad Scene, Everybodys Fault, Fireman, and the aching Chemistry and mid-tempo tracks like the amazing Jet Black, Million, and Basilica that escapes being tied to the time of grunge-by-the-numbers by being melodic and heartfelt without going over the top, by being just punk enough to be real and just epic enough to rise above the often boringly earnest approach of too many punk bands. Along with Weezers Blue Album, Dear You is one of the cornerstones upon which emo and late-90s punk-pop were built. \n\nCertainly Jimmy Eat World wore out their copy, as Bleed American sounds like a less produced younger brother, and Dashboard Confessionals whole oeuvre sounds like a lesser version of Dear Yous acoustic Unlisted Track. Depending on how you feel about emo, there is either a lot to blame Jawbreaker for or be thankful for here. Either way, Dear You is one of the best rock records of the 90s and a fitting last testament to a great band.\n\nReleased: 1995\nGenre: Rock\nStyle: Punk Rock, Indie, Alternative\nSource: CD\nCodec: FLAC\nChannels: Stereo\nSample Rate: 44,100 Hz\nBit Rate: ~1,050 kbps\nBits per Sample: 16\nCovers: Front\n\nTracks:\n\n01 Save Your Generation\n02 I Love You So Much Its Killing Us Both\n03 Fireman\n04 Accident Prone\n05 Chemistry\n06 Oyster\n07 Million\n08 Lurker II: Dark Son of Night\n09 Jet Black\n10 Bad Scene, Everyones Fault\n11 Sluttering (May 4th)\n12 Basilica\n13 Unlisted Track","torrent":{"xt":"urn:btih:ea07151b50e12f28c70b9f855fae0f9ad29db1bb","amp;dn":"Jawbreaker+-+Dear+You+%281995%29+%5BFLAC%5D+politux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea07151b50e12f28c70b9f855fae0f9ad29db1bb","infoHashBuffer":{"type":"Buffer","data":[234,7,21,27,80,225,47,40,199,11,159,133,95,174,15,154,210,157,177,187]},"announce":[],"urlList":[]}}