{"title":"Front Line Assembly --- Nerve War 1986","uid":9156247,"size":169378659,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ea451a1040a2c6142a8432b75da554d1910b0f39&amp;dn=Front+Line+Assembly+---+Nerve+War+1986&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MoonsOfMercury","files":38,"time":1383783526,"description":"\nWelcome to the second attempt of my first torrent.  I've learned some things, so this one I should have done correctly.  \n\nThere is a .txt file included with the whole story, but here is a summary.  There were at least three versions of the &quot;Nerve War&quot; cassette released by Bill Leeb circa 1986, with a total of 24 different songs, and I've been able to find 20 of them:\n\nAs of You\nCertain Style\nContraversy\nElusive\nExcile\nFront Line\nGive It To Me!\nHoly War, part one\nHoly War, part two\nN-29\nOvercome\nPeople\nPower of Oppression\nShadows\nStaahl\nTake 2\nUntitled 1\nUntitled 2\nUntitled 4\nUntitled 5\n\nThe original ripper of &quot;Nerve War&quot; version 2, the most common version available online, mislabeled some songs (because the tape's label was less than clear) and twice joined two separate songs together in single files, and those mistakes have been passed along for years.  I fixed these errors and added a few songs that were on the other versions of &quot;Nerve War.&quot;  I also added five more songs from that era: \n\n*     &quot;Eternal&quot; from the original 1986 cassette version of &quot;Total Terror&quot;\n*     &quot;Mental Conception&quot; from the 1987 cassette compilation &quot;Notre Dame&quot;\n*     &quot;Resuraction&quot; from the 1988 vinyl compilation from Belgium called &quot;Electronic&quot; (re-released in 2013 on the limited-edition vinyl &quot;Close Circuit Connection II&quot;)\n*     &quot;Thewrack Part III - Wisdom&quot; from the 1988 vinyl of &quot;Corrosion&quot; (This was left off the &quot;Convergence&quot; and &quot;Corroded Disorder&quot; CD compilations.  One listen will tell you why.)\n*     &quot;Ritualistic Seducement&quot; from the 1990 cassette compilation &quot;A Joyful Noise&quot;  (This was also released on some versions of Delerium's &quot;Syrophenikan&quot; album under the name &quot;Covert&quot;)\n\nA special note about &quot;Holy War&quot;:  the two parts were included on the third version of &quot;Nerve War&quot; and on the 1986 cassette compilation &quot;Insane Music For Insane People&quot; volume 15 (although there it was originally spelled as &quot;Holly War&quot;!)  If you listen carefully to the fade out of part one and the fade in of part two, you can hear the same segment repeated, making it pretty obvious that this was originally a single song that got split.  No disrespect is intended regarding the artist's wishes, but I decided to join the two parts to present a slightly different listening experience.  (I'm certainly not a professional, and it may be obvious where the join is, but that's not the point.)\n\nFor what it's worth, the four songs I'm still looking for are:\n\nCold as Ice\nThe Steal\nUntitled 3\nThy Glory  (This was also included, in an extended version, on the 1988 cassette compilation &quot;Insane Music For Insane People&quot; volume 25)\n\n","torrent":{"xt":"urn:btih:ea451a1040a2c6142a8432b75da554d1910b0f39","amp;dn":"Front+Line+Assembly+---+Nerve+War+1986","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea451a1040a2c6142a8432b75da554d1910b0f39","infoHashBuffer":{"type":"Buffer","data":[234,69,26,16,64,162,198,20,42,132,50,183,93,165,84,209,145,11,15,57]},"announce":[],"urlList":[]}}