{"title":"Jack Scott - Classic Scott - Bear Family 5CD (1995)","uid":9289111,"size":1759010894,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ea480fb54cceec466f97a8f38a5e4a1c3b683c05&amp;dn=Jack+Scott+-+Classic+Scott+-+Bear+Family+5CD+%281995%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bonnie335","files":156,"time":1386061814,"description":"Jack Scott - Classic Scott - Bear Family 5CD (1995)\n\n\nWith the exception of Roy Orbison and Elvis, no white rock &amp; roller of the time ever developed a finer voice with a better range than Jack Scott, or cut a more convincing body of work in rockabilly, rock &amp; roll, country-soul, gospel, country-pop, or blues. And it's all here on this five-CD set, which probably seems at first like more Jack Scott than most of us need. Its 134 tracks include very, very few songs that aren't worth hearing at least twice (and most a lot more) and have more than their share of surprises. Anyone who laments Scott's failure to remain a rockabilly artist will be surprised at just how much he brought to country ballads and gospel, as well as the convincingly bluesy approach to rock &amp; roll that he maintained years into his recording career. The handful of rockabilly tracks here, confined to the first half of the first disc (with their stereo mixes appearing on the last one), show Scott as a potential rival to Elvis Presley and Gene Vincent. He found success as more of a ballad singer, however, and never returned to his rock &amp; roll roots for more than a song at a time. At the end of the 1950s, he moved back into the haven of country music, where he'd started in his teen years. The fit wasn't an ideal one, although Scott was good enough to make an album's worth of Hank Williams songs a worthwhile venture. This box has it all, mastered about as well as it's ever likely to be. Moreover, good as everything else is, the producers of this box have saved the best for last -- unissued, undated demos a few of which are worth the price of a CD themselves. ","torrent":{"xt":"urn:btih:ea480fb54cceec466f97a8f38a5e4a1c3b683c05","amp;dn":"Jack+Scott+-+Classic+Scott+-+Bear+Family+5CD+%281995%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea480fb54cceec466f97a8f38a5e4a1c3b683c05","infoHashBuffer":{"type":"Buffer","data":[234,72,15,181,76,206,236,70,111,151,168,243,138,94,74,28,59,104,60,5]},"announce":[],"urlList":[]}}