{"title":"Contra  4 NDS[SoloEstreno.com]","uid":5479327,"size":14831552,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:ead6d3fc7c70d5cd5f3c3b108926c8fd42013fd1&amp;dn=Contra++4+NDS%5BSoloEstreno.com%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nahla","files":1,"time":1270320690,"description":"Contra 4 tiene lugar dos aÃƒÂ±os despuÃƒÂ©s de los acontecimientos de Contra III: The Alien Wars. DespuÃƒÂ©s de salvar la tierra de la invasiÃƒÂ³n por Red Falcon, de Bill Rizer y Lance Bean se enfrentan a una amenaza extraterrestre nuevo: el aterrador Negro Viper. AcompaÃƒÂ±ado por mercenarios duros Mad Dog y Scorpion, los guerreros deben librar una vez mÃƒÂ¡s la guerra contra todo un ejÃƒÂ©rcito de invasores.\n\nRefinaciÃƒÂ³n del gÃƒÂ©nero 2D de desplazamiento lateral de la serie creada hace 20 aÃƒÂ±os, de Contra 4 pone a pura acciÃƒÂ³n al rojo vivo como saltan los jugadores, disparar, esquivar los peligros y en sentido contrario. Utilizando una nueva presentaciÃƒÂ³n de doble pantalla, la acciÃƒÂ³n se extiende por las dos pantallas de Nintendo DS, ofreciendo a los jugadores la oportunidad de batalla a travÃƒÂ©s de entornos de expansiÃƒÂ³n en la que la muerte puede venir de cualquier direcciÃƒÂ³n. El uso de ambas pantallas de la acciÃƒÂ³n principal del juego tambiÃƒÂ©n permite batallas de jefes masivos como los jugadores tratan de buscar y destruir los puntos dÃƒÂ©biles de los enemigos por las nubes. Por primera vez en la serie, Contra 4 presenta un gancho de ataque accesorio que permite a los jugadores agarrarse elementos del medio ambiente directamente encima de ellos. Ya sea que utilice para evitar peligros o ataque inminente desde el punto de vista estratÃƒÂ©gico, el gancho de ataque permite situaciones de combate nuevos y piezas dramÃƒÂ¡ticas que subrayan conjunto pedigrÃƒÂ­ la adrenalina de los del juego.\n\nContinuando con la tradiciÃƒÂ³n de varios jugadores de los juegos anteriores de la serie, Contra 4 permite a dos jugadores luchan juntos contra el EjÃƒÂ©rcito Negro Viper de viles fuerzas alienÃƒÂ­genas y recuperar la Tierra para la humanidad.\n\nDescomprimido: 32 MB\nTamaÃƒÂ±o del paquete: 15 MB","torrent":{"xt":"urn:btih:ead6d3fc7c70d5cd5f3c3b108926c8fd42013fd1","amp;dn":"Contra++4+NDS%5BSoloEstreno.com%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ead6d3fc7c70d5cd5f3c3b108926c8fd42013fd1","infoHashBuffer":{"type":"Buffer","data":[234,214,211,252,124,112,213,205,95,60,59,16,137,38,200,253,66,1,63,209]},"announce":[],"urlList":[]}}