{"title":"Golden Grrrls (2013) [FLAC]","uid":8247703,"size":191822400,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:eb8cc26680c91c05dace2f63a7d7685f765251fd&amp;dn=Golden+Grrrls+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1363097655,"description":"\n  Golden Grrrls (2013) [FLAC]\n\n  Released: 2013\n  Duration: 27:09\n  Genre: Pop/Rock\n  Style: Indie Pop, Noise Pop\n  Codec: FLAC\n  Bit Rate: ~ 950 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 New Pop\n  02 Past Tense\n  03 Paul Simon\n  04 Think of the Ways\n  05 Older Today\n  06 Take Your Time\n  07 Time Goes Slow\n  08 Wrld Peace\n  09 Never Said Enough\n  10 Date It\n  11 We've Got  \n\n  Scottish trio Golden Grrrls hit all the right indie pop notes on their self-titled debut LP. The group makes a happy and super-catchy clatter that draws inspiration from originators like the Pastels and Shop Assistants, but still sounds quite contemporary thanks to a raft of bands (like Veronica Falls and Sweater Girls) using the same noise-meets-melody template, and the record is a short, sweet semi-shambolic delight. All three bandmembers (two females/one male) sing, their unschooled voices twisting and turning all around each other while they pound and strum at their instruments in a similarly simple, but effective, manner. One could make all the usual complaints about music like this that doesn't sound like it was made in a factory by automatons - the vocals are pitchy, the drums are out of time, the guitar lines are simplistic and could be played by children - but really, what should technical proficiency matter to anyone outside of the Berklee School of Music, when the music is as honest and pure as this? \n\n  Golden Grrrls aren't looking to get straight A's in school; they just want to play their hooky tunes and maybe melt a few hearts along the way. Charging through uptempo tracks (&quot;Take Your Time,&quot; &quot;Wrld Peace&quot;) with unbridled enthusiasm is their main strength, but they have a nice light touch with less frantic songs, too. The way their voices clash (Ruari MacLean's stately baritone, Eilidh Rodgers and Rachel Aggs' sweeter but still a little spiky tones) but still fit together perfectly on &quot;Time Goes Slow&quot; is heartwarming, and &quot;Date It&quot; has the album's most bewitching vocals, with all three of them reaching back for something extra charming and really pushing the song over the top. The galloping bassline is a keeper, too. Many bands have gone down this road before and many of them have littered it with half-baked, uninspired records that honestly give this kind of indie pop a bad name. Golden Grrrls (despite actually having a bad name) made an album that embodies the best things about C-86-derived indie pop (warmth, innocence, honesty, community) and doesn't skimp on songs that make you want to get up and jump around the room with a big silly grin on your face.","torrent":{"xt":"urn:btih:eb8cc26680c91c05dace2f63a7d7685f765251fd","amp;dn":"Golden+Grrrls+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb8cc26680c91c05dace2f63a7d7685f765251fd","infoHashBuffer":{"type":"Buffer","data":[235,140,194,102,128,201,28,5,218,206,47,99,167,215,104,95,118,82,81,253]},"announce":[],"urlList":[]}}