{"title":"Tachyon: The Fringe [CD]- MADJACKTHEPISSEDPIRATE","uid":12009631,"size":821091896,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ebb293cf74dffaa5287fd57be71c0fec7a513b42&amp;dn=Tachyon%3A+The+Fringe+%5BCD%5D-+MADJACKTHEPISSEDPIRATE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MADJACKTHEPISSEDPIRATE","files":5,"time":1434070915,"description":"\nPLEASE SEED THIS AT LEAST 1. SHARE SO THE PEEPS WHO WANT THIS CAN GET IT FOR THE FIRST FEW DAYS AT LEAST. WIITHOUT A LONG WAIT BY MY 100KBPS UPLOAD RATE. THANK YOU I APPRECIATE IT. you dont have to seed it all in one squirt...i can only seed 8 hrs max a day cause im not a network genius and my vpn kicks out yada yada. dont wanna get busted of course.[i fouled something up in network connections with an online guide and i cant figure it out...duh] least i got ivp 6 disaabled. read they can catch you if its running.\n\nLIKE CYBERMAGE IN 05 I ARCHIVED MY DISKS TO IMAGE FILE USING CLONE CD..SO YOU WILL PROLLY HAVE TO USE THAT TO BURN THE IMAGE TO A CD if power iso or daemon doesnt work  MADJACK IS NOT RESPONSIBLE FOR ANY PROBLEMS YOU MIGHT HAVE WITH THIS TORRENT. lol i just add that for fun..THIS IS A WIN  98 GAME AS I RECALL.think it runs on xp without any fuss if i recall correctly. i enjoyed this game but never finished it.\n\nI HAVENT GOTTEN ANY FEEDBACK AS TO WETHER YOU  PIRATES HAVE HAD ANY PROBLEMS GETTING THESE GAMES TO RUN....SO I ASSUME MY DECADE OLD IMAGE FILED GAME HARD DRIVE IS STILL OPTIMAL....LET ME KNOW IF YOU DO HAVE ANY CORRUPTIONS...CAUSE I HAVE THE DISCS...NEVER ISO ED A DISC MYSELF SO..me and my friends had just about every game from96 to99..but we  have lost them over years..i have 75 percent of those left\n\nTachyon: The Fringe [cd]- MADJACKTHEPISSEDPIRATE\n\n\nTachyon: The Fringe is a computer game developed and published in 2000 by the company Novalogic. It features the voice acting of Bruce Campbell as main character Jake Logan in a 3-D space simulator. Tachyon was developed by Randy Casey, who had previously written two other titles for Novalogic: F-22 Lightning II and F-22 Raptor.\n\nThe story of Tachyon: The Fringe is set in the 26th century, where mankind has left Earth to colonize the far reaches of space, and has many characteristics of a space opera. The Sol system is a place of relative peace, which is kept by the police force called Star Patrol. Conflict inside the Solar system is heavily regulated; however, quarrels between rivaling megacorporations, who maintain private militias and compete for control over markets and resources, often break out into open conflict. Sometimes banished pirates, terrorists or other disruptive entities make waves, but inter-corporate conflict is the primary theme. This is not the primary focus of the game however.\n\nThe majority of the game takes place in the vast area called the Fringe, which consists of all space outside the direct jurisdiction of Sol. Except for an outpost in the Hub region, Star Patrol has virtually no presence in these areas. Because of this, power struggles are constantly raging between the game's corporations, pirate clans, Bora colonists, and the so-called &quot;Asteroid Barons&quot;\n\n\nTachyon: the fringe is a first-person space-flight simulator. Among several features, (such as power and shield management), the game implements &quot;sliding&quot;, where the player can maintain a constant velocity while having free control over the orientation of their space-craft. This is intended to provide an ease-of-motion where the player can strafe, fly backwards and otherwise maintain a higher level of control over their spacecraft.\nMissions\n\nIn story mode, the player chooses missions from the Job Board. Some missions are offered by neutral parties and do not drive the main storyline (though they do occasionally affect the TNS News bulletins). Eventually, the story will reach a point where it becomes necessary for the player to ally with either the Bora Colonies or the Galactic Spanning Corporation. The Bora missions are usually higher in difficulty and less rewarding monetarily. GalSpan pays well and often has missions in tandem with other pilots. Since the two factions offer different fighters and different weapons, they encourage different play styles, as well as different storylines. The GalSpan missions generally are higher paid than the Bora ones, and the Bora missions tend to get more difficult in the end","torrent":{"xt":"urn:btih:ebb293cf74dffaa5287fd57be71c0fec7a513b42","amp;dn":"Tachyon%3A+The+Fringe+%5BCD%5D-+MADJACKTHEPISSEDPIRATE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebb293cf74dffaa5287fd57be71c0fec7a513b42","infoHashBuffer":{"type":"Buffer","data":[235,178,147,207,116,223,250,165,40,127,213,123,231,28,15,236,122,81,59,66]},"announce":[],"urlList":[]}}