{"title":"Lost.Planet.3.Steam.Rip.[Multi 9]","uid":9660064,"size":24768709539,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ec520a5af9a6178932ae46f9d57f6bec3ff53f14&amp;dn=Lost.Planet.3.Steam.Rip.%5BMulti+9%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Taker009","files":13,"time":1393257950,"description":"Lost.Planet.3.Steam.Rip.[Multi 9] \n\nYear: 2013 \nGenre: Action / 3rd Person \nLanguage:English [Multi 9] \nCrack: Present (SKIDROW)\n\nSystem requirements\n\nOperating system: Windows XP SP3, Vista SP1, Windows 7 \nProcessor: Dual core CPU 2.5 GHz \nRAM: 3Gb \nVideo Card: NVIDIA  GeForce  9800 or better, ATI Radeon  HD 4770 or better \nSound Card: Sound device compatible with DirectX  9.0 \nFree space on hard drive: 25Gb\n\nDangerous and unpredictable situation - a proprietary feature of all games in the series Lost Planet, but now the player waiting for the most severe test! Lost Planet 3, dedicated to the history of colonization E.D.N. III, reveals new secrets sinister planet. \n\nLost Planet Hero 3 - pilot Jim Peyton, who took a risky but profitable business proposition of &quot;Neo Venus Constructions&quot; (NEVEK). Taking off from the Earth to the planet E.D.N. III, which the company prepares to colonization, Jim joins fellow trailblazers based Koronis. There he begins investigating the site and collecting samples of thermal energy component of the energy supply of the planet. \n\nSince the thermal energy reserves NEVEK coming to an end, the fate of the mission on Koronis depends on its ability to extract energy from any natural source found. Jim understands that this is a great chance to get a huge reward and go home prematurely. The pilot decided to challenge the insidious planet and aggressive local race of locusts. \n\nJim machine - a &quot;home away from home area.&quot; It stores a set of tools, essential field. Without a car, Jim would have lost not only work, but also life - housing protects the pilot from the vagaries of climate. \n\nLost Planet 3 combines different styles of play, including hiking battles and intense fighting in the first person. The game has several modes of multiplayer games and mesmerizing story for one player. Lost Planet 3 will allow you to dive deeper into the world of Lost Planet, and uncover the secrets of E.D.N. III. Uniquely dynamic environment.\n\nFeatures of release:\n\nLanguage-game changes in the properties of the game through Steam or Launcher.exe \n\nSteam-Rip is identical to the activated via Steam licensed copy of the game \n\nVersion of the game - 1.0.10246.0\n\nIncludes the following DLCS\n\nMap Pack 1 \nMap Pack 2 \nMap Pack 3 \nFreedom Fighter's Pack \nPunisher Pack \nAssault Pack \nHi Res Movies Pack \nSurvival Pack\n \nInstallation\n\n1.Download \n2.Run setup.exe \n3.Choose version installation (* Cracked or steam) \n4.Set the Language of the game \n5.Play! enjoy...\n","torrent":{"xt":"urn:btih:ec520a5af9a6178932ae46f9d57f6bec3ff53f14","amp;dn":"Lost.Planet.3.Steam.Rip.%5BMulti+9%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec520a5af9a6178932ae46f9d57f6bec3ff53f14","infoHashBuffer":{"type":"Buffer","data":[236,82,10,90,249,166,23,137,50,174,70,249,213,127,107,236,63,245,63,20]},"announce":[],"urlList":[]}}