{"title":"Google SketchUp Pro v7.0.10247 + serials","uid":5426586,"size":56137174,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ec86e44dd3a2ee9ce19de8f19a580e1b41280a7d&amp;dn=Google+SketchUp+Pro+v7.0.10247+%2B+serials&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"azegcol","files":1,"time":1268272523,"description":"Google SketchUp is software that you can use to create 3D models of anythinsg you like. Most people get rolling with SketchUp in just a few minutes. Dozens of video tutorials, an extensive Help Center and a worldwide user community mean that anyone who wants to make 3D models with SketchUp, can. Redecorate your living room. Design a new piece of furniture. Model your city for Google Earth. Create a skatepark for your hometown, then export an animation and share it onThere's no limit to what you can create with SketchUp. You can build models from scratch, or you can download what you need. People all over the world share what they've made on the Google 3D Warehouse. It's a huge, searchable repository of models, and it's free.\n\nGoogle SketchUp Pro 7 is a suite of powerful features and applications for streamlining your professional 3D workflow. All the intuitive modeling, visualization and collaboration features of SketchUp 7, plus exporters for a long list of 2D and 3D vector file formats. Also, generate tabular reports based on the entities in your models. Link your models to multi-page 2D presentation documents, add images, text and graphics, and share your designs as high-resolution prints, digital exports and onscreen slide shows. Teach components to animate and scale like they do in real life. Add custom attributes that extend your models' usefulness. Build configurable components that are easy for everyone to use.\n\nFeatures:\n\nÃ‚Â» Edges and Faces: Thats all there is to it\nÃ‚Â» Push/Pull: Quickly go from 2D to 3D\nÃ‚Â» Accurate measurements: Work with precision\nÃ‚Â» Follow Me: Create complex extrusions and lathed forms\nÃ‚Â» Paint Bucket: Apply colors and textures\nÃ‚Â» Groups and Components: Build smarter models\nÃ‚Â» Shadows: Perform shade studies and add realism\nÃ‚Â» Sections: See inside your models\nÃ‚Â» Scenes: Save views and create animations\nÃ‚Â» Look Around and Walk: Explore your creations firsthand\nÃ‚Â» Dimensions and Labels: Add information to your designs\nÃ‚Â» The Instructor: Catch on quickly\nÃ‚Â» Layers and the Outliner: Stay organized\nÃ‚Â» Google Earth: See your models in context\nÃ‚Â» Sandbox tools: Work on terrain\nÃ‚Â» 3D Warehouse: Find models of almost anything you need\nÃ‚Â» Import DXF, DWG and 3DS: Get a headstart on your modeling\nÃ‚Â» Import images: Paint walls with photos\nÃ‚Â» Export TIFF, JPEG and PNG\nÃ‚Â» Export DXF and DWG: 2D line drawings and 3D models\nÃ‚Â» Export PDF and EPS: 2D vector images\nÃ‚Â» Export 3DS, OBJ, XSI, FBX, VRML and DAE","torrent":{"xt":"urn:btih:ec86e44dd3a2ee9ce19de8f19a580e1b41280a7d","amp;dn":"Google+SketchUp+Pro+v7.0.10247+%2B+serials","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec86e44dd3a2ee9ce19de8f19a580e1b41280a7d","infoHashBuffer":{"type":"Buffer","data":[236,134,228,77,211,162,238,156,225,157,232,241,154,88,14,27,65,40,10,125]},"announce":[],"urlList":[]}}