{"title":"Fiat Lux - Fac Ut Vivas [Rare 1984 New Wave]","uid":3919004,"size":87418880,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ed9b846d7aec7583579b06444b007a3280704fe2&amp;dn=Fiat+Lux+-+Fac+Ut+Vivas+%5BRare+1984+New+Wave%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"80zforever","files":-1,"time":1196673210,"description":"Fiat Lux were one of the most underrated and obscure new wave bands of the 80ÃƒÂ¢??s. The album is a great work of new wave with lots of catchy tunes. The British new wave trio Fiat Lux notched a handful of hits in the U.K. before vanishing into the pop abyss. Fiat Lux formed in Yorkshire, England, in 1982 with Steve Wright (vocals), Ian Nelson (sax, keyboards), and Dave Crickmore (guitars, keyboards). Wright and Crickmore studied drama together in college. After graduating, Wright joined a theatre company called the Yorkshire Actors where he met musician Bill Nelson, the former guitarist of Be Bop Deluxe. Wright gave Nelson a demo tape he and Crickmore had recorded. Impressed with their music, Nelson produced and arranged one of the demo tracks, &quot;Feels Like Winter Again,&quot; and released it on his label Cocteau Records. In April 1982, Bill Nelson's brother Ian Nelson was added to Fiat Lux lineup. They named themselves Fiat Lux, which is the Latin translation for the Biblical quotation &quot;Let There Be Light &quot; &quot;Feels Like Winter Again&quot; was the first of Fiat Lux's radio successes. In 1984, the haunting ballad &quot;Secrets&quot; drew comparisons to Depeche Mode's moody synth-pop; it became Fiat Lux most well-known song. Fiat Lux's utilization of cello in &quot;Secrets&quot; broadened synth-pop's stylistic range. However, Fiat Lux never released a full-length album. The group's output was limited to several singles for Polydor. Fiat Lux disbanded in 1985. \n\nTracklisting:\n\n01 The Moment \n02 Breaking The Boundary\n03 Blue Emotion\n04 House of Thorns\n05 Splurge\n06 Secrets\n07 No More Proud\n08 Aqua Vitae \n09 Photography\n10 Solitary Lovers \n11 Three's Company\n12 Embers \n13 Feels Like Winter Again \n14 Sleepless Nightmare\n","torrent":{"xt":"urn:btih:ed9b846d7aec7583579b06444b007a3280704fe2","amp;dn":"Fiat+Lux+-+Fac+Ut+Vivas+%5BRare+1984+New+Wave%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed9b846d7aec7583579b06444b007a3280704fe2","infoHashBuffer":{"type":"Buffer","data":[237,155,132,109,122,236,117,131,87,155,6,68,75,0,122,50,128,112,79,226]},"announce":[],"urlList":[]}}