{"title":"Ardamax.Keylogger.2.9.Incl.Keygen-ONY","uid":3978393,"size":474336,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ee083e06b5dd468a3f07a725cfca08edab0cb7d1&amp;dn=Ardamax.Keylogger.2.9.Incl.Keygen-ONY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ony","files":2,"time":1200420202,"description":"APPLICATION : Ardamax Keylogger 2.9 Incl Keygen\n\t OS : Win\n       TYPE : Keylogger\n        WWW : http://www.ardamax.com/keylogger/\n    RELDATE : dunno\n PROTECTION : Serial\n CRKRELDATE : 15/01/2008\n\nINSTALLATION: Install.\n              Use keygen to generate your serial.\n\n       NOTES: more sparetime killed.. enjoy! / ONY\n\nABOUT:\n\nArdamax Keylogger - invisible keystroke recorder with remote installation.  \t\n\nArdamax Keylogger is a keystroke recorder that captures user&amp;#039;s activity and saves it to an encrypted log file. The log file can be viewed with the powerful Log Viewer. Use this tool to find out what is happening on your computer while you are away, maintain a backup of your typed data automatically or use it to monitor your kids. Also you can use it as a monitoring device for detecting unauthorised access. Logs can be automatically sent to your e-mail address, access to the keylogger is password protected. Besides, Ardamax Keylogger logs information about the Internet addresses the user has visited.\n\nThis invisible spy application is designed for Windows 98, ME, NT4, 2000, XP and 2003.\n\n \n\nKeylogger Features:\n\n* Remote Installer - creates a customized Ardamax Keylogger engine file. You can email this file to your target for remote monitoring.\n\n* Invisible mode makes it absolutely invisible to anyone. Ardamax Keylogger is not \nvisible in the task bar, system tray, Windows 98/2000/XP/2003/Vista Task Manager, \nprocess viewers (Process Explorer, WinTasks etc.), Start Menu and Windows Startup list.\n\n* Email log delivery - keylogger can send you recorded logs through e-mail delivery at set times - perfect for remote monitoring!\n\n* FTP delivery - Ardamax Keylogger can upload recorded logs through FTP delivery.\n\n* Network delivery - sends recorded logs through via LAN.\n\n* Clipboard logging - capture all text copied to the Windows Clipboard.\n\n* Visual surveillance - periodically makes screenshots and stores the compressed images to log.\n\n* Chat monitoring - Ardamax Keylogger is designed to record and monitor both sides of a conversation in following chats:\n\n          o MSN Messenger, Windows Live Messenger\n          o ICQ Pro, ICQ Lite\n          o Skype\n          o Windows Messenger\n          o Google Talk\n          o Yahoo Messenger\n          o Miranda\n          o QiP\n\n* Security - allows you to protect program settings, Hidden Mode and Log file.\n\n* Web Update - Ardamax Keylogger can check the availability of updates, download and install them automatically. Thus, the latest version of Ardamax Keylogger will always be installed on your computer.\n\n* Application monitoring - keylogger will record the application that was in use that received the keystroke!\n\n* Time/Date tracking - it allows you to pinpoint the exact time a window received a keystroke!\n\n* Powerful Log Viewer - you can view and save the log as a HTML page or plain text with keylogger Log Viewer.\n\n* Small size ? Ardamax Keylogger is several times smaller than other programs with the same features. It has no additional modules and libraries, so its size is smaller and the performance is higher.\n\n* Ardamax Keylogger fully supports Unicode characters which makes it possible to record keystrokes that include characters from Japanese, Chinese, Arabic and many other character sets.\n\n* It records every keystroke. Captures passwords and all other invisible text.\n\nOther Features:\n\n    * Windows 2000/XP/Vista support\n    * Monitors multi-user machines\n    * Automatic startup\n    * Friendly interface\n    * Easy to install\n","torrent":{"xt":"urn:btih:ee083e06b5dd468a3f07a725cfca08edab0cb7d1","amp;dn":"Ardamax.Keylogger.2.9.Incl.Keygen-ONY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee083e06b5dd468a3f07a725cfca08edab0cb7d1","infoHashBuffer":{"type":"Buffer","data":[238,8,62,6,181,221,70,138,63,7,167,37,207,202,8,237,171,12,183,209]},"announce":[],"urlList":[]}}