{"title":"I Am a Man!: Race, Manhood, and the Civil Rights Movement [Non-F","uid":8908188,"size":11192714,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee312353d467f11e0afa7139fe081eddad6b2dce&amp;dn=I+Am+a+Man%21%3A+Race%2C+Manhood%2C+and+the+Civil+Rights+Movement+%5BNon-F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"K-Slender","files":3,"time":1378956108,"description":"ISBN10: 0807829293\nISBN13: 9780807829295\n\nThe civil rights movement was first and foremost a struggle for racial equality, but questions of gender lay deeply embedded within this struggle. Steve Estes explores key groups, leaders, and events in the movement to understand how activists used race and manhood to articulate their visions of what American society should be.\nEstes demonstrates that, at crucial turning points in the movement, both segregationists and civil rights activists harnessed masculinist rhetoric, tapping into implicit assumptions about race, gender, and sexuality. Estes begins with an analysis of the role of black men in World War II and then examines the segregationists, who demonized black male sexuality and galvanized white men behind the ideal of southern honor. Later, he explores the militant new models of manhood espoused by civil rights activists and groups such as Malcolm X, the Nation of Islam, the Student Nonviolent Coordinating Committee, Martin Luther King Jr., and the Black Panther Party.\n\nReliance on masculinist organizing strategies had both positive and negative consequences, Estes concludes. Tracing these strategies from the integration of the U.S. military in the 1940s through the Million Man March in the 1990s, he shows that masculinism rallied men to action but left unchallenged many of the patriarchal assumptions that underlay American society. ","torrent":{"xt":"urn:btih:ee312353d467f11e0afa7139fe081eddad6b2dce","amp;dn":"I+Am+a+Man%21%3A+Race%2C+Manhood%2C+and+the+Civil+Rights+Movement+%5BNon-F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee312353d467f11e0afa7139fe081eddad6b2dce","infoHashBuffer":{"type":"Buffer","data":[238,49,35,83,212,103,241,30,10,250,113,57,254,8,30,221,173,107,45,206]},"announce":[],"urlList":[]}}