{"title":"Quiver &amp;lrm;- Gone In The Morning (1972) MP3@256","uid":9669530,"size":63220811,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ee7cf303a4364b0bba36a9b2dba57a9bf076cbf5&amp;dn=Quiver+%26lrm%3B-+Gone+In+The+Morning+%281972%29+MP3%40256&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AaronVincent","files":10,"time":1393431999,"description":"Quivers second album, from 1972. Before they joined The Sutherland Brothers.\n\nQuiver was a group that had produced a couple of albums for Warner Brothers, but appeared to be going nowhere, mainly because they lacked good songs and a distinctive vocalist. They had the distinction of being the first group ever to perform at the Rainbow, Finsbury Park, where they supported The Who. However, they needed to look at how they could develop their undoubted musical skills using decent material.\nThus, in 1973, was the marriage of the two groups set up. Sutherland Brothers &amp; Quiver was formed and five great albums followed. An outstanding touring band, they worked hard to produce a good live sound that had audiences on their feet. They spent a number of years on the road, both in Europe and the United States, where You Got Me Anyway was a top twenty hit.\nChart success in their own country was harder to come by and although Dream Kid got plenty of radio play, it didn't get the sales it deserved. Album sales, however, remained respectable amongst the group of fans who acknowledged the talent that was bursting to be recognised. ","torrent":{"xt":"urn:btih:ee7cf303a4364b0bba36a9b2dba57a9bf076cbf5","amp;dn":"Quiver+%26lrm%3B-+Gone+In+The+Morning+%281972%29+MP3%40256","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee7cf303a4364b0bba36a9b2dba57a9bf076cbf5","infoHashBuffer":{"type":"Buffer","data":[238,124,243,3,164,54,75,11,186,54,169,178,219,165,122,155,240,118,203,245]},"announce":[],"urlList":[]}}