{"title":"mangadrive - TBWNR - 2008 [Techno, Industrial, Electronica]","uid":4687255,"size":96501505,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ef3517d8bf6b65b15c45bc4b3ac2347f97678fe9&amp;dn=mangadrive+-+TBWNR+-+2008+%5BTechno%2C+Industrial%2C+Electronica%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ebrock","files":14,"time":1233273077,"description":"mangadrive - TBWNR - 2008\nnon-scene release\nencoded @ 192KBPS (LAME)\ngenre: Techno, Industrial, Electronica\nlabel: unsigned\nwebsite: www.mangadrive.net\n\n\n\nAlbum was purchased from CDbaby.com and uploaded for promotional means. Please support this unsigned artist if you enjoy their music.\n\n\n&quot;These.Blades.Will.Never.Rust by Mangadrive is seedy, gritty, and meant for backstreets and dark raves. It immediately controls the body and takes the listener into the underbelly of music where deep bass, chimes, and waves of synths mesh together to create an aural atmosphere. In the way that the Fight Club soundtrack by the Dust Brothers feels energized and dirty, Mangadrive does the same - except with a little bit of dubstep, a whole lot of psy-trance and dark, progressive, afterhours house. The bass on &quot;Vocation&quot; literally vibrates in your head as the intricate samples and counterpoint loops weave in and out of a left and right pan.\n\nEach song is not just a piece of music, but also a piece of art as every sound is carefully placed within a 5.1 surround spectrum to create a menacing psychedelic experience. There is suspense that builds from the first track on the album, &quot;Rolling Out the Black Carpet,&quot; where each song after only escalates anticipation. By &quot;The_Afterwrath,&quot; an entirely new set of influences reign the sound spectrum. From before where the songs were slower and possessed more of a techno soundtrack feel, &quot;DuckandCover&quot; and &quot;The_Afterwrath&quot; are pure pounding, ominous psy-trance like a morbid version of Infected Mushroom or Paranormal Attack. &quot;NineSix&quot; is sexual, relentless, and grows in appeal with force. The highlight of Mangadrive's album is &quot;Wind,&quot; which mixes all the different styles and sounds into one cohesive piece with swelling licks, syncopated breakdowns in the drums, and pounding trance. &quot;Tacchi&quot; comes in second with a haunting storyboard laid out by definitive keyboards that lead the listener on a journey. \n\nOverall, These.Blades.Will.Never.Rust transports the listener almost back in time to the late '90s dance scene when Crystal Method and the Chemical Brothers rocked the house, not to mention a consistent drive and diversity from the beginning to the end with hardly any disappointments. This album brings back memories and creates new ones as you drift back into nostalgia. One thing is certain: creator Bee knows his genre styles in and out, as well as possessing of all the proper musical training to create a catchy, intricate, and rough masterpiece. Although, the initial impression of the album is lackluster, the band name is unimpressive, and the song titles have no relation to the sound of the actual piece, once the first notes sound out of the stereo, whatever one previously thought about Mangadrive has been converted to the exact opposite. These.Blades.Will.Never.Rust is definitely a better live set or driving album than a headphones piece. As entertaining as the music is to listen to, it is hard to sit still while absorbing this 13-anthem package.&quot;\n\nwww.regenmag.com\n\n\n","torrent":{"xt":"urn:btih:ef3517d8bf6b65b15c45bc4b3ac2347f97678fe9","amp;dn":"mangadrive+-+TBWNR+-+2008+%5BTechno%2C+Industrial%2C+Electronica%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef3517d8bf6b65b15c45bc4b3ac2347f97678fe9","infoHashBuffer":{"type":"Buffer","data":[239,53,23,216,191,107,101,177,92,69,188,75,58,194,52,127,151,103,143,233]},"announce":[],"urlList":[]}}