{"title":"Mondovino - Jonathan Nossiter","uid":12496542,"size":4644890624,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f03d5ddefc4c3324040ca9f7214f6cb0e732bfa6&amp;dn=Mondovino+-+Jonathan+Nossiter&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IImultipleII","files":22,"time":1443276756,"description":"Written and directed by Jonathan Nossiter, Mondovino is a documentary film on the impact of globalization on the world's different wine regions. It was nominated for the Palme d'Or at the 2004 Cannes Film Festival and a César Award.\r\nThe film explores various wine-producing regions, and the influence of critics like Robert Parker. and consultants like Michel Rolland in defining an &quot;international style&quot;. It pits the ambitions of large, multinational wine producers, in particular Robert Mondavi, against the small, single estate wineries who have traditionally boasted wines with individual character driven by their Terroir.\r\n\r\nAbout the Director\r\nAward winning film director Jonathan Nossiter, son of Washington Post and New York Times foreign correspondent Bernard Nossiter, was born in the United States in 1961. He was raised in France, England, Italy, Greece and India. He studied painting at the Beaux Arts in Paris and at the San Francisco Art Institute, as well as Ancient Greek at Dartmouth College. After work as an assistant director in the theatre in England, he went to New York where he landed a job moving office furniture for the film Fatal Attraction, which led to a position as assistant to the director Adrian Lyne for the length of the shoot.\r\nA trained sommelier, in parallel to his film career, he has made wine lists and trained staffs for a variety of restaurants in New York, Paris and Rio de Janeiro. His book Taste &amp; Power: The wine world wars, was published in 2007, drawing varied reactions from the wine community, including Robert M. Parker, who accused Nossiter of stupidity and bigotry.\r\n\r\n\r\n\r\nGeneral Info\r\n\r\n\r\nDirector\r\nJonathan Nossiter\r\n\r\nProduced by\r\nEmmanuel Giraud &amp; Jonathan Nossiter\r\n\r\nTechnical Data\r\n\r\n\r\nFilesize\r\n4330 Mb\r\n\r\nFormat\r\nDVD 9 - Compressed\r\n\r\nAudio\r\nOriginal dialogues. Italian, English, French, Spanish, Portuguese\r\n\r\nSubtitles\r\nItalian only\r\n\r\nMenù\r\nDirect access to scenes. No extra","torrent":{"xt":"urn:btih:f03d5ddefc4c3324040ca9f7214f6cb0e732bfa6","amp;dn":"Mondovino+-+Jonathan+Nossiter","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f03d5ddefc4c3324040ca9f7214f6cb0e732bfa6","infoHashBuffer":{"type":"Buffer","data":[240,61,93,222,252,76,51,36,4,12,169,247,33,79,108,176,231,50,191,166]},"announce":[],"urlList":[]}}