{"title":"Battle Pope","uid":7264415,"size":489584875,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f11cc137f5704ec9b9df0ce0d393129d614da6bd&amp;dn=Battle+Pope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SmokeBogey","files":-1,"time":1336840604,"description":"Battle Pope is an independent comic book created by Robert Kirkman and Tony Moore, which was published by their own small press company under the moniker of Funk-O-Tron originally in 2000. The series was reprinted in color by Image Comics in 2005, with plans to possibly continue it with new stories after collecting the original material.\n\nThe book tells the tale of a hard drinking, womanizing Pope condemned by God for his own evil ways, who is called to action to save Saint Michael, with the help of Jesus H. Christ, becoming mankind's final hope in a world overrun by demons following the Rapture.\nPlot\n\nPortraying a comical view of a fictional Pope, (Pope Oswald Leopold II) the opening panels of the comic show the main character sitting in a bar drinking and reminiscing. There is a flashback to a young child being prepared to accept the mantle of Pope. As such, he undergoes martial arts training from Bruce Lee because, &quot;The Pope needs to be ready for anything.&quot; After becoming Pope, he leads a life full of cursing, drinking, and sex. Shortly thereafter, God casts judgement down upon the entire human race, condemning them all. The gates between Earth and Hell thus open, and the world is swarmed by demons. After a great war, a treaty is formed and the gates to Hell are closed. The survivors, both human and demon, are allowed to roam the earth and co-exist.\n\nThis torrent contains the Image Battle Pope Color reprints 1-14, as well as the original Funk-O-Tron 1-13 B&amp;W run (issues 1 &amp; 2 are from the tpb, with extras).  The Saint Michael miniseries is here as well.  It should be read first, I believe. Once you're done with that, I suggest reading the color version, since it has been repackaged in such a way that the numbering is more coherent. The B&amp;W version does have some great ads, pinups, letter columns, etc., though.  The choice is yours.","torrent":{"xt":"urn:btih:f11cc137f5704ec9b9df0ce0d393129d614da6bd","amp;dn":"Battle+Pope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f11cc137f5704ec9b9df0ce0d393129d614da6bd","infoHashBuffer":{"type":"Buffer","data":[241,28,193,55,245,112,78,201,185,223,12,224,211,147,18,157,97,77,166,189]},"announce":[],"urlList":[]}}