{"title":"Nickelback - Gotta Be Somebody","uid":4735897,"size":151201796,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f1ee30e83e719ff2b70a80d4f36d9c1ddaceb838&amp;dn=Nickelback+-+Gotta+Be+Somebody&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1235282389,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Gotta Be Somebody&quot; is the first official single to be released from Nickelback's sixth studio album, Dark Horse. Originally, the lead single from the album was set to be &quot;If Today Was Your Last Day&quot;  but was changed instead to &quot;Gotta Be Somebody&quot;. The song was digitally delivered to all formats on September 29, 2008.  It was available on September 29 for free download for 24 hours only on participating radio station websites and the band's website, after which it was released to all digital markets for paid digital download on September 30th. The song has already reached #1 on American iTunes Rock Chart and #3 on the overall top selling songs. It shot to the #1 spot overall on the Canadian iTunes store.\n\nIt was used in a video package for the 2008 WWE Tribute to the Troops show.\n\nIn October 2008, it was reported that an official video from the commercial shoot had been shot with director Jessy Terrero.  However, after claims that the band was dissatisfied with the video, it was scrapped, and it was unknown whether a new video would be made. It was then reported that a new video had been shot in Vancouver with long-time collaborator Nigel Dick. The video debuted at AOL on Monday, December 15, 2008. This was nearly three months following the release of the single, with the late release due to the band having to redo the video for the song.\n\nThe video for &quot;Gotta Be Somebody&quot; starts out in Outer Space, showing various planets before zooming in on Earth. Nickelback is shown playing at the Colosseum in Rome, which is empty. During the chorus, an earthquake comes and cracks the ground the band is standing on. The band is then shown playing on the Brooklyn Bridge in New York City. Again, an earthquake begins during the chorus. The band is finally shown playing an outdoor concert to fans, in the US desert Southwest, at the Aircraft Boneyard. The video has reached #1 on VH1's Top 20 Countdown after only three weeks, overtaking BeyoncÃƒÂ©'s Single Ladies (Put A Ring On It).\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:f1ee30e83e719ff2b70a80d4f36d9c1ddaceb838","amp;dn":"Nickelback+-+Gotta+Be+Somebody","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1ee30e83e719ff2b70a80d4f36d9c1ddaceb838","infoHashBuffer":{"type":"Buffer","data":[241,238,48,232,62,113,159,242,183,10,128,212,243,109,156,29,218,206,184,56]},"announce":[],"urlList":[]}}