{"title":"Shapeshifter / Visionary Music - Healing CD (Multidimensional Mu","uid":6558111,"size":197193678,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f1f47800f165b908e472631d545e3337979a2755&amp;dn=Shapeshifter+%2F+Visionary+Music+-+Healing+CD+%28Multidimensional+Mu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1311355970,"description":"Warm and vibrant electronic keyboard melodies that gently invite the listener to travel on an inward journey to connect with their soul in blissful communion. Tones, sounds, patterns and pulses that will awaken dormant memories of past lives and ancient wisdom lying deep within the cellular structure of the body. A gentle celebration of life; a timeless composition that can be used throughout ones lifetime in many ways -- from pre-birth to final transition. The melodies in this higher vibrational music were created with the intent of creating wholeness, uplifting the vibrational essence and returning one's conscious awareness to The Source.\n\nRecommended For...\n\nExcellent for transformational work, meditation, yoga, massage, Reiki healing, transpersonal therapy, pastlife regression, rebirthing and all sound healing &amp; therapeutic environments. While the sounds are gentle and loving, they can initiate feelings of remembering HOME as it awakens deep soul longings for a higher purpose in one's life. Good soundscape for those just beginning with Shapeshifter's work and sound healing music in general. Gentle and calming for final transition period; play 24/7 in loved ones environment. Expecting mothers and unborns/newly born will love this piece as it bring a state of peace and calmness to the pre and post birthing process. Play in babies room after birth to continue cocooning the baby in these loving frequencies. Excellent to play in background environments and during sleeptime.","torrent":{"xt":"urn:btih:f1f47800f165b908e472631d545e3337979a2755","amp;dn":"Shapeshifter+%2F+Visionary+Music+-+Healing+CD+%28Multidimensional+Mu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1f47800f165b908e472631d545e3337979a2755","infoHashBuffer":{"type":"Buffer","data":[241,244,120,0,241,101,185,8,228,114,99,29,84,94,51,55,151,154,39,85]},"announce":[],"urlList":[]}}