{"title":"Castle Waiting V1 and The Curse of Brambly Hedge ","uid":8689817,"size":259807400,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f267ad21b73250cc33ebdf7d74b3be3e9f2a336a&amp;dn=Castle+Waiting+V1+and+The+Curse+of+Brambly+Hedge+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1373863145,"description":"Castle Waiting is an Eisner Award winning comic book series created by Linda Medley. It is in a world of fairy tales and mythology featuring a mix of old-fashioned storytelling and more ironic, modern touches. The series brings together characters from several classic fairy tales, such as Simple Simon and Iron Henry, as well as referencing several others such as Jack and the Beanstalk and Sleeping Beauty. The story focuses predominantly on the daily lives of the characters and their interactions with one another, as well as their complicated pasts.\n\nThe story begins with a stand-alone, prologue tale, Castle Waiting: The Curse of Brambly Hedge, which retells the story of Sleeping Beauty mostly from the perspective of those at the periphery of the action. The book then picks up many years later, after the castle, long abandoned by Sleeping Beauty, has become a home for another group of fairytale characters, many of whom have rather troubled pasts. The castle's daily workings are now overseen by Rackham, a stork-headed dandy, and the place has become somewhat run-down and is beset by mischievous but generally friendly sprites and poltergeists. This story focused on Lady Jain, a pregnant woman fleeing her abusive husband. The series details backstories for some of the characters, such as elaborating on how the bearded nun Sister Peace arrived at the castle. Later chapters show Jain settling in to the castle's keep with her baby with the help of some Hammerlings and the fellow residents of the castle.\n\n\nWritten and Illustrated by Linda Medley\n\n\n'Castle Waiting - The Curse of Brambly Hedge'\nOlio Press, 1996, 96 pages\n\n\nIssues 1-16 of 'Castle Waiting V1'\nOlio Press/Cartoon Books, 1997-2003, 28-36 pages\n\n\nThe complete 'Castle Waiting V2' is available here...\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/7848661/Castle_Waiting_v2_1-18_(2006-2012)_%5BFantagraphics%5D&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/7848661/Castle_Waiting_v2_1-18_(2006-2012)_%5BFantagraphics%5D&lt;/a&gt;","torrent":{"xt":"urn:btih:f267ad21b73250cc33ebdf7d74b3be3e9f2a336a","amp;dn":"Castle+Waiting+V1+and+The+Curse+of+Brambly+Hedge+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f267ad21b73250cc33ebdf7d74b3be3e9f2a336a","infoHashBuffer":{"type":"Buffer","data":[242,103,173,33,183,50,80,204,51,235,223,125,116,179,190,62,159,42,51,106]},"announce":[],"urlList":[]}}