{"title":"The Eugenics Wars: Vol 1","uid":9614491,"size":744809,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f294125db6a2463d9989ec8d0d2a27ba06c7ac71&amp;dn=The+Eugenics+Wars%3A+Vol+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"seyer_21","files":1,"time":1392394784,"description":"Even centuries later, the final decades of the twentieth century are still regarded -- by those who know the truth of what really happened -- as one of the darkest and most perilous chapters in the history of humanity. Now, as an ancient and forbidden technology tempts mankind once more, Captain James T. Kirk of the Starship Enterpriseâ„¢ must probe deep into the secrets of the past, to discover the true origins of the dreaded Eugenics Wars -- and of perhaps the greatest foe he has ever faced. \n1974 A.D. An international consortium of the world's top scientists have conspired to create the Chrysalis Project, a top-secret experiment in human genetic engineering. The project's goal is nothing less than the creation of a new, artificially improved breed of men and women: smarter, faster, stronger than ordinary human beings, a super-race to take command of the entire planet. \nGary Seven, an undercover operative for an advanced alien species, is alarmed by the project's objectives; he knows too well the apocalyptic consequences of genetic manipulation. With his trusted agents, Roberta Lincoln and the mysterious Isis, he will risk life and limb to uncover Chrysalis' insidious designs and neutralize the awesome threat that the Project poses to the future. \nBut he may already be too late. One generation of super-humans has already been conceived. As the years go by, Seven watches with growing concern as the children of Chrysalis -- in particular, a brilliant youth named Khan Noonien Singh -- grow to adulthood. Can Khan's dark destiny be averted -- or is Earth doomed to fight a global battle for supremacy? \nTHE EUGENICS WARS: Volume One is an engrossing and fast-paced thriller that explores the secret history of the twentieth century -- and the rise of the conqueror known as Khan.","torrent":{"xt":"urn:btih:f294125db6a2463d9989ec8d0d2a27ba06c7ac71","amp;dn":"The+Eugenics+Wars%3A+Vol+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f294125db6a2463d9989ec8d0d2a27ba06c7ac71","infoHashBuffer":{"type":"Buffer","data":[242,148,18,93,182,162,70,61,153,137,236,141,13,42,39,186,6,199,172,113]},"announce":[],"urlList":[]}}