{"title":"Kim Kardashian, Superstar - Interracial Porn XXX","uid":10220190,"size":2046123906,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f29527ae438c6aff7365cc7762bdf076501399b6&amp;dn=Kim+Kardashian%2C+Superstar+-+Interracial+Porn+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KidAtomic","files":-1,"time":1401032059,"description":"Kim Kardashian Superstar\n\nCOVERS AND SCREENS FOUND HERE:     &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=4&lt;/a&gt;\n\nXXX Hardcore And Candid! The Tape They Tried To Hide!\n\nThat sex tape starring Kim Kardashian definitely exists, and now it's now on DVD, thanks to Vivid Entertainment!\n \nThis movie, made by Kim's ex-boyfriend Ray J (brother of Brandy), features explicit water sports as well as other raunchy antics!\n \nExplicit sex that fans of erotica will find very appealing featuring two young and glamorous high profile celebrities.\n \nThe production is crystal clear and viewers will definitely get their money's worth.\n\nSpecial Collector`s Edition Limited Release. Uncut! Unedited! Uncensored! Unbelievable! \n \nShe's the daughter of O.J. Simpson's lawyer Robert Kardashian, the stepdaughter of Olympic gold medalist Bruce Jenner, and the best friend of Paris Hilton. He's a best-selling indie hip hop recording artist who has been linked with Lil' Kim and most recently Whitney Houston. Once you see the meat he's packing you'll see why. Kim Kardashian: Superstar... she makes Paris look like Mayberry!\n\n\n2007, approx. 100 min\n\nCountry:  US\n\nStudio :  Vivid, Vivid Celeb\n\nCast:  Kim Kardashian, Ray J \n\nGenre: Amateur\n\nDirector: Ray J.\n\nCast: Kim Kardashian, Ray J.\n\nLength: 41 minutes\n\nDate of Production: 2/7/2007\n\nBody of Review: Porn has long been part of the entertainment industry, a part some would try to deny, but one that consumers have voted in favor of time and again with their hard earned dollars. One of the things about reviewing porn that has to be kept in mind is that every person is a majority of one when it comes to what works for getting them off, and many of us reviewers try to point out that your mileage may vary when it comes to our ratings, suggestions, and personal tastes. That said, one of the year's biggest &quot;event&quot; titles to come out lately is the Kim Kardashian, Superstar release by Vivid Entertainment. The movie uses footage taken from 2003 when Kim Kardashian was dating a hip hop performer professionally known as Ray J.; his birth name being Willie Ray Norwood Jr. She is best known in social circles as the daughter of a once famous attorney and as the friend of Paris Hilton. Paris is one of the pseudo celebrities that made her own sex tape several years back, competing with Dustin Diamond for worst performance on camera by a wannabe (the bonus scenes in her flick were so much better that it's almost laughable how much mileage the movie got at the time). Ray J., on the other hand, has an extensive list of credits as a singer and actor, albeit for the kind of roles that no one ever seems to remember but his music isn't hard on the ears even if it lacks originality. In terms of celebrity status then, neither of the two principles in the movie was well known outside of limited circles until now; with the release of the sex footage he shot of them.\n\nScene One: Kim Kardashian, the curvy brunette seen on the right hand side of the front cover, was initially putting on her make up while dressed in a terry cloth robe and generic underwear. She spoke directly to the camera, acknowledging its existence repeatedly, remarking that everyone thought her breasts were fake. Ray J. was mugging for the camera and after some montage footage of the gal, she started sucking his cock by the light of the small desk lamp in the room at night. The gal really could work a pipe and the editing helped make it last longer as it showed her from a few positions taking a few inches into her mouth, using her hand as most porn performers do these days.\n\nThe action picked back up moments later when he was going down on her, her nicely trimmed bush giving him little trouble as he slurped away on it, Kim claiming he was making her cum. The way she talked and how her muscles tensed up led me to believe that she was getting off a little but the static camera image really didn't catch much of the tongue on clit action except when they started and he zoomed in on her cookie. The scene then showed them out in public where she showed her &quot;bling&quot; before coming back to the same hotel room where she claimed to be shy as he shot her pussy in bed.\n\nScene Two: Kim Kardashian, half asleep in bed, was the center of attention to cameraman Ray J. as another edited bit of footage with lots of grain was presented. Her ass looked great but he spent more time shooting her pussy and the camera then looked like she was holding it as he penetrated her and ate her some more, all in the poorly lit hotel room. The guy had a big cock so I can see what she probably liked about him even if he spent a lot of time waving it around for the camera instead of using it to give her pleasure. The lighting here was really bad, not as bad as the Paris Hilton release but pretty close in nature. The scene faded away to show Kim with bed head and looking rough, going back to her putting on make up for you lipstick fans, even giving another glimpse of her feet for those who care.\n\nScene Three: Kim Kardashian, back in bed with Ray J., was then taking his cock in a modified doggy style, making the same noises when he was outside of her as when he was actually in her pussy. Hearing &quot;oh baby&quot; several dozen times has never worked for me in the past and it didn't do a lot for me here either, the montage editing of the blowjob footage back into the mix (in near silhouette form) proving to take something away from the scene, the looped vocals not matching her mouth movements either. I liked the way her ass cheeks rippled when he was tapping her cookie from behind but it was dark and the excitement was weakened by the vocal dub.\n\nScene Four: Kim, back in bed in the same underwear but this time seen front and slightly off to the left as she laid on her stomach, had Ray pumping away on her in doggy style in a cable version type of sexual encounter while her mouth movement did not match the vocals. Some of the same POV footage of him hitting it was also present, the camera then moving to show them from the front right before more of the same footage was offered up.\n\nScene Five: Kim was next seen on the beach in a G rated moment in her bikini before the show cut back to the bedroom where he was going down on her. The music sounded distorted here and went back to him tapping her from behind with a lengthy close up of their faces before some of the same footage was plopped in along with more of the same vocals. There were a few moments by the pool before some additional footage was reused to finish things up in the same hotel room bed, ending with a short missionary screw; her jerking him off to her mouth and titties.\n\nCOVERS AND SCREENS FOUND HERE:     &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=4&lt;/a&gt;","torrent":{"xt":"urn:btih:f29527ae438c6aff7365cc7762bdf076501399b6","amp;dn":"Kim+Kardashian%2C+Superstar+-+Interracial+Porn+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f29527ae438c6aff7365cc7762bdf076501399b6","infoHashBuffer":{"type":"Buffer","data":[242,149,39,174,67,140,106,255,115,101,204,119,98,189,240,118,80,19,153,182]},"announce":[],"urlList":[]}}