{"title":"Charles Rosen - Critical Entertainments: Music Old &amp; New (20","uid":8793496,"size":20862110,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f2d5805482dab13ed4c4db78876042189f5536e6&amp;dn=Charles+Rosen+-+Critical+Entertainments%3A+Music+Old+%26amp%3B+New+%2820&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"workerbee","files":-1,"time":1376012950,"description":"Charles Rosen - Critical Entertainments: Music Old and New (Harvard University Press, 2000).\n\nISBN: 9780674006843 | 352 pages | PDF\n\n\nAn extraordinarily gifted musician and writer, Charles Rosen (1927-2012) was a peerless commentator on the history and performance of music. Critical Entertainments brings together many of the essays that established him as one of the most influential and eloquent voices in the field of music in our time.\n\nThese essays cover a broad range of musical forms, historical periods, and issues -- from Bach through Brahms to Carter and Schoenberg, from contrapuntal keyboard music to opera, from performance practices to music history as a discipline. They revisit Rosen's favorite subjects and pursue some less familiar paths. They court controversy (with strong opinions about performance on historical instruments, the so-called New Musicology, and the alleged &quot;death&quot; of classical music) and offer enlightenment on subjects as diverse as music dictionaries and the aesthetics of stage fright. All are unified by Rosen's abiding concerns and incomparable style.\n\nIn sum, Critical Entertainments is a treasury of the vast learning, wit, and insight that we have come to expect from this remarkable writer. It will delight all music lovers.\n\n\nReviews\n\n&quot;Just beneath the playful surface textures of Rosen's writing, another purpose is being served. He pleads on behalf of artistic pleasure, and reminds his reader of the opportunistic scattering of attention that achieving it may require, yet conducts, from one of his own scattered occasions to the next, a bracing argument in favour of difficulty.&quot; -- Malcolm Bowie, The Times Literary Supplement\n\n&quot;Admirers of the through-composed studies Rosen has devoted to the Viennese classical style, Schoenberg, sonata forms, and the composers of the 'Romantic generation' will find much to stimulate and enrage them in these occasional pieces from the same workshop, but the reach of these essays extends well beyond the profession of music. They stake a bold claim for criticism itself, and spell out its responsibilities.&quot; -- Malcolm Bowie, The Times Literary Supplement\n\n&quot;Every virtue of Rosen's earlier work is instilled in the essays in this collection. They are not only for musicologists and musicians, they are written just as much for amateurs of music, in both senses of 'lovers' and 'non-professionals'. They are a luxury of insight and cultural allusion.&quot; -- A.C. Grayling, The Financial Times\n\n&quot;Fans of Rosen will be delighted with this collection of 18 articles, most of which appeared over the past two decades in the New York Review of Books. A consummate pianist who embraces Beethoven and Elliot Carter with equal fervor, Rosen writes with impressive authority on topics as diverse as Bach's keyboard music and feminist musicology. He is never shy about identifying and then eviscerating adversaries, yet he does so in such a courtly way, and with such lucid, persuasive prose, that they must feel a certain awe and honor. . . While the lay reader can appreciate most of the articles, the three pieces on Brahms are thick with musical examples and references to music theory and, as such, are clearly intended for the serious music student.&quot; -- Larry A. Lipkis, Library Journal\n","torrent":{"xt":"urn:btih:f2d5805482dab13ed4c4db78876042189f5536e6","amp;dn":"Charles+Rosen+-+Critical+Entertainments%3A+Music+Old+%26amp%3B+New+%2820","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2d5805482dab13ed4c4db78876042189f5536e6","infoHashBuffer":{"type":"Buffer","data":[242,213,128,84,130,218,177,62,212,196,219,120,135,96,66,24,159,85,54,230]},"announce":[],"urlList":[]}}