{"title":"Charles L. Grant - 5 Oxrun Station eBooks","uid":6558363,"size":3452753,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f2f6e8dd7a406ab3b4666d1dde3606d30b52088e&amp;dn=Charles+L.+Grant+-+5+Oxrun+Station+eBooks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Eddiehjjjfcfjfc","files":-1,"time":1311367669,"description":"Epub and Mobi\n\nCharles L. Grant - [Oxrun Station] Dialing The Wind\n\nFrom the dark porch of a lightless house the music rises, seeking those listeners desperate for love...for only they will hear the hidden secrets of this very special song.\n\nFour people are trapped by their innermost desires in an unbreakable, deadly web of terror, their souls bound fast by unearthly music and the sighing, hollow wind.\n\nCharles L. Grant - [Oxrun Station] The Grave\n\nJosh Miller has a talent for finding things. So far, the things people have asked him to find - antique tables, old movie posters - have been innocuous enough. And Andrea Montague, the daughter of a local writer, may be his most interesting find so far.\n\nBut no one's asked Josh to find the missing fifth victim of an unexplained auto accident - the one who vanished from the scene of the crash without leaving a trail of blood, though he must have been badly hurt. No one's asked Josh to look for the other missing people - residents of Oxrun Station who mysteriously and inexplicably vanished on their birthdays.\n\nSomeone very definitely doesn't want him to find the clearing full of century-old gravestones, the clearing that feels so evil.\n\nThis time, whatever Josh is hunting is hunting him, too...and it's hungry.\n\nCharles L. Grant - [Oxrun Station] The Orchard\n\nA warm evening in Oxrun Station - a lovely time for a picnic.\n\nIf only they hadn't chosen to visit the orchard...\n\nIt was the last lovely time. The first death seems to be an accident. But there's no doubt about the suicide, or the mutilation murder, or the horror that seizes the movie theater, or the terror that inhabits the hospital...all are the fruits of that night in the orchard.\n\nCharles L. Grant - [Oxrun Station] The Bloodwind\n\nIt grows from hate and fear and jealousy, rising over Oxrun Station in a miasma of terror and anger. Its target: anyone who dares to speak or act against its master.\n\nTo many in Oxrun Station, it is Pat Shavers who controls the bloodwind, for it strikes down her enemies. But Pat is terrified of the mysterious destructive force.\n\nThe earlier deaths have been accidents - hers will be murder.\n\nCharles L. Grant - [Oxrun Station] The Hour of the Oxrun Dead\n\nOxrun Station could be a spooky place, especially out by the Windsors', right next to the graveyard. At night Natalie heard eerie sounds out in the fog, among the tombstones, unnatural sounds made by unearthly things.\n\nNatalie's husband had been born in Oxrun Station. He loved the town, and served it well - and in return it killed him. Ben's death had left Natalie isolated in a strange town she could not call her own.\n\nHow strange and how deadly Oxrun Station could be, Natalie Windsor was about to learn. Once each year an ancient ritual was recreated, an ancient pact reinvoked - and Natalie Windsor was this year's sacrifice.","torrent":{"xt":"urn:btih:f2f6e8dd7a406ab3b4666d1dde3606d30b52088e","amp;dn":"Charles+L.+Grant+-+5+Oxrun+Station+eBooks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2f6e8dd7a406ab3b4666d1dde3606d30b52088e","infoHashBuffer":{"type":"Buffer","data":[242,246,232,221,122,64,106,179,180,102,109,29,222,54,6,211,11,82,8,142]},"announce":[],"urlList":[]}}