{"title":"Coast to Coast AM January 27 2013","uid":8076446,"size":56962122,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f42d39f77a48bb3429e0a1ededfa47787245b0da&amp;dn=Coast+to+Coast+AM+January+27+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1359391371,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t01-27-13\nHost: \tGeorge Knapp\nGuests: \tGrant Cameron, Richard Dolan, John Lear, Ardy Sixkiller Clarke\n\nGeorge Knapp was joined by ufologist Grant Cameron who discussed his analysis of government leaks into the classified world of UFOs. Historian and UFO researcher Richard Dolan appeared in the first half of the 2nd hour to talk about Cameron's new book and aviator John Lear joined the conversation in the second half of the 3rd hour. Cameron observed that UFO revelations often follow a pattern where researchers examine the information, then it becomes discredited, and &quot;everybody just drops the story&quot; in search of the next big disclosure. However, he refuted the idea that these are patently false stories planted by the government and suggested that, in fact, they contain accurate information which is then smeared with disinformation via holes in the story that have been created ahead of time.\n\nFurthering his thesis on these UFO disclosures, Cameron posited that the government is &quot;putting the information out, but they are keeping the cover up going&quot; by subsequently discrediting it. Additionally, he theorized that the era of UFO whistleblowers is over and anyone claiming to be such a witness is &quot;working for them.&quot; To that end, he said that, since the government would easily be able to identify any 'anonymous' whistleblower, then the person must be revealing these secrets at the behest of the 'powers that be.' Cameron also contended that &quot;all leaked documents are phony,&quot; because they are classified material and the government would swiftly arrest anyone who breached that official secrecy.\n\nIn the first half of the third hour, aviator John Lear joined the conversation to reflect on the Bob Lazar Area 51 revelations and how they may have fit into this plan of action by the government. He recalled how Lazar had been asked about his friendship with Lear during his second interview for the Area 51 job. As such, he surmised that the entire saga was initiated by the government, since they knew Lazar would eventually leak the information to him. While Cameron conceded that Lazar's academic history has been shown to be false, thus allowing for the government to dismiss his tale, he noted that the notorious whistleblower passed numerous lie detector tests and his accurate information about Area 51 is what allowed for the story to be revealed.\n\nAppearing during the first half of the second hour, historian Richard Dolan, who is publishing Cameron's new book (co-authored with Scott Crain), called it &quot;possibly the single best book, best I've ever read, dealing with inside government leaks from credible sources about the reality of the UFO phenomenon.&quot; Regarding the theory that the government leaks accurate information and then discredits it, Dolan noted that it represents the ideal way of getting UFO secrets out to the general public without &quot;destabilizing the whole system.&quot;\nStar People Encounters\n\nIn the first hour, Ardy Sixkiller Clarke detailed her research into Native American encounters with Star People. Since tales of alien encounters have been passed down for generations amongst Native Americans, she said that such stories are treated as normal events even in contemporary times. Clarke professed absolute belief in the veracity of the stories she was told by various Native Americans, who had these paranormal encounters, and stressed that they were &quot;alert recollections&quot; told to her rather than tales procured via hypnosis or a dream state. Over the course of her appearance, she shared stories of modern Native American UFO and alien encounters as well as insights into Skinwalkers and Sasquatch.\nWebsite(s):\n\n    presidentialufo.com\n    sixkiller.com\n    keyholepublishing.com\n    afterdisclosure.com\n    thelivingmoon.com\n\nBook(s):\n\n    Encounters with the Star People\n    A.D. After Disclosure\n\n","torrent":{"xt":"urn:btih:f42d39f77a48bb3429e0a1ededfa47787245b0da","amp;dn":"Coast+to+Coast+AM+January+27+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f42d39f77a48bb3429e0a1ededfa47787245b0da","infoHashBuffer":{"type":"Buffer","data":[244,45,57,247,122,72,187,52,41,224,161,237,237,250,71,120,114,69,176,218]},"announce":[],"urlList":[]}}