{"title":"Anomaly - Warzone Earth GOG","uid":7994777,"size":472102701,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f52d5afa8855ad963e0b18f7f96e1ae15f41ef59&amp;dn=Anomaly+-+Warzone+Earth+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"AN0NYMOUS142857","files":-1,"time":1357582568,"description":"genre: strategy / action / tactical\nrelease date: April 8, 2011\ncompatible with: Windows XP, Windows Vista, Windows 7 (32 &amp; 64 bit)\nlanguages: English, French, German, Polish, Russian,Spanish, Italian.\ndeveloper / publisher: 11 bit studios / 11 bit studios\ngame modes: single-player\n\nBonus content included for FREE with purchase:\nwallpaper\nsoundtrack\n4 avatars\n5 artworks\n\nWhat's cool about it:\n\n    Nominee for Best Strategy Game of the Year 2011 on Gamespot and on Game Informer!\n    The first &quot;Tower Offense&quot; strategy game ever. It plays like a regular tower defense game, but this time you're the attacker.\n    Plenty of tactical possibilities for strategic minds: squad management, deployment planning, and constant cooperation between the troops and the Commander!\n\nOverview:\n\nAnomaly Warzone Earth is an extraordinary mixture of action and strategy in a reversed tower defense formula. The game tasks you with saving a near-future Earth from an alien onslaught. The invaders have captured several of the world s major cities, building huge turrets that destroy everything in their path. It s up to you to lead an armor squad through the streets of cities like Baghdad and Tokyo, planning the route and strategically choosing which units to deploy in order to crush the opposition. Take control of the Commander, whose special abilities and quick thinking will be vital in supporting the squad in its mission as you engage in fast-paced, tactical battle across a story-driven campaign and in two heart-pounding Squad Assault Modes.\n\nEnjoy innovative game play, mixing action and strategy in a clever twist on the familiar formula--because this time you're attacking the towers. You will need to think both tactically and strategically, choosing the right squad and the best route for each mission. What worked in the last mission might lead you to wrack and ruin in the next one! Extend tactical possibilities by gathering resources to buy new units and upgrade your squad during a battle. The great graphics and audio tie this game up in a neat bundle, and a sure-fire hit with strategy and action fans alike.\n\nAge requirements: ESRB Rating: EVERYONE 10+ with Fantasy Violence, Language. PEGI Rating: 12+ with Bad Language, Violence.\n\nMinimum system requirements: Windows XP / Windows Vista / Windows 7, Intel Pentium 4 2.4GHz or AMD Athlon 64 +2800, 1 GB RAM, NVIDIA GeForce 7600 / ATI Radeon X1800 or equivalent, DirectX 9.0c, 1GB HDD, Mouse, Keyboard.\n\nInstallation\n\n1. Double click the .exe\n2. Click next, accept the EULA, select which path you want the game installed to, ect.\n3. Play","torrent":{"xt":"urn:btih:f52d5afa8855ad963e0b18f7f96e1ae15f41ef59","amp;dn":"Anomaly+-+Warzone+Earth+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f52d5afa8855ad963e0b18f7f96e1ae15f41ef59","infoHashBuffer":{"type":"Buffer","data":[245,45,90,250,136,85,173,150,62,11,24,247,249,110,26,225,95,65,239,89]},"announce":[],"urlList":[]}}