{"title":"Beck, Mathewson, Humair - Jazz Trio - 1972 (2005 AL1017-2)","uid":8631962,"size":228420738,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f5b557b7e21a91e82e84a4a8253725d365cf59a6&amp;dn=Beck%2C+Mathewson%2C+Humair+-+Jazz+Trio+-+1972+%282005+AL1017-2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1372650715,"description":"eac secure with cue log and scans\n\nGordon Beck, Ron Mathewson, Daniel Humair - Jazz Trio - 1972 (2005 AL1017-2)\n\nOriginally recorded at Fontana Studios in Milan, Italy in January 1972 and subsequently released on the Italian Dire label on LP the same year. Art of Life Records is proud to make this long out-of-print recording available on CD for the first time ever! The 8-page CD booklet includes the original album cover artwork, photos and liner notes exactly as they appear on the original LP release. Recorded during a tour of Italy with Phil Woods, the European Rhythm Machine, consisting of Gordon Beck, Ron Mathewson and Daniel Humair, recorded this entire album in the course of one morning. The album features two long compositions, Suite No. 5, composed by Gordon Beck and performed in three movements followed by the track, All In the Morning, composed by Gordon Beck, Ron Mathewson and Daniel Humair and performed in two movements. All tracks have been digitally re-mastered using 24-bit digital technology.\n\n\nEasily overlooked as a piece of obscure 1970s Britjazz nostalgia, and short and sweet at 36 minutes, this is an Italian recording of two suites that pianist Gordon Beck conceived with bassist Ron Mathewson and drummer Daniel Humair in 1972. It is short, but far from insubstantial. The opening section of Suite No 5 reflects Beck's immensely sophisticated grasp of the alternative implications of Bill Evans - his faultless timing of the turn of a fast phrase is always startling, and there's an unexpected amount of free-improv. All in the Morning sometimes sounds like Herbie Hancock baiting Tony Williams in Miles's 1960s band before it becomes an astonishing collective improvisation, Beck's steel-hard chords calling and responding to Humair's chattering snare and lashing rimshots.\nJohn Fordham The Guardian\n\nAt the time, this seemed a belated and hard-to-find follow-up for Beck's 1968-69 albums &quot;Experiments With Pops&quot; and &quot;Gyroscope&quot; (both already reissued by Art of Life). Replacing Tony Oxley with Humair and Jeff Clyne with Mathewson was logical because, when Beck took over from George Gruntz and the bassist filled in for Henri Texier, this was the then-current rhythm-section of European-resident Phil Woods. The division of the music into two LP-side-length suites disguises to some extent the amount of variety within the original material, with 'Side One' (as it was) being credited to Beck and 'Side Two' to all three players. But there's a wide span leading from piano-led tunes, recognisably from the same pen as those on &quot;Gyroscope&quot;, to free group improvisations that are exciting but not wild. Anyone captivated by the elusive pianist's recent work, or aware of his contributions to European Jazz over the decades, is likely to relish this more that the latest stuff out of Scandinavia.\nBrian Priestley Jazzwise Magazine\n\nBritish pianist Gordon Beck is simply not as well known here in the States as he should be, given his long and fruitful career and hopefully this reissue will help set that right. The propulsive rhythm section of what at that time constituted the Phil Woods Rhythm Machine gets two extended workouts, all recorded in one morning while on a European tour. It would be fine to cite the Bill Evans primer as a major influence on Beck, but it would be selling him short. The breadth and diversity of ground covered in this session is astounding, from gorgeous postbopflurry to sparse and razor-sharp post-Webernianpointalistic free jazz. None of this should come as any surprise, Beck having worked previously with the incredible and irrepressible timbral powerhouse Tony Oxley. In other hands, such forays into experimentation might come off as mere flirtations, but the trio is obviously so comfortable with every gesture, composed or otherwise, that the album coheres beautifully and seamlessly. About half way through the first track, when freer terrain is traveled, Daniel Humairs brushwork is complemented beautifully by Ron Mathewsons effortless fast slides and runs on bass. Eventually, Beck can be found inside the piano, Humair and Mathewson bowing and scraping along with him. The second track has a similar blueprint, except that Humair takes a driving solo that quickly turns funky and everyone follows suit with alacrity.\n\nArt of Lifes commitment to Becks work is cemented even further with this reissue and they should be congratulated for putting such a fine disc back into circulation.\nMarc Medwin All About Jazz New York\n\n\n","torrent":{"xt":"urn:btih:f5b557b7e21a91e82e84a4a8253725d365cf59a6","amp;dn":"Beck%2C+Mathewson%2C+Humair+-+Jazz+Trio+-+1972+%282005+AL1017-2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5b557b7e21a91e82e84a4a8253725d365cf59a6","infoHashBuffer":{"type":"Buffer","data":[245,181,87,183,226,26,145,232,46,132,164,168,37,55,37,211,101,207,89,166]},"announce":[],"urlList":[]}}