{"title":"Anita Wardell - 2006 - Noted FLAC","uid":8522647,"size":389703653,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f753f6689bb6300c5fefb9c0f7064a88eb12e80b&amp;dn=Anita+Wardell+-+2006+-+Noted+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1369951271,"description":"Anita Wardell - 2006 - Noted\n\nThe best straight-ahead jazz singer on the scene today is Anita Wardell, the winner of the prestigious BBC Jazz Award last month, and Noted is one of the most impressive displays of vocal jazz and vocalese in many years. Backed up by her usual working trio of pianist Robin Aspland, bassist Jeremy Brown and drummer Steve Brown (along with guest saxophonist Alex Garnett), Wardell delivers knockout performances of well-known jazz classics and less familiar works that she has updated using her own unique swinging style.\nThe album starts off with a rousing rendition of Jon Hendricks' vocalese to the jazz classic &quot;Moanin'. Aside from her scatting and improvisational abilities, Wardell possess an almost flawless vocal technique. Indeed, one would be hard pressed to find clearer enunciation and pitch from a Bartoli or Netrebko.\nStandards receive their due from Wardell and company, in particular &quot;Night and Day and &quot;Autumn Leaves. The arrangement of the latter is especially nice when it goes into double time. The unrelenting swing of the former displays Wardell's scatting in its fullest virtuosity and also features a particularly nice piano solo by Robin Asplund.\nHorace Silver's well-known &quot;Doodlin' was a logical choice for this album, and it is performed here with great aplomb. But a real treat is the soulful rendition of Silver's less well-known &quot;Lonely Woman. Herbie Hancock receives similar treatment with a pairing of his oft-performed &quot;Watermelon Man and his lesser-known &quot;And What If I Don't. As far as I am aware, this is the first recording of a vocal version of the latter tune.\nAnother piece that Wardell has rescued from relative obscurity is Ben Raleigh and Sherman Edwards' &quot;Wonderful, Wonderful, which was a minor hit for Johnny Mathis in 1957 and for the Supremes in the early '60s. Wardell's up-tempo version completely transforms this tune and would make a great candidate for a big band accompaniment.\nAs always, Wardell surrounds herself with first-class musicians. Long-time collaborators Robin Asplund, Steve Brown and Jeremy Brown make up an almost perfect rhythm section for a singer. They are all superb soloists in their own rights, and their understated accompaniment is a paradigm of taste and musicality. Saxophonist Alex Garnett combines the intensity of an Art Pepper with a lighter tone a la Grover Washington, Jr.\nNoted is an important album and a testament to Anita Wardell's rising status as a jazz artist of the first caliber. With a BBC Jazz Award under her belt, a Jazz Grammy should not be too far behind. (AllAboutJazz)\n\nTrack List:\n01 Moanin'\n02 Watermelon Man\n03 Autumn Leaves\n04 Night and Day\n05 Lonely Woman\n06 Doodlin'\n07 The Sidewinder\n08 Blues on the Corner\n09 Wonderful, Wonderful\n10 And What If I Don't\n\nPersonnel:\nAnita Wardell: vocals;\nRobin Asplund: piano;\nJeremy Brown: bass;\nSteve Brown: bass;\nAlex Garnett: saxophones.\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:f753f6689bb6300c5fefb9c0f7064a88eb12e80b","amp;dn":"Anita+Wardell+-+2006+-+Noted+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f753f6689bb6300c5fefb9c0f7064a88eb12e80b","infoHashBuffer":{"type":"Buffer","data":[247,83,246,104,155,182,48,12,95,239,185,192,247,6,74,136,235,18,232,11]},"announce":[],"urlList":[]}}