{"title":"Fol Chen - The False Alarms (2013) [FLAC]","uid":8284058,"size":239369721,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f7b1554ffd598f931c2c89859d48ac11abbad559&amp;dn=Fol+Chen+-+The+False+Alarms+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1363904113,"description":"\n  Fol Chen - The False Alarms (2013) [FLAC]\n\n  Released: 2013\n  Duration: 41:16\n  Genre: Pop/Rock\n  Style: Alternative, Indie Pop\n  Source: CD\n  Codec: FLAC\n  Bit Rate: ~ 750 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 The False Alarms\n  02 I.O.U.\n  03 A Tourist Town\n  04 Hemispheres \n  05 The Fifth Season\n  06 Boys in the Woods\n  07 200 Words\n  08 You Took the Train\n  09 Doubles \n  10 This Place Is on TV\n\n  During the early part of their career, Fol Chen cloaked the identity of their bandmembers in mystery. Not so on their third album, The False Alarms; producers Samuel Bing and Julian Wass, and new singer Sinosa Loa, revealed themselves as some of the names behind the music. Likewise, these songs are somewhat less enigmatic than before: the melodies are ever so slightly more direct, even though intricate arrangements and hooks that sneak up on the listener are still what make this band distinctive. Loa is a fitting collaborator for Bing and Wass; with her sweet vocals and aloof demeanor, she beckons listeners to come closer -- but not too close, and this kind of push-pull has defined Fol Chen since the beginning.\n\n  They make the most of her restraint on frothy tracks like &quot;I.O.U.&quot; and &quot;Doubles,&quot; which could be almost obnoxiously catchy with a more dominant singer, and on the playfully deadpan synth pop of &quot;Boys in the Woods,&quot; which not only shows that Fol Chen has a sense of humor, but also sounds like a more laid-back descendant of the Flying Lizards' version of &quot;Money.&quot; &quot;A Tourist Town&quot;'s fusion of world music and chamber pop gives the impression that Loa is singing about a hot summer street scene from the comfortable remove of an air-conditioned high rise, and is another standout. At times, the band take their reserved approach too far, and tracks like &quot;Hemispheres&quot; and &quot;200 Words&quot; nearly fall flat from the lack of a stronger vocal presence. However, even the most insular tracks here end up feeling more alluring than excluding. Fol Chen could probably stand to become even more accessible on their next album, but on The False Alarms, they still make listeners lean in close to hear exactly what's going on, and still leave them wanting more.","torrent":{"xt":"urn:btih:f7b1554ffd598f931c2c89859d48ac11abbad559","amp;dn":"Fol+Chen+-+The+False+Alarms+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7b1554ffd598f931c2c89859d48ac11abbad559","infoHashBuffer":{"type":"Buffer","data":[247,177,85,79,253,89,143,147,28,44,137,133,157,72,172,17,171,186,213,89]},"announce":[],"urlList":[]}}