{"title":"The Big Book Of... (Paradox Press) [ADULT]","uid":5524636,"size":1732938062,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f8e5c1b59752c2974ba7cf4e2fd324aee854d9d4&amp;dn=The+Big+Book+Of...+%28Paradox+Press%29+%5BADULT%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1272735041,"description":"The Big Book Of is an Eisner Award-winning series of graphic novel anthologies published by the DC Comics imprint Paradox Press, which was the forerunner of the Vertio imprint.\n\nThe Big Books were published between 1994 and 2000. Just over half of them (ten out of seventeen) were written by a single author (including Doug Moench and John Wagner), with Jonathan Vankin taking over the writing of the later volumes.  A wide range of artists worked on the stories. Notably it was the first American work for Frank Quitely. Rick Geary states he is the only artist to contribute to all seventeen volumes. E.C. alums Joe Orlando, George Evans and Marie Severin are present as are Russ Heath and Gray Morrow. The Big Books were the last stands of masters of horror Tom Sutton and Pat Boyette. Other artists who were regular contributors to the series as a whole include Bob Fingerman, Eric Shanower, Lennie Mace, Randy DuBurke, James Romberger, Salgood Sam, Steve Leialoha, Joe Sacco and Roger Langridge.\n\n\nUrban Legends\nPublished in 1994 with writers Robert Boyd, Jan Harold Brunvald, and Robert Loren Fleming; the Big Book of Urban Legends won the 1995 Eisner Award for Best Anthology. Collected by Brunvand, the two hundred tales in this volume are folklore for our times.\n\n\nWeirdos\nPublished in 1995 and written by Carl Posey, the Big Book of Weirdos illustrates the biographies of sixty-seven of the world's greatest eccentrics. Among those covered are Caligula, Thomas Edison, Henry Ford, Henrietta Howland Robinson, Harry Houdini, and the Marquis de Sade. The book features an introduction by Gahan Wilson.\n\n\nDeath\nPublished in 1995 and written by Bronwyn Carlton, the Big Book of Death begins by providing the inside story on execution methods - from drawing and quartering to the electric chair. From there it moves on to bizarre suicides, weird deaths, burial methods, and the great beyond. The reader learns the origin of the guillotine, visits cryogenically-preserved bodies, and even sees how cheese can be used as a murder weapon.\n\n\nConspiracies\nPublished in 1995 and written by Doug Moench, the Big Book of Conspiracies won the 1996 Eisner Award for Best Anthology. It focuses on plots and cover-ups, including the Watergate scandal, Silkwood, the Iran-Contra scandal, and the assassinations of John F. Kennedy, Malcolm X, Robert Kennedy, and Martin Luther King. This book explores all these schemes and more, using a stream of real and imagined &quot;facts&quot; to explain how shadowy forces - including the CIA, the Freemasons, the Holy See, the Trilateral Commission, and even extraterrestrials - may be conspiring to shape world events.\n\n\nFreaks\nPublished in 1996 and written by Gahan Wilson, the Big Book of Freaks features an introduction from stage magician-turned-film star and &quot;scholar of the unusual&quot; Ricky Jay, who has written a number of books on related subjects.  The book features stories on all manner of odd and interesting people, from sideshow freaks to legendary creatures, (including giants), the subjects of Tod Browning's famous film and exhibitors including P. T. Barnum.\n\n\nLittle Criminals\nPublished in 1996, the Big Book of Little Criminals details some of the world's most incompetent felons, such as Shanghai Kelly, who kidnapped men and forced them to work on ships. Also stories of U.S. Senators caning their colleagues, colonial counterfeiters, the Hitler Diaries forgeries, and a crook who nearly succeeded in buying Portugal.\n\n\nHoaxes\nPublished in 1996, The Big Book of Hoaxes illustrates history's great hoaxes, pranks, and scams, including such notable put-ons as Mary Toft, the &quot;Bunny Mommy,&quot; who convinced the court of England that she had given birth to at least sixteen rabbits. Other scams from the book include Charles Ponzi and his get-rich-quick schemes, the infamous &quot;Princess Caraboo,&quot; the Hitler Diaries, and a plan to saw Manhattan in half.\n\n\nThugs\nPublished in 1996 and written by Joel Rose, the Big Book of Thugs documents criminals who get what they want not through any sort of cleverness, but through direct action and pure force, including the Thuggee of India, and the &quot;Ohio Gang,&quot; which disgraced the Harding Administration.\n\n\nLosers\nPublished in 1997 and written by Paul Kirchner, the Big Book of Losers proves that the misfortunes of others (such as Elisha Gray, who invented a telephone prototype before Alexander Graham Bell) really can be funny.\n\n\nThe Unexplained\nPublished in 1997 and written by Doug Moench, the Big Book of the Unexplained features an introduction and narration by the ghostly image of Charles Fort (a deceased writer and researcher into anomalous phenomena). Stories of impossible animals, lost continents, and bizarre phenomena, such as the mummy's curse, living dinosaurs, the Loch Ness Monster, Bigfoot, alien abductions, and rains of frogs.\n\n\nMartyrs\nPublished in 1997 and written by John Wagner, the Big Book of Martyrs examines the lives and deaths of Christian martyrs, including Saint Valentine, Joan of Arc, Saint Ursula, and Saint George. The last chapter deals with people who have been tortured for their faith in more recent history, demonstrating that religious fervor is not a thing of the past.\n\n\nScandal!\nPublished in 1998 and written by Jonathan Vankin, the Big Book of Scandal features an introduction &amp; afterword by Stephen DeStefano. The twelfth Big Book wallows in the lurid world of tabloid news. Fatty Arbuckle, Charlie Chaplin, John DeLorean, Richard Nixon, Oliver North, and O.J. Simpson are all examined.\n\n\nBad\nPublished in 1998, the Big Book of Bad is written by Anina Bennett, Jonathan Vankin, and Paul Kirchner.\nThe thirteenth Big Book examines evil, like Heinrich Himmler, the architect of the Nazis' &quot;Final Solution;&quot; the depraved emperors of ancient Rome; and various serial killers. Then there are proponents of the banal, like poet Rod McKuen and real estate developer William Levitt. Finally, there are fictional villains like Professor Moriarty, Lady Macbeth, and Dracula.\n\n\nThe Weird Wild West\nPublished in 1998 and written by John Whalen, the Big Book of the Weird Wild West offers up over sixty stories of the unusual, the bizarre, and the downright creepy stuff that happened on the American frontier. Stories of Western characters like George Maledon, &quot;The Prince of Hangmen;&quot; homosexuality among macho cowboys; and the various ghosts that haunted the American West.\n\n\nVice\nPublished in 1998, and written by Dave Stern and Steve Vance, the Big Book of Vice examines alcohol, drugs, tobacco, sex, and gambling. Subjects range from the history of tobacco, to sexual slavery, to pinball machines.\n\n\nGrimm\nPublished in 1999 and written by Jonathan Vankin, the Big Book of Grimm examines fairy tales. Writer Vankin transcribes the original, unsanitized folk tales that the Brothers Grimm collected in the mid-1800s, detailing child abuse, incest, cannibalism, severed limbs and gouged-out eyes.\n\n\nThe '70s\nPublished in 2000 and written by Jonathan Vankin, the Big Book of the '70s documents ten years of &quot;tackiness and tumult.&quot; From disco to polyester fashion, the final Big Book itemizes the fads, personalities, slang, and social insanity that infected the 1970s (as well as the Vietnam War and some classic films).\n\n\nWild Women\nSlated for a 2001 release, Paradox had planned to publish the 18th book in the series, The Big Book of Wild Women. The book is narrated by &quot;Susie the Floozie,&quot; and was to profile notable women throughout history who had made an impact on our culture while pushing the envelope of unconventional behavior. Among the women to be profiled were risqu? nightclub singer-comic Rusty Warren, B-movie goddess Tura Satana, presidential candidate Victoria Woodhull, 19th century sex star Lola Montes, legendary seductress Cleopatra, scandalous writer Ana?s Nin, and kinky pin-up icon Betty Page. According to DC, however, the book is in a perpetual &quot;pre-production&quot; - even though much of the work on the book was completed by the contributing artists.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:f8e5c1b59752c2974ba7cf4e2fd324aee854d9d4","amp;dn":"The+Big+Book+Of...+%28Paradox+Press%29+%5BADULT%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8e5c1b59752c2974ba7cf4e2fd324aee854d9d4","infoHashBuffer":{"type":"Buffer","data":[248,229,193,181,151,82,194,151,75,167,207,78,47,211,36,174,232,84,217,212]},"announce":[],"urlList":[]}}