{"title":"The Rolling Stones - A Bigger Bang (2005) WMA320","uid":6320792,"size":177172122,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f8fdd7457e062b421816fc486a492b0a0ca45a8b&amp;dn=The+Rolling+Stones+-+A+Bigger+Bang+%282005%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1302936544,"description":"Since the mid-80's, every time the Rolling Stones release a new studio album, a horde of yahoos publish reviews claiming the new disc is the best the band has done since Exile On Main Street. This is patently absurd and those reviewers need to be spanked. \n\nA Bigger Bang is no Exile, it is not even in the league of Tattoo You but it is pretty darn good. I will go out on a limb and call it their best since Undercover. \n\nBigger Bang is a stylistically diverse set crowded with 16 tracks but other than one super-lame power ballad and a political rant thinly disguised as a song, none of the filler is really unwelcome and there are plenty of bright spots. How did they pull this off? It certainly is not due to any production magic by Don Was unless he was responsible for keeping it simple. This is the Glimmer Twins show 2005-style displaying enough confidence to bang out a record without an army of session guys and a mountain of overdubs. \n\nThe fun begins with the title and the &quot;Fascination with the origin of the universe&quot; press release. You can't call these guys snickering schoolboys anymore but a dirty joke from randy old goats is just as funny. More importantly, the music: \n\n1) Rough Justice- An energetic rocker miles better than recent tripe like &quot;You Got Me Rocking&quot;. Really good guitars. Although some of the verse-lyrics are stupid and despite the fact that Mick almost falls into his latter day habit of over-singing, the boys keep this one together marvelously. A good portent of things to come. \n\n2) Let Me Down Slow- A well constructed mid-tempo pop rocker featuring good singing and reflective lyrics from an old dog still doing his thing. Features a lyric that could sum up this surprisingly good record: &quot;Are you coloring your hair with some new kind of dye? Alternately, this could easily be a question that Mick, Keith or Ronnie asks each other over lunch. \n\n3) It Won't Take Long- Let the filler begin. A pedestrian rocker with been-there-done-that ...I'm gonna dump my girl / I'm better off without you lyrics. \n\n4) Rain Fall Down- This funky track was highly touted in the advance press and why not? Give them credit for trying something different. This enjoyable groover is not as good as say &quot;Emotional Rescue&quot; but better than &quot;Harlem Shuffle&quot;. I'd love to see the band put this in the &quot;Miss You&quot; slot on the current tour. \n\n5) Streets of Love- The one major mistake on the album. This super-lame Alfie soundtrack leftover (one would suppose) is a classic Mick attempt to cash in on the power ballad jackpot ala Aerosmith. Why does he feel compelled to produce this kind of pap? Does he actually enjoy listening to music like this? I am trying to imagine Mick Jagger cranking the soundtrack to a Meg Ryan movie while making the bed and tidying up around the house. I wonder if Keith and Joe Perry commiserate about having to appease their preening singers. Extra credit to Mick for incorporating &quot;Cross the Rubicon&quot; into syrupy dreck aimed at tweenage girls. \n\n6) Back of My Hand- Interesting. This is a real-deal, straight-up blues track featuring uncluttered guitar work and stinging harp. I would imagine that this evolved out of a warm up rehearsal jam but was considered good enough to finish. This is the kind of song that has been turning up on B-sides from their 90's releases. Keb 'Mo has nothing to be afraid of but this is not at all unwelcome. \n\n7) She Saw Me Coming- A guitar rocker with a bit of a groove to it. This is enjoyable filler that belongs in the &quot;Fake-Reggae&quot; sub-genre of tunes like &quot;Luxury&quot; and &quot;Send It To Me&quot; that the Stones own unto themselves. The lyrics are kind of funny and are the flip side to the misogynistic put down song. This time, she has the upper hand. \n\n8) Biggest Mistake- This is the Mick Show. A lovesick pop song featuring a bed of acoustic guitars with the occasional electric lick added for accent and flavor. Filler. \n\n9) This Place Is Empty- The kind of ragged, world-weary talk-sing crooner we have come to expect from Keith. A country-ish vibe (rather than a country track) telling a gentle, &quot;I miss my girl...&quot; story. Keith should do a solo album with nothing but ballads like this. \n\n10) Oh No, Not You Again- An energetic rocker with great guitars featuring a bit of the fabled Keith / Ronnie &quot;Weave&quot; hearkening back to the Some Girls era. The lyrics are simple but funny. This is my favorite song on the album and I look forward to seeing it live, it has the potential to become an on-stage barnburner in the vein of Respectable. \n\n11) Dangerous Beauty- A mid-tempo guitar rocker, definitely good filler but I suspect there might be something more here. This is potentially a hidden gem and might actually catch on with a good video. My only real criticism is that Mick sings in his &quot;Fake-Tough&quot; style, which almost sinks it. \n\n12) Laugh, I Nearly Died- This slow groover featuring highly stylized Mick vocals is a very enjoyable album track and one of the highlights on the record. Give them credit for trying something different, especially when they break it down at the end. This could be fantastic in a live theater setting. \n\n13) Sweet Neo Con- Right on Mick didn't see this one coming. Not really a song, this is a taunting rant veiled in a skeletal groove aimed squarely at the Bush administration direct from Mick Jagger. Not really a good song, (but hey, High wire was sort of weak too) I admire the sentiment, especially the &quot;Sweet&quot; emasculating aspect. Give Mr. Jagger credit for telling it like it is, I don't hear U2 or any other big name rock star getting down to it this directly. \n\n14) Look What the Cat Dragged In- An energetic, rocking groover that is filler but in a really good way. I wonder if the lyrics were inspired by Keith rolling in late for a session. \n\n15) Driving Too Fast- Generic rocker, inoffensive filler \n\n16) Infamy- Interesting Keith song. Kind of a mid-tempo groover. I don't hate it and I don't love it. Maybe it will be better live. &quot;...Got It In For Me&quot;, get it? \n\nOther than Streets of Love, I am very happy with this release. Of course these greedy bastids are planning to re-sell this to us at Christmas with a bonus DVD. Think it will contain bonus tracks to make it worth it? Don't hold your breath.\n\nby Christopher Bushman\n\nTRACKLIST:\n\n01 - Rough Justice.wma                                                \n02 - Let Me Down Slow.wma                                             \n03 - It Won't Take Long.wma                                           \n04 - Rain Fall Down.wma                                               \n05 - Streets Of Love.wma                                              \n06 - Back Of My Hand.wma                                              \n07 - She Saw Me Coming.wma                                            \n08 - Biggest Mistake.wma                                              \n09 - This Place Is Empty.wma                                          \n10 - Oh No! Not You Again.wma                                         \n11 - Dangerous Beauty.wma                                             \n12 - Laugh  I Nearly Died.wma                                         \n13 - Sweet Neo-Con.wma                                                \n14 - Look What The Cat Dragged In.wma                                 \n15 - Driving Too Fast.wma                                             \n16 - Infamy.wma                              \n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!\t","torrent":{"xt":"urn:btih:f8fdd7457e062b421816fc486a492b0a0ca45a8b","amp;dn":"The+Rolling+Stones+-+A+Bigger+Bang+%282005%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8fdd7457e062b421816fc486a492b0a0ca45a8b","infoHashBuffer":{"type":"Buffer","data":[248,253,215,69,126,6,43,66,24,22,252,72,106,73,43,10,12,164,90,139]},"announce":[],"urlList":[]}}