{"title":"Bee Gees - Stayin' Alive [promo].VOB","uid":5943961,"size":286791680,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f95858d28ca65761a401f033990fd0a6a4f1fa15&amp;dn=Bee+Gees+-+Stayin%5C%27+Alive+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1289285984,"description":"Bee Gees - Stayin' Alive [promo].VOB \n\n\n\nVery HQ promo music video. &quot;Stayin' Alive&quot; is a disco song by the pop group Bee Gees from the Saturday Night Fever motion picture soundtrack. The song was written by the Bee Gees - Barry, Robin, and Maurice Gibb - and produced by the Bee Gees, Albhy Galuten and Karl Richardson. It was released on December 13, 1977, as the second single from the Saturday Night Fever soundtrack. It is their signature song. \n\nThe song was not originally supposed to be released as a single, but fans called radio stations and RSO Records immediately after seeing trailers for Saturday Night Fever, in which the aforementioned introductory scene was played. The single was eventually released in mid-December, a month after the album, and moved to the top of the Billboard Hot 100 in the United States in February, where it would stay for four weeks.\n\nUpon release, Stayin' Alive climbed the charts, hitting the number one spot on the Billboard Hot 100 the week of February 4, 1978, and staying there for four weeks. In the process, it became the band's most recognizable tune, in part because of its place at the beginning of Saturday Night Fever.\n\nThis music video for the song is of a completely different concept to Saturday Night Fever. It depicts the group singing the song on an abandoned subway terminal set at MGM Studios, directly adjacent to the one where the boys were filming Sgt. Pepper's Lonely Hearts Club Band at the time. This set featured buildings, a train station, and other elements. \n(video has a 5 semi-transparent blue dots at the bottom right) \n\n\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Stayin'_Alive&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Stayin'_Alive&lt;/a&gt; \n\n\n\nFile properties info using Media Player Classic:\n   Video: MPEG2 Video 720x576 (4:3) 25.00fps 8000kbps\n   Audio: PCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Media Length: 00:03:56\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated September 7, 2010!\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee)\n","torrent":{"xt":"urn:btih:f95858d28ca65761a401f033990fd0a6a4f1fa15","amp;dn":"Bee+Gees+-+Stayin%5C%27+Alive+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f95858d28ca65761a401f033990fd0a6a4f1fa15","infoHashBuffer":{"type":"Buffer","data":[249,88,88,210,140,166,87,97,164,1,240,51,153,15,208,166,164,241,250,21]},"announce":[],"urlList":[]}}