{"title":"Jack Kornfield - Après l'extase, la lessive (Meditation)","uid":13845145,"size":15165576,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fa6eed1109a959e199ae7b7b5635c2f90db7844c&amp;dn=Jack+Kornfield+-+Apr%26egrave%3Bs+l%27extase%2C+la+lessive+%28Meditation%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"asperge","files":2,"time":1457870332,"description":"Jack Kornfield - Après l'extase, la lessive\r\nLa Table Ronde | ISBN : 2710324040 | 2010-03 | PDF/DJVU | 394 pages | 8/6 MB\r\n\r\nLa plupart des épopées spirituelles s'achèvent sur l'illumination ou l'éveil. Mais que se passe-t-il ensuite ? Qu'advient-il lorsque le maître zen rentre chez lui et retrouve femme et enfants ? Qu'arrive-t-il lorsqu'un mystique chrétien va faire ses courses ? A quoi ressemble la vie après l'extase ? Comment vivre de tout son coeur ce qui a été réalisé ? C'est pour répondre à ces questions que Jack Kornfield a mené une vaste enquête auprès de nombreux maîtres et instructeurs qui, après avoir consacré leur vie à une recherche spirituelle, transmettaient à d'autres ce qu'ils avaient eux-mêmes reçu. Maîtres zen, lamas tibétains, rabbins, abbés de monastères, nonnes et yogis, disciples de longue date ou enseignants chevronnés, en acceptant de livrer en toute sincérité les difficultés auxquelles ils ont été confrontés, nous montrent que la sagesse ne consiste pas à nier nos faiblesses mais à les intégrer à notre démarche. Car, comme le dit l'adage : « Ou vous entrerez entier au Paradis, ou vous n'entrerez pas. » Jack Kornfield nous invite à ne plus considérer l'éveil comme une fin en soi mais à privilégier une action éveillée qui, tout en accueillant nos plus profondes expériences spirituelles, accepte de procéder à un grand nettoyage intérieur","torrent":{"xt":"urn:btih:fa6eed1109a959e199ae7b7b5635c2f90db7844c","amp;dn":"Jack+Kornfield+-+Apr%26egrave%3Bs+l%27extase%2C+la+lessive+%28Meditation%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa6eed1109a959e199ae7b7b5635c2f90db7844c","infoHashBuffer":{"type":"Buffer","data":[250,110,237,17,9,169,89,225,153,174,123,123,86,53,194,249,13,183,132,76]},"announce":[],"urlList":[]}}