{"title":"Time Crashers Series 1 2of6 1468 720p x264 AAC HDTV MVGroup.org","uid":12511902,"size":1110754042,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:fa7d2d6d915d97e8dc83473cd94b3f79f0ae2879&amp;dn=Time+Crashers+Series+1+2of6+1468+720p+x264+AAC+HDTV+MVGroup.org&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MVGroup","files":1,"time":1443576284,"description":"Time Crashers: Series 1\r\n\r\nHistory Documentary hosted by Tony Robinson, published by Channel 4 in 2015 - English narration \nhttp://docuwiki.net/images/c/cb/Time-Crashers-Series-1-Cover.jpg\r\n\r\nInformation\r\n------------------------------\r\n\r\nTime Crashers Bold text\r\nSir Tony Robinson presents the six-part immersive history series that sees 10 famous faces leave the 21st century behind and crash-land into different moments in British history\r\nTime Crashers is really well cast. Instead of the usual bunch of identikit glamour models and reality TV stars we have people who've lived a bit, such as Kirstie Alley (from Cheers) and Keith Allen.\r\n\r\n\r\n1)  1588 \r\nTony Robinson presents a show in which 10 celebrities experience life in different eras and undertake a series of challenges to see if they could have coped with life in the past. Kirstie Alley, Fern Britton, Louise Minchin, Zoe Smith, Meg Mathews, Keith Allen, Greg Rutherford, Charlie Condou, Jermaine Jenas and Chris Ramsey must work as servants in an Elizabethan manor house from 1588, while Dr Cassie Newland provides an insight into the Tudor era.\r\n\r\n2)  1468 \r\nTony Robinson gives celebrity time travellers Kirstie Alley, Fern Britton, Louise Minchin, Zoe Smith, Meg Mathews, Keith Allen, Greg Rutherford, Charlie Condou, Jermaine Jenas and Chris Ramsey a taste of life in 1468. They are split into two teams and assigned to work as squires for two knights preparing to face each other in a jousting tournament. They must take on an assortment of tasks, including mending armour, preparing horses and taking their master's urine to be checked for diseases by a physician\r\n\r\n3)  1913 \r\nThe celebrities experience life as servants in an Edwardian stately home in 1913, where the staff have to answer to a stern butler and a strict housekeeper. Kirstie Alley is excited to be the Lady's maid, but the aloof manner of her mistress doesn't go down well with the Hollywood star. Greg Rutherford takes his duties seriously, including emptying Keith Allen's chamber pot and disaster strikes when housemaid Fern Britton drops some cake. The realities of life below stairs hit home as one of the celebrities is unceremoniously dismissed for refusing to carry out her duties.\r\n\r\n4)  1796 \r\nTony Robinson sends Kirstie Alley, Fern Britton, Louise Minchin, Zoe Smith, Meg Mathews, Keith Allen, Greg Rutherford, Charlie Condou, Jermaine Jenas and Chris Ramsey back to 1796, where they are challenged to work on a Georgian farm. The men must prepare the animals and buildings for a visit from the landowner, while the women work in the dairy and prepare afternoon tea.\r\n\r\n5)  1885 \r\nThe celebrities find themselves working in a Victorian fishery in 1885, where they have one day to fulfil a huge order destined for London's Billingsgate Market. The harsh conditions and backbreaking work prove to be a real shock to the system for Kirstie, Fern and Louise, who have to gut 100 fish by hand, while Meg and Zoe attempt to navigate the mudflats wearing strange footwear. The men rake mussels and collect oysters from the shoreline but it is slow going, so Greg and Jermaine head off on a boat to dredge for oysters.\r\n\r\n6)  43AD \r\nThe final challenge takes the celebrities back to the Iron Age to experience life in 43AD. Greg Rutherford and Meg Mathews are elected as the group's tribal chiefs and they have two days to prepare a Celtic feast, as well as dealing with the more pressing concerns of heat, light and food. Jermaine Jenas struggles to get to grips with making fire and Chris Ramsey has trouble skinning a deer in the dark.\r\n\r\nScreenshots\r\n------------------------------ \nhttp://docuwiki.net/images/5/55/Time-Crashers-Series-1-Screen0.jpg \nhttp://docuwiki.net/images/d/dd/Time-Crashers-Series-1-Screen1.jpg \nhttp://docuwiki.net/images/a/a5/Time-Crashers-Series-1-Screen2.jpg \nhttp://docuwiki.net/images/b/be/Time-Crashers-Series-1-Screen3.jpg \nhttp://docuwiki.net/images/1/14/Time-Crashers-Series-1-Screen4.jpg \nhttp://docuwiki.net/images/0/0c/Time-Crashers-Series-1-Screen5.jpg \nhttp://docuwiki.net/images/0/0a/Time-Crashers-Series-1-Screen6.jpg \nhttp://docuwiki.net/images/3/39/Time-Crashers-Series-1-Screen7.jpg \nhttp://docuwiki.net/images/2/23/Time-Crashers-Series-1-Screen8.jpg \nhttp://docuwiki.net/images/9/9e/Time-Crashers-Series-1-Screen9.jpg \nhttp://docuwiki.net/images/d/dc/Time-Crashers-Series-1-Screen10.jpg \nhttp://docuwiki.net/images/e/e3/Time-Crashers-Series-1-Screen11.jpg \r\n\r\nTechnical Specs\r\n------------------------------\r\n\r\n\r\n * Video Codec: x264 CABAC   \r\n * Video Bitrate: 3184 Kbps\r\n * Video Aspect Ratio: 1280 x 720\r\n * Video Resolution: 1.778 (16:9)\r\n * Audio Codec: AAC LC\r\n * Audio: English\r\n * Audio Bitrate: 160 kb/s VBR 48 KHz\r\n * Audio Channels: Stereo 2\r\n * Run-Time: 47mins\r\n * Framerate: 25 fps\r\n * Number of Parts: 6\r\n * Container Mp4\r\n * Part Size: 1.04 GB\r\n * Source: HDTV\r\n * Encoded by: Harry65\r\n\r\n1)  Further Information \nhttp://www.radiotimes.com/programme/dq8kgs/time-crashers","torrent":{"xt":"urn:btih:fa7d2d6d915d97e8dc83473cd94b3f79f0ae2879","amp;dn":"Time+Crashers+Series+1+2of6+1468+720p+x264+AAC+HDTV+MVGroup.org","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa7d2d6d915d97e8dc83473cd94b3f79f0ae2879","infoHashBuffer":{"type":"Buffer","data":[250,125,45,109,145,93,151,232,220,131,71,60,217,75,63,121,240,174,40,121]},"announce":[],"urlList":[]}}