{"title":"Strummin' with the Devil","uid":3513752,"size":100086745,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fa93575a84665cc8cceb08660c1b97d2888d274e&amp;dn=Strummin%5C%27+with+the+Devil&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RockRocko","files":17,"time":1155927916,"description":"Strummin&amp;#039; with the Devil: The Southern Side of Van Halen - A Tribute Featuring David Lee Roth\n\nDetails: \nFrom the get-go, Van Halen proved breathtaking and ballsy in equal measure. Perhaps that?s one of the reasons ?Strummin? with the Devil? works so well. In its own hard-pickin? way, this collection offers a similar sense of musical discovery. Here are those same still-sharp rock gems we know and love retooled using a different sort of metal. Come to think about it, bluegrass and Van Halen have much in common ? including an emphasis on exceptional instrumental prowess and timeless tales of everyday drama played out in great songs of haunting and enduring power. Having David Lee Roth, the man himself, kick off this party celebrating the timeless music of which he was such an essential part is more than just thrilling - it?s downright moving. Could this be magic? Definitely. \n \nTributed Artists: \nVan Halen, David Lee Roth \nFeaturing incredible tributes from David Lee Roth, The John Jorgenson Bluegrass Band, Blue Highway, Mountain Heart, The John Cowan Band, Iron Horse, David Grisman and Sons, and many, many more!\n \nSongs:  \n1  Jump - David Lee Roth with the John Jorgenson Bluegrass Band  \n2  Jamie?s Cryin? - David Lee Roth with the John Jorgenson Bluegrass Band (Full Version)  \n3  I?ll Wait - Blue Highway  \n4  Runnin? with the Devil - the John Cowan Band  \n5  Dance the Night Away - Mountain Heart  \n6  Ain?t Talkin? ?Bout Love - Iron Horse  \n7  Hot for Teacher - David Grisman and Sons  \n8  Feel Your Love Tonight - Tony Trischka, Dudley Connell, Marshall Wilborn, Dave McLaughlin  \n9  Panama - Cornbread Red  \n10  Unchained - Iron Horse  \n11  Ice Cream Man - Larry Cordle  \n12  And the Cradle Will Rock? - the John Jorgenson Bluegrass Band  \n13  Could This Be Magic? - the Nashville Bluegrass Band  \n14  Eruption - Dennis Caplinger  \n15   Jamie?s Cryin? - David Lee Roth with the John Jorgenson Bluegrass Band (Radio Edit)\n","torrent":{"xt":"urn:btih:fa93575a84665cc8cceb08660c1b97d2888d274e","amp;dn":"Strummin%5C%27+with+the+Devil","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa93575a84665cc8cceb08660c1b97d2888d274e","infoHashBuffer":{"type":"Buffer","data":[250,147,87,90,132,102,92,200,204,235,8,102,12,27,151,210,136,141,39,78]},"announce":[],"urlList":[]}}