{"title":"Initial D Live Action 2005 ENG/CHI","uid":3926685,"size":735586830,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fac20d03586ecf17417a9bc1b18185da5af5b3be&amp;dn=Initial+D+Live+Action+2005+ENG%2FCHI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"techiefIve","files":1,"time":1197141932,"description":"Based off the Japanese Manga and anime series Initial D.\n\nTwo mountain road racers, Nakazato and Takahashi, challenged each other to find the best racers, and defeat them in &quot;battles&quot;. Nakazato was surprisingly defeated by an old Toyota Trueno AE86 (Corolla in the US) one night, and he searched for the person who defeated him, which lead him to the Speedstars, a local team. But the car who beat him was actually driven by a local Tofu shop owner&amp;#039;s son, Takumi Fujiwara, who had unknowingly perfected the art of mountain racing through daily deliveries of tofu. Takumi was able to defeat Nakazato again, showing that he is no fluke. However, winning hasn&amp;#039;t helped him home life, as his father, Bunta Fujiwara, was a drunkard (and a racing genius). His girlfriend Natsuki Mogi wants his attention even though she&amp;#039;s got a dark and shameful secret, and his best friend Itsuki (who has no talent in driving) wants Takumi to teach him road racing... after buying the WRONG car. In a mountain road encounter, they ran into Team Emperor&amp;#039;s Mitsubishi Evo, and normally the old junker don&amp;#039;t stand a chance, but when controlled by Takumi they were able to defeat the Evo... And attract the wrath of Sudou, Team Emperor&amp;#039;s leader. In another chance encounter, Sudou ran the AE86 and Takumi to the limit... and beyond... Forcing the AE86 out with a busted engine. However, Takahashi is there to lend a hand. With Bunta&amp;#039;s help, they repaired the AE86, this time with a true racing engine, and a three-way showdown between Takahashi, Fujiwara, and Sudou is on... Who will be the winner at the end?\n\nMKV format\n\nXvid video\n\nMP3 audio (Chinese and English)\n\nChinese and English subs\n\nEnjoy","torrent":{"xt":"urn:btih:fac20d03586ecf17417a9bc1b18185da5af5b3be","amp;dn":"Initial+D+Live+Action+2005+ENG%2FCHI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fac20d03586ecf17417a9bc1b18185da5af5b3be","infoHashBuffer":{"type":"Buffer","data":[250,194,13,3,88,110,207,23,65,122,155,193,177,129,133,218,90,245,179,190]},"announce":[],"urlList":[]}}