{"title":"[FS9-FSX-P3D] FS Global.Real Weather v1.7","uid":8922007,"size":7672680,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fb339cbfe6141fe54dce53f918c7357a9c3548a1&amp;dn=%5BFS9-FSX-P3D%5D+FS+Global.Real+Weather+v1.7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NunoMMG","files":1,"time":1379275345,"description":"The ultimate Weather Engine for FSX, Prepar3D and soon to be, others, giving you the best real weather experience in your simulator. Features include real upper and lower air winds, cloud types, clear air turbulence, icing, historic weather, weather reporting and flight planning and compatibility with ATC and AI Traffic.\n\nOVERVIEW\nFS Global Real Weather is a fast loading, easy to use, weather engine for Microsoft Flight Simulator X, Flight Simulator 2004 (from V1.7) and Lockheed Martins Prepar3D. We are planning to support X-Plane in the near future.\n\nFS Global Real Weather not only delivers weather data calculated out of realtime data of more than 24.000 observation stations (land- and seabased) worldwide. It also calculates air masses and temperatues for upper airlevels on a scientific base, which is absolutely necessary for correct flight planning using real world tools. As a first in history of FS weather tools it supports local weather phaenomena (e.g. Foehn weather at Innsbruck; LOWI). It is available as a download and sometimes later as a boxed version.\n\n\nINFORMATION ABOUT THE CURRENT RELEASE\nVersion 1.7 Build #014 was released on September 4th 2013 and contains the following changes:\n      .) Completely rewritten Network Bridge for better performance and multiple simulator support.\n      .) A bug, that caused the weather to be reset repeatedly when choosing &quot;Reset Weather&quot; when connected via Network Bridge, was fixed.\n      .) The &quot;Test Connection&quot; feature in the network section of the settings was fixed, so that it now correctly informs the user about a\n         successful connection attempt.\n      .) Added more log messages (especially when working with FSGRW Network Bridge) to make it easier to identify problems.\n      .) We have added new aircraft profiles for the flight planner (a big thank you to all contributing users):\n          -) Boeing 747-400 (Light)\n          -) Boeing 747-400 (Heavy)\n\n\n\nROAD MAP FOR FUTURE UPDATES\nWe are currently working on or planning the next mayor updates which may contain:\n      .) X-Plane support\n      .) More local weather effects. Please email your requests!\n      .) Further performance improvements for weather transfer\n","torrent":{"xt":"urn:btih:fb339cbfe6141fe54dce53f918c7357a9c3548a1","amp;dn":"%5BFS9-FSX-P3D%5D+FS+Global.Real+Weather+v1.7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb339cbfe6141fe54dce53f918c7357a9c3548a1","infoHashBuffer":{"type":"Buffer","data":[251,51,156,191,230,20,31,229,77,206,83,249,24,199,53,122,156,53,72,161]},"announce":[],"urlList":[]}}