{"title":"China MiÃƒÂ©ville - Perdido Street Station.pdf","uid":5475483,"size":1872488,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb433a208135ea9956c3f4eb3fb6531111fede98&amp;dn=China+Mi%C3%83%C2%A9ville+-+Perdido+Street+Station.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"artpepper","files":-1,"time":1270120635,"description":"Perdido Street Station by China MiÃƒÂ©ville  (2003)\n\n\nKing Rat (1999), Mieville's much-praised first novel of urban fantasy/horror, was just a palate-teaser for this appetizing, if extravagant, stew of genre themes. \n\nIts setting, New Crobuzon, is an audaciously imagined milieu: a city with the dimensions of a world, home to a polyglot civilization of wildly varied species and overlapping and interpenetrating cultures. Seeking to prove his unified energy theory as it relates to organic and mechanical forms, rogue scientist Isaac Dan der Grimnebulin tries to restore the power of flight to Yagharek, a member of the garuda race cruelly shorn of its wings. \n\nIsaac's lover, Lin, unconsciously mimics his scientific pursuits when she takes on the seemingly impossible commission of sculpting a patron whose body is a riot of grotesquely mutated and spliced appendages. Their social life is one huge, postgraduate bull session with friends and associates--until a nightmare-inducing grub escapes from Isaac's lab and transforms into a flying monster that imperils the city. This accident precipitates a political crisis, initiates an action-packed manhunt for Isaac and introduces hordes of vividly imagined beings who inhabit the twilight zone between science and sorcery. \n\nMieville's canvas is so breathtakingly broad that the details of individual subplots and characters sometime lose their definition. But it is also generous enough to accommodate large dollops of aesthetics, scientific discussion and quest fantasy in an impressive and ultimately pleasing epic.","torrent":{"xt":"urn:btih:fb433a208135ea9956c3f4eb3fb6531111fede98","amp;dn":"China+Mi%C3%83%C2%A9ville+-+Perdido+Street+Station.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb433a208135ea9956c3f4eb3fb6531111fede98","infoHashBuffer":{"type":"Buffer","data":[251,67,58,32,129,53,234,153,86,195,244,235,63,182,83,17,17,254,222,152]},"announce":[],"urlList":[]}}