{"title":"Capitalism A Treatise on Economics by George Reisman","uid":9253791,"size":4559976,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb8976f7e3d2a90828ce5f24be5c68cbacc0904a&amp;dn=Capitalism+A+Treatise+on+Economics+by+George+Reisman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":6,"time":1385514586,"description":"Aimed at both the intelligent layman and the professional economist, this book is the most comprehensive and intellectually powerful explanation of the nature and value of laissez-faire capitalism that has ever been written. It represents a twofold major integration of truths previously discovered by other writers, combined with numerous original contributions made by the author himself. Within economic theory, it integrates leading ideas of the Austrian school with needlessly abandoned doctrines of the British classical school. It further integrates such reconstituted economic theory with essential elements of Ayn Rand's philosophy of Objectivism. \nOn the foundation of these integrations, Dr. Reisman is able to develop the numerous major original contributions that the book presents on the subjects of profits, wages, saving, capital accumulation, aggregate economic accounting, monopoly, and natural resources, among other vital subjects. Based on the same foundation, the book presents the most powerful critiques of Marx, Keynes, the pure-and-perfect competition doctrine, and environmentalism to be found anywhere.\nA leading part of its trenchant economic analysis is a consistent demonstration of the natural harmony of the rational self-interests of all men under capitalism--of businessmen and wage earners, of consumers and producers, of men of all races and nationalities, including immigrants and the native born, and of competitors of all levels of ability--consonances most will find astonishing, given the prevailing misunderstandings of capitalism.\nThe book's importance and appeal to a general audience are evident in its description of prevailing attitudes toward capitalism and its challenge to learn why they are all completely wrong and the cause of self-destructive political behavior on a massive scale. For those with the intellectual courage to accept a challenge of having many of their firmest and most cherished beliefs reduced by unanswerable logic to the status of Dark-Age superstitions, here are some of the beliefs that Reisman's book demolishes: The profit motive is the cause of starvation wages, exhausting hours, sweatshops, and child labor; of monopolies, inflation, depressions, wars, imperialism, and racism. Saving is hoarding. Competition is the law of the jungle. Economic inequality is unjust and the legitimate basis for class warfare. Economic progress is a ravaging of the planet and, in the form of improvements in efficiency, a cause of unemployment and depressions. War and destruction or additional peacetime government spending are necessary to prevent unemployment under capitalism. Economic activity other than manual labor is parasitical. Businessmen and capitalists are recipients of &quot;unearned income&quot; and are &quot;exploiters.&quot; The stock and commodity markets are &quot;gambling casinos&quot;; retailers and wholesalers are &quot;middlemen,&quot; having no function but that of adding &quot;markups&quot; to the prices charged by farmers and manufacturers; advertisers are inherently guilty of fraud--the fraud of attempting to induce people to desire the goods that capitalism showers on them, but that they allegedly have no natural or legitimate basis for desiring.\nReisman's book flies in the face of all such anticapitalistic ideas and demands. Its thesis is that never have so many people been so ignorant and confused about a subject so important, as most people now are about economics and capitalism. It argues that in its logically consistent form of laissez-faire capitalism--that is, with the powers of government limited to those of national defense and the administration of justice--capitalism is a system of economic progress and prosperity for all, and is a precondition of world peace. Following an exhaustive economic analysis of virtually every aspect of capitalism, the book's concluding chapter is devoted to the presentation of a long-range political-economic program for the achievement of a fully capitalist society.","torrent":{"xt":"urn:btih:fb8976f7e3d2a90828ce5f24be5c68cbacc0904a","amp;dn":"Capitalism+A+Treatise+on+Economics+by+George+Reisman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb8976f7e3d2a90828ce5f24be5c68cbacc0904a","infoHashBuffer":{"type":"Buffer","data":[251,137,118,247,227,210,169,8,40,206,95,36,190,92,104,203,172,192,144,74]},"announce":[],"urlList":[]}}