{"title":"Schritt fuer Schritt zum WLAN","uid":4186527,"size":1625608,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fc4212ca06b6f627cdcba63b8d60917557822ac9&amp;dn=Schritt+fuer+Schritt+zum+WLAN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Falco2two","files":1,"time":1210704912,"description":"&lt;b&gt;Ratgeber-Special: Schritt fuer Schritt zum WLAN&lt;/b&gt;\n\nUm einen schnellen Datenfluss und die noetige Sicherheit Ihres WLANs zu gewaehrleisten, muessen Sie einige wichtige Grundregeln beachten. In unserem Ratgeber-Special verraten wir Ihnen, worauf Sie bei Installation und Betrieb eines drahtlosen Netzwerkes achten sollten.\n\nDatenaustausch zwischen PCs, Internet-Zugang und Videouebertragung - alles ohne Kabel und umstaendliche Installation: So verspricht es die Werbung. DerDatenfunk birgt aber einige Tuecken, schlieÃƒÅ¸lich sollen Infopakete einerseits schnell, andererseits aber auch sicher vor Datenschnuefflern ans Ziel gelangen.\n\nIn unserem Ratgeber-Special sagen wir Ihnen, welche Komponenten Sie fuer Ihr WLAN benoetigen und erklaeren Schritt fuer Schritt, wie Sie es einrichten.\nObwohl Windows XP mit Service Pack 2 eine gute WLAN-Grundausstattung hat, gibt es eine Reihe empfehlenswerter Tools, die Sie als Funknetznutzer\nunbedingt kennen sollten. Damit Sie auch mehrere Geraete miteinander vernetzen koennen, zeigen wir, wie Sie sich ein Heimnetzwerk einrichten. Doch\nneben hoechster Mobilitaet und Bequemlichkeit hat WLAN eine Schattenseite. Anders als bei kabelgebundener Kommunikation kann jede WLAN-Komponente in\nReichweite Ihre Funksignale empfangen - egal ob von der StraÃƒÅ¸e aus oder der Wohnung gegenueber. Somit sind Sie das ideale Ziel fuer Datenspione. Wir\nverraten, mit welchen Tricks die Profis arbeiten und wie Sie Ihr Netzwerk gegen Angreifer sorgfaeltig abschotten.\n\nDie Inhalte im Ueberblick:\nSchnellstart ins WLAN: Diese Komponenten benoetigen Sie\nHeimnetzwerk: Das sind die Vorteile\nDie passende Technik fuers Netz: Kabel, Stromnetz oder Funk?\nSchritt fuer Schritt einrichten: Mit diesen Grundregeln kann nichts schief gehen\nJetzt geht?s los: Leichter Arbeiten und Kosten sparen - wir zeigen, wie?s geht\nDie Tricks der WLAN-Hacker: So gehen Daten-Schnueffler vor\nSicher ist sicher: So sichern Sie das Netz gegen Schnueffler aus dem Internet - und gegen zu viel Neugier aus den eigenen Reihen.\nWLAN-Toolbox: Nuetzliche Werkzeuge, die Sie als Funknetznutzer unbedingt kennen sollten.","torrent":{"xt":"urn:btih:fc4212ca06b6f627cdcba63b8d60917557822ac9","amp;dn":"Schritt+fuer+Schritt+zum+WLAN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc4212ca06b6f627cdcba63b8d60917557822ac9","infoHashBuffer":{"type":"Buffer","data":[252,66,18,202,6,182,246,39,205,203,166,59,141,96,145,117,87,130,42,201]},"announce":[],"urlList":[]}}