{"title":"Stone Temple Pilots - APE Discography","uid":9638553,"size":2588731846,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fd8956e5c47af4bbbecdf71c6dbd6e28656996f1&amp;dn=Stone+Temple+Pilots+-+APE+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"jmwreck","files":165,"time":1392874603,"description":"Stone Temple Pilots (often abbreviated STP), currently known as Stone Temple Pilots with Chester Bennington, is an American rock band from San Diego, California, that currently consists of brothers Robert (bass, backing vocals) and Dean DeLeo (guitar), Eric Kretz (drums, percussion), and Chester Bennington (lead vocals). Since its formation, STP's line-up had remained unchanged until the dismissal of lead vocalist Scott Weiland in 2013[2] and the subsequent addition of Bennington of Linkin Park fame as his replacement vocalist.\n\nAfter forming in 1985 under the name Mighty Joe Young, the band signed with Atlantic Records and changed its name to Stone Temple Pilots. STP found immediate success in 1993 upon releasing their debut album Core (1992), and went on to become one of the most commercially successful bands of the 1990s.[3] The band released four more studio albums: Purple (1994), Tiny Music... Songs from the Vatican Gift Shop (1996), No. 4 (1999) and Shangri-La Dee Da (2001) before separating in 2003, after which the band members partook in various projects, most notably Velvet Revolver and Army of Anyone. STP eventually reconvened in 2008 for a reunion tour, released a new self-titled album in 2010, and have been actively touring since, although Weiland was fired from the band and was replaced by Bennington in 2013. The band's first material with Bennington, the EP High Rise, was released October 8.[4]\n\nWhile initially displaying a sound typically identified as grunge early on in its career, further releases from the band expressed a variety of influences, including psychedelic rock, bossa nova and classic rock. The band's evolution throughout the 1990s and early 2000s involved several tumultuous periods of commercial highs and lows, brought about in part by Weiland's well-publicized struggles with drug addiction.\n\nWIKI","torrent":{"xt":"urn:btih:fd8956e5c47af4bbbecdf71c6dbd6e28656996f1","amp;dn":"Stone+Temple+Pilots+-+APE+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd8956e5c47af4bbbecdf71c6dbd6e28656996f1","infoHashBuffer":{"type":"Buffer","data":[253,137,86,229,196,122,244,187,190,205,247,28,109,189,110,40,101,105,150,241]},"announce":[],"urlList":[]}}