{"title":"Gospel of Matthew (19 Commentaries)","uid":10285212,"size":152792561,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fdb1768011dd9c422bdeb114c3721dcb87af947c&amp;dn=Gospel+of+Matthew+%2819+Commentaries%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":80,"time":1401771450,"description":"Nineteen volumes of commentary on Matthew's gospel; various formats.\n\nThe perspectives vary widely, including moderate conservative and liberal, Catholic and Protestant. I believe most of these commentaries represent mainstream scholarship; none of them are from a fundamentalist perspective.\n\nIn addition, these commentaries vary widely in their approach and intended audience: there's a devotional commentary, several theological commentaries, several other commentaries that are rather intensely exegetical, one patristic commentary, a couple that might be considered beginner's commentaries, etc. There are also a couple of studies of topics in the gospel. But there are no specialized monographs.\n\nThe formatting is generally quite good, but several volumes (such as the Bruners) come from a retail source that doesn't convert with all its formatting intact, so it looks a bit like an OCR'd book. Not great, but readable. (This is especially unfortunate for Bruner, because his work is just about the best commentary I know of. See what Eugene Peterson says about him in this book: http://thepiratebay.se/torrent/8794164/ .)\n\nBasically this is everything I have that I haven't already uploaded. Well, I may have overlooked something, but I think this is all there is!\n\n1. Fire of Mercy, Heart of the Word, Vol. 1-3 - Erasmo Leiva-Merikakis (epub, mobi)\n2. Matthew: A Commentary, Vol. 1-2 - Frederick Dale Bruner (epub, mobi)\n3. Matthew and Empire: Initial Explorations - Warren Carter (pdf)\n4. Matthew 2e (Readings) - Margaret Davies (pdf)\n5. Matthew (Abingdon NT Comt) - Donald Senior (epub, mobi)\n6. Matthew (New Cambridge Bible Commentaries) - Craig A. Evans (pdf)\n7. The Gospel of Matthew (New Intl Comt on the NT) - R. T. France\n8. Commentary on Matthew (Father of the Church) - St. Jerome (pdf)\n9. A Commentary on the Gospel of Matthew - Craig S. Keener\n10. Matthew (Westminster Bible Companion) - Thomas G. Long\n11. The Gospel of Matthew (Catholic Comt on Sacred Scripture) - Curtis Mitch &amp; Edward Sri\n12. St. Matthew (The Navarre Bible) - University of Navarre (epub, mobi)\n13. Matthew (Zondervan Exegetical Comt on the NT) - Grant R. Osborne &amp; Clinton E. Arnold (epub, mobi)\n14. Methods for Matthew - Mark Allan Powell (pdf)\n15. The Gospel of Matthew in Its Roman Imperial Context - John K. Riches &amp; David C. Sim (editors) (pdf)\n16. Who Is Jesus Christ? Unlocking the Mystery in the Gospel of Matthew - Eric Sammons\n17. The Gospel of Matthew - Rudolf Schnackenburg (epub, mobi)\n18. Matthew (Paideia Comt on the NT) - Charles H. Talbert (pdf)\n19. Matthew: A Devotional Commentary - Leo Zanchettin (epub, mobi)\n\nMy thanks to the original uploaders.\n\n-----\n\nThere are a few other good Matthew commentaries here:\n\nN. T. Wright -- &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8201402&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8201402&lt;/a&gt; &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8205746&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8205746&lt;/a&gt;\nStanley Hauerwas -- &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/9119880&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/9119880&lt;/a&gt;\nBen Witherington -- &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8783697&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8783697&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:fdb1768011dd9c422bdeb114c3721dcb87af947c","amp;dn":"Gospel+of+Matthew+%2819+Commentaries%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdb1768011dd9c422bdeb114c3721dcb87af947c","infoHashBuffer":{"type":"Buffer","data":[253,177,118,128,17,221,156,66,43,222,177,20,195,114,29,203,135,175,148,124]},"announce":[],"urlList":[]}}