{"title":"The Day Hollywood Died (2013)","uid":9433750,"size":827484486,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fe0dd04e4cb11c1f6b6edd2982e9ce9d3573dff9&amp;dn=The+Day+Hollywood+Died+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"spudger","files":-1,"time":1388854614,"description":"He just woke up. He's in a hospital. He can't move. He can't remember who he is. Memories begin to flood back to him as he regains consciousness. He was part of a heist gone wrong. One of a crew of six asked to steal a briefcase from a secret vault. But that's all he can remember. He will combat the drugs and the pain and the solitude in a desperate effort to remember what happened to him and why. But once he finally reaches the end of his quest for answers he will wish he never began.\n\nOne survivor of a seemingly failed robbery is left without any memory of what happened and has no idea who he is. Unable to move and kept alive by a machine, his frustration and desperation drive him to reconstruct what may have happened.\n\nTHE UNREMEMBERED MISSION WAS SIMPLE: Steal a briefcase from a safe deposit box then meet his co-conspirators at a derelict depot outside of town. The thieves, with code names mysteriously drawn from the exploits of the tale of Peter Pan, needed only to wait until midnight to collect their payment.\n\nBut something went wrong. This survivor is left with a frantic search for answers as he haphazardly attempts to remember what happened.\n\nDid anyone else survive? What happened to the briefcase? How much of this is from his damaged memory and how much is made up? Who is he? And what on earth does all of this have to do with Hollywood?\n\nRelease Date\t2012\nRunning Time 99 Minutes\nResolution: HD 1920 X 1080 (Blu Ray Rip)\nGenre\tAction, Drama, Comedy\nStudio\tRising Pictures\nStarring\tDrew Pearson, Tommy Bradson, Amy McWatters, Nenif David, Benjamin Barrymore Hanly, Maroun Joseph, Eric Rizk, Robin Queree\nDirected By\tRonnie S. Riskalla\nWritten By\tK.G. Donovan\nScreenplay By\tK.G. Donovan\nProduced By\tSam Kanj\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1863408/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1863408/&lt;/a&gt;\n\n\n\n\n\n","torrent":{"xt":"urn:btih:fe0dd04e4cb11c1f6b6edd2982e9ce9d3573dff9","amp;dn":"The+Day+Hollywood+Died+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe0dd04e4cb11c1f6b6edd2982e9ce9d3573dff9","infoHashBuffer":{"type":"Buffer","data":[254,13,208,78,76,177,28,31,107,110,221,41,130,233,206,157,53,115,223,249]},"announce":[],"urlList":[]}}