{"title":"Stress Analysis of Fiber-Reinforced Composite Materials updated","uid":14749851,"size":9780716,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe79c13bb043ec1cbac35409c51d8a1de7524c11&amp;dn=Stress+Analysis+of+Fiber-Reinforced+Composite+Materials+updated&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1464745980,"description":"Stress Analysis of Fiber-Reinforced Composite Materials - M. W. Hyer (DEStech, 2009).pdf\r\n\r\nISBN 978-1-932078-86-2\r\n\r\nUpdated and improved, Stress Analysis of Fiber-Reinforced Composite Materials, Hyer's work remains the definitive introduction to the use of mechanics to understand stresses in composites caused by deformations, loading, and temperature changes. In contrast to a materials science approach, Hyer emphasizes the micromechanics of stress and deformation for composite material analysis. The book provides invaluable analytic tools for students and engineers seeking to understand composite properties and failure limits. A key feature is a series of analytic problems continuing throughout the text, starting from relatively simple problems, which are built up step-by-step with accompanying calculations. The problem series uses the same material properties, so the impact of the elastic and thermal expansion properties for a single-layer of FR material on the stress, strains, elastic properties, thermal expansion and failure stress of cross-ply and angle-ply symmetric and unsymmetric laminates can be evaluated. The book shows how thermally induced stresses and strains due to curing, add to or subtract from those due to applied loads. Another important element, and one unique to this book, is an emphasis on the difference between specifying the applied loads, i.e., force and moment results, often the case in practice, versus specifying strains and curvatures and determining the subsequent stresses and force and moment results. This represents a fundamental distinction in solid mechanics","torrent":{"xt":"urn:btih:fe79c13bb043ec1cbac35409c51d8a1de7524c11","amp;dn":"Stress+Analysis+of+Fiber-Reinforced+Composite+Materials+updated","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe79c13bb043ec1cbac35409c51d8a1de7524c11","infoHashBuffer":{"type":"Buffer","data":[254,121,193,59,176,67,236,28,186,195,84,9,197,29,138,29,231,82,76,17]},"announce":[],"urlList":[]}}