{"title":"Dragonlance Collection - 24 Novels","uid":9336219,"size":9316015,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fef71a7035a7609202955b0113a9c1277807c5d1&amp;dn=Dragonlance+Collection+-+24+Novels&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1386858229,"description":"I think in all there are 24 novels in this torrent.If anyone has other requests in this series,please post them.I will try my best to upload them.\n\nDragonlance is a shared universe created by Laura and Tracy Hickman, and expanded by Tracy Hickman and Margaret Weis under the direction of TSR, Inc. into a series of popular fantasy novels.\n\nDragonlance Chronicles by Magaret Weis &amp; Tracy Hickman\n1. Dragons of Autumn Twilight:\nLifelong friends, they went their separate ways. Now they are together again, though each holds secrets from the others in his heart. They speak of a world shadowed with rumors of war. They speak of tales of strange monsters, creatures of myth, creatures of legend. They do not speak of their secrets. Not then. Not until a chance encounter with a beautiful, sorrowful woman, who bears a magical crystal staff, draws the companions deeper into the shadows, forever changing their lives and shaping the fate of the world.\n2. Dragons of Winter Night:\nNow the people know that the dragon minions of Takhisis, Queen of Dragons, have returned. The people of all nations prepare to fight to save their homes, their lives, and their freedom. But the races have long been divided by hatred and prejudice. Elven warriors and human knights fight among themselves. It seems the battle has been lost before it begins. The companions are separated, torn apart by war. A full season will pass before they meet again--if they meet again. As the darkness deepens, a disgraced knight, a pampered elfmaiden, and a rattle-brained kender stand alone in the pale winter sunlight.\n3. Dragons of Spring Dawning:\nThe war against the dragon minions of Queen Takhisis rages on. Armed with the mysterious, magical dragon orbs and the shining, silver dragonlance, the companions bring hope to the world. But now, in the dawn of a new day, the dark secrets that have long shadowed the hearts of the friends come to the light. Betrayal, treachery, frailty, and weakness will nearly destroy all that they have accomplished. The greatest battle they have left to fight is within each of them. Yet, in the end, they will be heroes.\n\nDwarven Nations Trilogy\n\nThe Covenant of the Forge (Dragonlance Dwarven Nations Trilogy, Volume 1)\nExplores the folklore and history of the dwarven clans of Krynn through the bickering clans' reconciliation and the construction of the legendary Thorbardin. By the author of Gates of Thorbardin.\n\nHammer and Axe: Dwarven Nations Trilogy, Vol 2 (Dragonlance)\nWhen the humans of Ergoth threaten Thorbardin, the clans of Thorbardin are drawn into territorial wars between humans and elves.\n\nThe Swordsheath Scroll: The Dwarven Nations Trilogy Vol 3 (Dragonlance Saga)\nThe historical saga of the rival dwarven clans only hinted at in previous Dragonlance books, this story recounts the rise of Derkin, King of the Living Stone, whose bravery and wisdom is written in drawven annals.\n\nDragonlance: Heroes series\nThe Legend of Huma (Dragonlance: Heroes #1)\n&quot;To the West Huma rode, to the High Clerist's Tower,\nOn the back of the Silver Dragon\nAnd the path of their flight crossed over a desolate country\nwhere the dead walked only, mouthing the names of dragons.&quot;\n\nFor the first time in the best-selling DragonlanceÂ® Saga, here is The Legend of Huma, fabled Hero of the Lance: his mysterious origins and his Oath to the Measure; treachery among the Knights of Solamnia; his love for the Silver Dragon; the fated showdown between the Queen of Darkness and the forces of Paladine.\n\nOnly fragments of Huma's story survived the Cataclysm of Krynn -- until now.\n\nStormblade (Dragonlance: Heroes #2)\nThe second in a series of recovers of classic Dragonlance novel tales. \nThis attractive new re-release of Stormblade showcases a new look for the Heroes series. Each title in the series will reflect the new series design and feature entirely new cover art.\n\nWeasel's Luck (Dragonlance: Heroes #3)\nThe third in a series of recovers of classic Dragonlance novel tales. \nThis attractive new re-release of Weasel's Luck showcases a new look for the Heroes series.\n\nAmong others","torrent":{"xt":"urn:btih:fef71a7035a7609202955b0113a9c1277807c5d1","amp;dn":"Dragonlance+Collection+-+24+Novels","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fef71a7035a7609202955b0113a9c1277807c5d1","infoHashBuffer":{"type":"Buffer","data":[254,247,26,112,53,167,96,146,2,149,91,1,19,169,193,39,120,7,197,209]},"announce":[],"urlList":[]}}